{
	"Demon Hunter": {
		"Arena": [
			[
				[
					"Seems to me that Vengeance is currently far more viable in instanced PVP than Havoc.",
					"Was playing against low rating combo of healer Havoc and Vengeance and I can tell that Vengeance was harder to kill while doing high burst and more damage overall in the arena."
				],
				"Arena",
				-0.76195,
				"arena.",
				0,
				1
			],
			[
				[
					"Are you serious DHs are immortal i've never started arena thinking i will kill DH first because i cant do it.Its not that i am that expirianced player but i dont have to be to know it .If you cant survive as a DH you are probably doing something wrong."
				],
				"Arena",
				-0.7684,
				"arena",
				0,
				1
			],
			[
				[
					"it happens constantly in arena whenever i fel rush against a wall or a pillar, some people know it and take advantage of it, its pretty frustrating to be honest."
				],
				"Arena",
				0.6808,
				"arena",
				1,
				1
			],
			[
				[
					"05/11/2016 21:22Posted by BurshyI commented in the other thread too but I have figured out that it's when it's a lot of  enemies and effects are going on.",
					"So like in arena with enemy players doing their stuff or in dungeons with a lot of effects and enemies.",
					"And what you do is you fel rush and you tweak the camera so you view your char from the side while you fel rush.",
					"Then it DCs.It just seems like an overload and maybe some corruption in packets sent, so server discs us.It happens once a day the most to me, and it's not always when there are a lot of things going on.Occassionally I get a short stutter when felrushing but no discs.I guess it's just bad coded which causes some overload or corruption."
				],
				"Arena",
				-0.538775,
				"arena",
				1,
				1
			],
			[
				[
					"First off I understand running bloodlet in arena(despite not done any arena yet due to disheartening constant felrush dc's).But at least for random bgs i find it funny that almost noone uses felblade.While bloodlet dmg is a really nice plus,i find more value to been able to stick like a glue to targets.",
					"(also the dmg from it is not bad either+fury gen)Your thoughts?"
				],
				"Arena",
				0.62145,
				"arena(despite",
				1,
				1
			],
			[
				[
					"Hey guys,I was wondering what everyone thinks is the best 2v2 Partner for a DH?"
				],
				"Arena",
				0.6369,
				"2v2",
				1,
				1
			],
			[
				[
					"All that video showed was a couple of idiot PVPrs who didn't do their research, don't know how to CC, don't know how to spread out and don't even know how to play their own classes.They probably went into arena thinking they were going to face-roll with their comp and were having an easy time until they came across a DH who knew how to PVP and got reked, they even presented a perfect setup for the DH to blow all his CD's.Nothing wrong happened in that match, it's clearly a L2P issue."
				],
				"Arena",
				0.6486,
				"arena",
				1,
				1
			],
			[
				[
					"02/09/2016 10:31Posted by Nikital02/09/2016 10:18Posted by RaphnerIf you dont play endgame PVE or Highend rated Arena.Then i dont expect you to understand why you need taunt as DPS.Taunt is a skill based ability that can be used in SO many ways in PVE and PVP.I want a blue post about this.No DPS class from what I know has a taunt (Hunters/Warlocks pets does not count) Taunt in PvE is an tank ability to peel of Boss/adds that is running amok.And demanding a Blue post won't get you a blue post.",
					"Your best way is to send feedback via the ingame client.all Druid specs get Growlall DK specs get Dark Commandall Monk specs get Provokeall Paladin specs get Hand of Reckoningall Warrior specs get TauntDH is the ONLY class with the ability to tank that doesn't have a taunt in all specs"
				],
				"Arena",
				0.55365,
				"rated",
				1,
				1
			],
			[
				[
					"20/11/2016 17:43Posted by Snaplèxityomfg just cause Ive killed 3 ppl in skirmish alone, doesnt mean they need a nerf, you guys are freaking terrible in skirmishes and random bgs honestly.People still backpedaling in 2016 , people still dont know how to use addons,how to kick and interupt or when to stun someone, or when to kite someone?yea go play skirmishes and cry about how MY DH is OP wit 32 traits and high ilvlbut yea maybe try rated where people are not that unskilledand they know something about classesDon't ask the impossible from a guy who plays a Stormwind Guard."
				],
				"Arena",
				-0.9022,
				"skirmish",
				0,
				1
			],
			[
				[
					"If the Shaman in my Arena Team drops C'Strike Totem and i use Darkness over it , is the buff gonna cover the totem / is the totem going to get the benefit of the ''reduced chance to be hit''?",
					":O"
				],
				"Arena",
				0.0,
				"Arena",
				1,
				1
			],
			[
				[
					"bgs and skirmishing mostly, dont have time for rated play, and if i cant play it seriously ill just have fun rather than go be 190 rated as i am today :)) besides, dont think i have the skills to go much higher than that :D"
				],
				"Arena",
				0.8705,
				"rated",
				1,
				1
			],
			[
				[
					"I honestly want to know why is the bonus for the legendary chest LEECH?",
					"I got the chest yesterday, but it was only 10ilvl above the chest I already had, so the upgrade was not insane but I was hoping the bonus would compensate for that until I actually read the thing.I heard you cannot even use the bonus in arenas or rated bgs.",
					"Is it just a glorified gimmick to be used exclusively in RBG and world questing because it sure as !",
					"@#$ ain't changing anything about my DPS in PvE that blizzard went and made lack luster."
				],
				"Arena",
				0.5303,
				"rated",
				0,
				1
			],
			[
				[
					"Not that i look too much arena championships competitions, but everytime i got into a championship stream there was always atleast 1 mage, so please if u would whine from a frost dk, we could be more in simpathy with ya bro, but cmn, ur the class that was always OP on atleast 1 of the specs..."
				],
				"Arena",
				0.7709,
				"arena",
				1,
				1
			],
			[
				[
					"Id assume its in instanced PvP, not sure what they are like there now, but atleast they are still ridiculously OP in the open world and PvE in general :P Bastards topping the meters in every scenario ;pOn the other hand, before patch 7.1.5, for example, 2v2 bracket was dominated by DHs, when i did it, they were really OP, they couldn't be touched and would destroy anyone in seconds, assuming he knows what he is doing :PThen came 7.1.5 and they got buffed for whatever reason, so these nerfs are probably needed, but don't quote me on that."
				],
				"Arena",
				-0.6789,
				"2v2",
				1,
				1
			],
			[
				[
					"<1500 rated mage talks about pvp balance this is hilarious :)"
				],
				"Arena",
				0.6908,
				"rated",
				0,
				1
			],
			[
				[
					"14/01/2017 09:09Posted by MucenieksThey listened to your prayers, lol..more like whining...and people who didnt play arena for 10 matches..they were the biggest whiners.. glad you all happy now"
				],
				"Arena",
				0.8,
				"arena",
				1,
				1
			],
			[
				[
					"While not in arena, it has happened that I have fallen down without floating slowly, taking serious fall damage.I have filed a bug report in-game for this though.11/10/2016 08:51Posted by FelcannonIt's either a life saver or a terrible choice.",
					"Off topic has anyone noticed that NPCs can still attack you whilst you're in the air?Yes.",
					"Enemy players can also still attack you, if they have the range."
				],
				"Arena",
				-0.6504333333333334,
				"arena,",
				1,
				0
			],
			[
				[
					"23/12/2016 08:39Posted by Verathixstop sucking would be my first suggestion.my second is that blizz screwd up pvp balance and ppl only want the \"best\" possible combo so they can win and get on with lifeBut you have never been in the arena with your dh.",
					"\"blizz screwd up pvp balance\" When was WoW ever balanced?"
				],
				"Arena",
				0.6208,
				"arena",
				0,
				1
			],
			[
				[
					"What you think guys about demon hunters?For me demon hunters from today arenas do really awesome job.One demon hunter from NG Blue was do awesome job.",
					"His awesome glide and high damage from fel rush do nice job.What you think guys?",
					"Why on this Arena European Championship we have so many demon hunters and so less rest classess like rogue,mages and druids?"
				],
				"Arena",
				0.6899000000000001,
				"Arena",
				1,
				1
			],
			[
				[
					"Is some way to adjust color of wings when gliding?",
					"(belf) Everythin is green, eyes is green but then you glide and wings is in some shty viloet or wtf is this:D ruins my mogs plans so hard,Is some way to adjuat color of.wings when gliding?",
					"(belf) Everythin is green, eyes is green but then you glide and wings is in some shty viloet or wtf is this:D ruins my mogs plans so hard"
				],
				"Arena",
				-0.5945666666666667,
				"",
				1,
				0
			],
			[
				[
					"I'd agree but in 2s you had to wait 5-6 minutes for the dampening to kick in before you were able to kill anyone.",
					"In 3s you had to play 1 or 2 comps or you were doomed.",
					"Now we actually were top tier and had a choice for comps.",
					"But it lasted a little over a day to be sad.",
					"I actually tested the spec/burst now on a leather user(Druid) without him popping any defensives in a War Game.",
					"Barely took him down to 45% and that was without his hots or defensives.",
					"Other classes like rogues or druids or warlocks keep getting insanely strong yet we get a glimmer of power and its taken away instantly.",
					"Yeah call me salty and all that but i think its unfair to nerf something that heavily just because a couple of kids and arena players are from certain guilds ,*cough* Method *cough*, decided they should be nerfed to the ground.",
					"I dont think we didnt deserve a nerf, on the contrary, we needed a nerf just not this severe one.",
					"If they had only changed Mana Break its current state we should have been fine.",
					"Now we received nerfs ranging from 20% to 50% in the damage of the abilities I have listed above.",
					"Tell me of any other class that has ever gotten nerfed this fast and this big.",
					"Last season FDKs dominated everything and how many nerfs they get?",
					"Or assassin rogues for that matter?",
					"People only QQ of DHs.",
					"The same thing was when the expansion started.",
					"People didnt know how to handle us - GG MASSIVE NERF FOR HALF OF THE SEASON.",
					"Afterwards we got some buffs back to make us barely viable.",
					"Im sick and tired of this."
				],
				"Arena",
				0.0,
				"2s",
				1,
				1
			],
			[
				[
					"Hey guys,What do you think will be the best spec for 2k+ 3v3 and RBGs?"
				],
				"Arena",
				0.6369,
				"3v3",
				1,
				1
			],
			[
				[
					"wouldnt you call normal for a class that was launched  in a expansion that launched during world arena qualification to be underepresented on high arena ratings for the simple fact that rly high rated players stick to the classes they know already to have a better chance of qualifying?cuz i mean unless DH was as OP as DK at launch ( and i dont think anyone would want that) i would cal it safe play by those players... its not rly that class that is bad?"
				],
				"Arena",
				0.8105,
				"arena",
				1,
				1
			],
			[
				[
					"12/01/2017 19:08Posted by CariethOh man... people thinking pvp is balanced for 2v2.. Oh man... some half-geared half-honored monk demanding things...",
					"These days litterely everyone cries.The game isn't balanced around 2vs2, that's right, that doesn't excuse from the fact that Demon hunters are capable of blowing up a healer in a 5 second stun window.The whole point of the template system was to be able to keep the balance between PvE and PvP, havoc was doing poorly in PvE so it needed the buffs, but now they're out of control in PvP and blizzard are too retarded to utilize the template system as much as they should be."
				],
				"Arena",
				-0.50265,
				"2v2..",
				1,
				1
			],
			[
				[
					"Hi all im just wondering what build are you going to run in arena's and  please explain why :)ive just tested out fellblade/ first blood and / fel eruption spec and i like it so far big dmg out in a short amount of time good to finish and running low health target off ;)"
				],
				"Arena",
				0.7579,
				"arena's",
				1,
				1
			],
			[
				[
					"No srsly, I can 1v2 a wide variety of melee/physical dpsers in arena.....If the damage was much higher it would be reaching silly territory."
				],
				"Arena",
				-0.5423,
				"arena.....If",
				1,
				1
			],
			[
				[
					"you guys don't play 2s / 3s obviously as when u see a demon hunter its insta loss if anything they need a nerf in 2s 2.2 is like 1750 as dh try fighting dh restro as ret mw then complain the game is not about battleground"
				],
				"Arena",
				-0.5541,
				"2s",
				1,
				1
			],
			[
				[
					"It kinda ruins those who want to make a red transmog"
				],
				"Arena",
				0.0,
				"ruins",
				1,
				0
			],
			[
				[
					"I dont mind that a warlock can banish me, adds more skill to my arena games."
				],
				"Arena",
				0.0,
				"arena",
				1,
				1
			],
			[
				[
					"04/10/2016 20:06Posted by BloodwrathWell said.",
					"Bloodlet needs to die, its simply outperforming the other talents, that is far more fun to use.",
					"It saddened me that blizzard listened to the whiners and rebuffed it after the first nerf.Yeah, demonic needs a revision in what it does.",
					"You are already seriously down on fury due to eyebeam costing 50 fury, and you only have 5s of the buff.",
					"ironically in beta, demonic was the go to talent due to annihilation and death sweep being so powerful.",
					"But they got steadilly nerfed and now its a joke and a trap talent.People only whined because nothing else was being buffed..",
					"If they nerf bloodlet and throw glaive - Master of the glaive + bloodlet would have been useless.Tho I agree that they should buff felblade / first blood (Since they don't deal as much damage as bloodlet)."
				],
				"Arena",
				0.0,
				"s",
				1,
				1
			],
			[
				[
					"I think it's that blizzard over nerfs the class while looking too much at pve.I may be the biggest noob in the universe at pvp but when looking at people trying to gank other people (and then clawing their faces off) I've noticed that DHs are the only ones that actually TRY to pull mobs when they get low.Blizzard probably figured that people would complain if they had more survivability on top of that, even if that means that they lose most of it in BGs and arena."
				],
				"Arena",
				-0.6491,
				"arena.",
				1,
				1
			],
			[
				[
					"25/11/2016 15:54Posted by KhaasToday I have 120% base leech and it is awesome.",
					"Went into a skirmish arena and was me vs 3 others.",
					"Took the rogue, hunter and healer monk 4-5 mins to kill me.OT but awesome tsmog you got there :D"
				],
				"Arena",
				0.5032,
				"skirmish",
				1,
				1
			],
			[
				[
					"[quote=\"176131870993\"]<span class=\"truncated\">...</span>If it was world pvp I would not complain, we all know that is unbalanced.Am talking about arena.I did 10 or so yesterday, half of them where DH, and they all killed me in matter of seconds.",
					"After a few matches i used karma instantly, but then the second one killed me.",
					"Or they kited me, and killed me when it was over.Listen.",
					"I don't mind not being the OP or strongest class ingame, I love my monk and will stick tot it.But there is a difference between having a challenge and be able to counterplay and not be able to do anything.",
					"Thats is my point.Man your posts show that you are really an ignorant retard just like most of the ppl whom are complaining about DH-s.",
					"It is clear that you see this game only from your own perspective.",
					"Tell me Mr. complainer what did a shadow priest do against a monk before SP got buffed.",
					"I tell you lad ... nothing you could do nothing!",
					"NO counterplay no chance for getting clever you just died against a monk as a SP.",
					"Why didn't you complain back then about your class hopelessly overpowering another?",
					"Cause you felt good recking certain classes you imbecile ....]Addition: Now I am playing with a monk in 3s.",
					"The guy just dinged and started doing arenas yesterday.",
					"What he does sometimes to ppl while im sitting in CC is something that devs should look for too if we want to be honest.",
					"Like they should look into boomkin, feral, DK damage as well."
				],
				"Arena",
				0.0,
				"arena.I",
				1,
				1
			],
			[
				[
					"16/09/2016 18:26Posted by GrifenSeeing your Arena achievementsPeople like you shouldnt be able to post in Forums, at all.You're probably very happy cause you reached once or a few times a high rating in Arena, however that sadly means absolutely nothing considering it doesnt take any arena experience at all to judge and realize that Demon Hunters and most Melees in General are completly over the top.Nvm, just checked your achievements, didnt even reach 2,2k but acting like you're the big boss on the forum, arent you so much more awesome than all of us and your opinion is completly more reliable and impactful?",
					"Lmao, sit it down, DH Fanboy, and accept it.Even as a DH player myself from both Alpha/Beta, PrePatch and currently, they are broken as hell and deserve nerfs, just like all other melees.Give them some better defensive cds or a ondemand heal, but nerf their Leech"
				],
				"Arena",
				0.60345,
				"Arena",
				1,
				1
			],
			[
				[
					"Is it just me or did Blizzard remove spec filter in arena because we could see how much they failed in pvp class balance and the demon hunter class itself?"
				],
				"Arena",
				-0.5106,
				"arena",
				1,
				1
			],
			[
				[
					"omfg just cause Ive killed 3 ppl in skirmish alone, doesnt mean they need a nerf, you guys are freaking terrible in skirmishes and random bgs honestly.People still backpedaling in 2016 , people still dont know how to use addons,how to kick and interupt or when to stun someone, or when to kite someone?yea go play skirmishes and cry about how MY DH is OP wit 32 traits and high ilvlbut yea maybe try rated where people are not that unskilledand they know something about classes"
				],
				"Arena",
				-0.9201,
				"skirmish",
				1,
				1
			]
		],
		"Raid": [
			[
				[
					"27/10/2016 23:07Posted by MegumínBuhuhu.DHs do decent dps, it's enough to play the game and clear end-game content and even get high pvp rating if you're good enough.Play whatever you think is fun and don't give a !",
					"@#$ about other classes dps.https://worldofwarcraft.com/en-gb/game/pvp/leaderboards/3v3 would like to have a word with you"
				],
				"Raid",
				0.62475,
				"/en-gb/game/pvp/leaderboards/3v3",
				1,
				1
			],
			[
				[
					"Only reason I can see for the crit nerf and the resource gain nerf is the Nighthold set bonuses, pretty sure that if we stay as is and get this set we will play like a dream come true with the giants ring and the new upcoming legendary shoulders... (set bonus from Nighthold is +10% fury gain from all sources/abilities and +10% crit chance on chaos strike) that is though without taking into account the sets of other classes.",
					"Whatever the reason, I agree with OP that this is a very unfun and poor way of granting us \"more\" options and the way they deal with our AOE balancing is just straight up comedy."
				],
				"Raid",
				0.7788999999999999,
				"Nighthold",
				1,
				1
			],
			[
				[
					"24/09/2016 11:05Posted by Sartharionhttp://www.simulationcraft.org/reports/Raid_T19P.html(Patchwerk fight)We are now the LOWEST Melee dps, explain to me this why would any Mythic progression guild take a Demon Hunter into their raids?",
					"We have 0 good raid cooldowns we will have the lowest ST on boss fights and not to mention our aoe will be something of the past.",
					"While WW Monks will trample over our ST and aoe dps with quite a big margin and they give a 10% movement speed increase to the raid why not stack an extra WW monk or get in more fire mages or demo warlock?",
					"They bring dps and a lot more uses for a progression raid.Demon hunters are useless and will be benched until this nerf has been reverted or changed.",
					"Our aoe should be nerfed but our ST was already minimal now it's nothing.I don't trust the numbers that simcraft shown... so I did some personal numbers checks... from my logs.Xavious fight - normal....I stand to lose between 70 to 80 thousand DPS in the total fight.ST, I stand to lose 30-40 Thousand DPS.These are my numbers and if they are wrong, then I am sorry, I ain't a simcrafter or a mathematician.",
					"I think they are roughly accurate... \"For Me\".Our guild is melee heavy right now.",
					"It's time to let more ranged in."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"That wipe try of yours?You are right, you press the buttons so differently than the rest does.",
					"No one can even come close to that skill.",
					"It also can't be just a crit streak or stuff.",
					"Not even a Mistwalker title holder, 9/9 mop cm gold on all classes, progress raider in vanilla - no one stands a chance against Rapher from Victus.",
					"Not even his own glorious raid allies.No!",
					"No!",
					"No!",
					"You are special!Lmao!",
					":D"
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"09/08/2016 13:32Posted by IrisvielI'd prefer to do Havoc, but I'm the type of player who likes to be prepared for any eventuality, and versatile players are more valuable to raiding guilds than players who have massive contributions to DPS, so I'll be ready to tank if needed; think of it this way...You prefer to DPS and your DPS is a huge help to your raid, but one of the normal tanks are on holiday; you're a good tank but you feel your DPS contribution is too good to lose so you don't want to tank.Here comes lil Timmy who volunteers to tank; he's decent, not as good as you, but he consistently volunteers to tank; suddenly, he becomes more important than you, because without him, you'd have to pug or forfeit the raid.Somebody watches Asmongold videos :P"
				],
				"Raid",
				0.9891,
				"raid,",
				1,
				1
			],
			[
				[
					"Well not bad, even if there aren't glavies :)Would be 8/10, but you're from Devias BH too then 9/10 :)"
				],
				"Raid",
				0.7561,
				"BH",
				1,
				1
			],
			[
				[
					"15/11/2016 21:04Posted by KazoonYes i know changes aren't final, please don't comment on that, because we're discussing the current notes.From my experience, the changes have a quite decent chance of BEEING final UNLESS there is a pretty big outcry from the community demanding change...so lets try to do that?From my own perspective, a semi-casual player who has cleared normal and heroic EN 2-3 times and starts to progress through ToV NM now, and who enjoys to pvp from time to time on a very casual basis, the demon speed nerf alone will affect my ability to have fun with my DH in a few ways: 1st i used it to travel extra big distances quicker with fel rush while beeing in mid-air.2nd i absolutely loved the added burst on demand on pvp and pve extra fel rushes offered.3rd i loved how i had to think quickly how to make the maximum out of my momentum and if i even wanted to pop blur offensively or keep it for a big dmg inc from a boss or in pvp.What i can think of as a suggestion/compromise to blizzard is instead of changing it completely, add a longer cooldown to it,so blur has 1 min cd but the 2 fel rush reset charges proc only ever 2 mins or so, anything so i dont completely lose the playstyle i love."
				],
				"Raid",
				0.9542,
				"EN",
				1,
				1
			],
			[
				[
					"props for color scheme, but other than that it's simply just too plain + belt doesn't fit imo.",
					"6/10If you wonder why I use swords, I honestly think the secret appearance looks like !",
					"@#$, and there's no other way of getting red/orange glaives atm (waiting for Nighthold to get my Balance of Power glaives)."
				],
				"Raid",
				0.0,
				"",
				1,
				1
			],
			[
				[
					"In game: I went into Karazhan Crypt and took a few selfies.IRL: Rode a bike, swam in the sea, played some basketball, went to gym, sang while playing a piano and now I'm going out to enjoy a quite interesting international opera festival."
				],
				"Raid",
				0.9117,
				"Karazhan",
				1,
				1
			],
			[
				[
					"Heard Vengeance DHs lost Darkness, it being a solely Havoc raid cd now."
				],
				"Raid",
				-0.802,
				"raid",
				1,
				1
			],
			[
				[
					"blizzar can you tell me when you gonna fix these bugs 1- Fel rush bugs 50 percent of the time, doesnt vault you forward2- reverse magic doesnt send anything back to caster sometimes even not dispels anything(when hexed uses the ability doesnt dispel hex, dispels sheep on a team mate doesnt send back, sometimes dispels dks magical effects sometimes doesnt even it dispels doesnt send back basicly doesnt send back anything.3- choas nova i didnt understand this at all, range is unclear also its magical effect still doesnt stun wars through parryps: only thing reverse magic really dispels are roots basicly ı dont how ppl tested dh on beta but are you serious this many bugs in a class first ı have ever seen like that in a class so broken."
				],
				"Raid",
				0.0,
				"vault",
				0,
				1
			],
			[
				[
					"Hey man, thanks for this thread.",
					"Rly helpful.Just a question, i'm currently hesitation between two setup of gear, can someone help me ?1rst one is :Journey Through Time 2/2 SetStrand of the Stars 840Chrono Shard 8402PC: 5980 Haste and 30% movement speed for 10s.Total : +960 Vers +808 Mast +1123 Agi +Set ProccFull stats with these items :21.778Agi35%CC14%HAste13%Mast11%Vers2nd one is :Faulty Countermeasure 840845 Neck +823 Haste +978 VersatilityNo bonus setTotal : +823 Haste +978 Vers +898 CC +Trincket UseFull stats with these items:Full stats with these items :20.598Agi38%CC16%haste11%Mast11%VersI made some test on dummy but still can't clearly see what's the best option for me...",
					"It requires raid situations, haste scaling to compare on BL, Metamorph etc...I'm lost in my maths ^^ Help plx!"
				],
				"Raid",
				0.6117333333333334,
				"raid",
				1,
				1
			],
			[
				[
					"http://us.battle.net/forums/en/wow/topic/20749406299?page=1Blue posted:,,We are taking a second look at some changes Demon Hunters and Priests - more information coming on that soon.I think most people will be happy with Tuesdays Buffs!",
					";),,It can't  get worst than currently is right xD?"
				],
				"Raid",
				0.7037,
				"en/wow/topic/20749406299?page=1Blue",
				1,
				1
			],
			[
				[
					"I wasnt sure where to post this, but im currently trying to gear myself up for the Emerald Nightmare, i got two trinkets to choose from.Corens Cold Chromium Coaster(iLvl , +850 crit, chance on crit to boost atk power by 5049 for 10 seconds)Or Nightmare Egg Shell(840 iLvl).Id like some help in choosing between the two, i am not sure about which one to go for, the Egg Shell boosts my iLvl from 837 to 839 which is a big jump."
				],
				"Raid",
				0.9165,
				"the",
				1,
				1
			],
			[
				[
					"23/11/2016 21:48Posted by YavwrenSo I'm about to level up a tank for my raid team.",
					"We are going to be heading into Mythic EN soon, and I ideally want to know if DH is viable.How are you finding DH tanking and do you think it would be okay alongside a DK?There is a lot talking about how much DH is weak and squishy.I'm at the moment 4/7 EN M and 2/3 ToV H .You will be fine and probobly survive more than other tanks in some situations.Tanking as DH is more challenging you need to know the fight perfectly and predicte the huge damage blows from the bosses (you wont die ,just maybe cause your healers an heart attack) im suggesting you to pick last resort for start.",
					"Until you feel comfratible enough with DH tanking than swap it to soul barrier (i even suggest you to wait until the serious buff this talent gonna get in 7.1.5).Yes it's not the easiest tank spec in the game ..maybe the hardest along side the brewmaster,but when you master it +7.1.5 buffs i can assure you DH os one of the best tank spec out there ;)"
				],
				"Raid",
				0.5415,
				"raid",
				1,
				1
			],
			[
				[
					"EN is an awful raid for vengeance itemisation.",
					"Try your luck at mythic+.",
					"Trial of Valor is a LOT better though, and look to that if you can!"
				],
				"Raid",
				0.0,
				"EN",
				1,
				1
			],
			[
				[
					"https://eu.battle.net/forums/en/wow/topic/17614673538and there is more builds so far the eye beam looks like the best option"
				],
				"Raid",
				0.7717,
				"en/wow/topic/17614673538and",
				1,
				1
			],
			[
				[
					"its just so sad .. suddenly mastery seems to be stronger then versa.. which means i threw away so much strong gear.. i guess iam supposed to keep all the items in case someone decides to delete some talents from game again what is worse.. i took some items from raid which i wouldnt have taken now.. so it cost the whole raid and thats just before mythic progresion would be cool to see some reasoning behind these changes .. and less ppl just whining on forums and spaming.."
				],
				"Raid",
				0.7051,
				"raid",
				0,
				1
			],
			[
				[
					"Guys, that mate already complete heroic en as tank.",
					"Seems like he knows how to play vengeance dh."
				],
				"Raid",
				0.5784,
				"en",
				1,
				1
			],
			[
				[
					"https://www.warcraftlogs.com/rankings/character/17346027/latest/ best atm 319,8k on hc"
				],
				"Raid",
				0.6369,
				"hc",
				1,
				1
			],
			[
				[
					"News?",
					"What news?",
					"They don't even discuss reverting some of the nerfs (the non aoe ones) which will bring the spec again in a better position without great danger to become, let's say overpowered.",
					"I said to myself, well future raids may have more adds in the fight who knows we may be more useful.",
					"Prepare to see decline a lot when the new raid comes especially on heroic difficulty.",
					"Most of the fights are ST."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"Tanked heroic Xavius today - by far the hardest hitting boss in the entire EN.",
					"Aaand....Both me and our DK tank felt pretty much the same, struggled about the same, and still survived just fine.What I'm saying is - stop whining.",
					"DH tanks are good.",
					"They can tank.",
					"And that upcoming nerf is not that scary, IMO.",
					"So just play your class and don't fret."
				],
				"Raid",
				0.0,
				"EN.",
				1,
				1
			],
			[
				[
					"180k on ursoc with your ilvl is a joke, you could be at 250k+ easily, especially considering you have a bis trinketfrom what i can see:-you absolutly need to replace your haste-mastery ring for one with crit, try to buy a crafted one if you can.",
					"Your ring is worse than some hc dungeon ones atm-get an agility enchant on your cloack-get a neck enchant-get the 200 agility gem-always play with demon blade-chaos blade except on ilginothDont go for ilvl on an item but rather better stat, aim for crit you are lacking a lot of it, use askmrrobot.com to compare itemsMight be your gameplay aswell but can't really tell"
				],
				"Raid",
				0.54985,
				"hc",
				1,
				1
			],
			[
				[
					"30/09/2016 07:51Posted by Trajyah#Rip Demon Hunter 2016.There is prodably no chance to join any seriously hc group.With current single target dps.haha cant be  that bad, try play a Deathknight and u get something to QQ about for real :)"
				],
				"Raid",
				0.5599,
				"hc",
				0,
				1
			],
			[
				[
					"26/11/2016 15:52Posted by SolidariIf you buff demon blades proc chance to over %75 with legendary ring buff its becomes op you can stay with full fury in raid but after they nerf ring, they dont have to nerf procs of db to %65.",
					"Keep it at %75 and buff prepared its best way for balance.Prepared is not comeptitive its sux only give you 40 fury in 15 sec and you have to spam demon bite for gain 20 fury while wasting gcd.The ring is being nerfed to near uselessness in 7.1.5 (If they don't change it..) So you will barely feel it..",
					"Prepared reduces vengeful retreat to 15 seconds..",
					"Thus you can get momentum more often...   Why would you be against buffing demon blades..?",
					"It would benefit both people with and without the ring... considering it'll only be 1-6 extra fury... if they don't change that."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"So a quick check around the forums would show a few differing view points on how to vengance tank.",
					"Honestly I suspect all of them work and what we are arguing over is which is \"best\".The setups that I have ended up using are.Raid tanking - Haste/mastery - Fallout, Felblade, Feed the Demon, Soul Barrier.General aim being here to maximise demon spikes uptime.M+ - Crit/mastery - Burning Alive, Flame Crash, Soul Rending, Last Resort This build is about aoe damage output.",
					"We can critically heal on most of our heals and we also leech a lot of health based on our damage output.",
					"When clearing M+ the ratio of tanks to dps is far higher than raids so if you can bump your damage it helps a tonIcy VeinsPersonally I don't like this setup but I know Smørholm considers it to be the best.Overall depending on what stats you get, what content you want to do and personal preferences there are several different ways to play Vengeance.",
					"It's a very versatile spec that can honestly do most things given the right stats."
				],
				"Raid",
				0.0,
				"Raid",
				1,
				1
			],
			[
				[
					"Had this problem last night during HC HFC , on nearly every boss fight fel rush would bug out and stop and barely move forward at all, and sometimes would happen multiple times in a row."
				],
				"Raid",
				-0.7579,
				"HC",
				1,
				1
			],
			[
				[
					"03/10/2016 09:09Posted by DreadlessLast resort is just bad.",
					"Soul barrier ftw.",
					"You don't need to worry about dps :)  that's not your job.",
					"I use spikes when soul barrier is on cd.",
					"I don't have issue tanking normal raid but things will defo change when I move to heroic unless I get lucky loot drops soon :(We did Ursoc last night on heroic.Ouch, ouch, ouch , OUCH!My rear end deffo still hurts.",
					"Everything went out the window on that fight for me.",
					"Rotation.....gone.",
					"Reasonable dps..... gone.",
					"Perfect positioning......gone.",
					"My focus was entirely on perfect taunts with our other tank, and using spikes and soul cleave at the perfect times as his hits hurt that much.Yeah im still getting used to tanking let alone DH, but as a DH I deffo felt it."
				],
				"Raid",
				0.0,
				"id",
				1,
				1
			],
			[
				[
					"Finished whole Emerald Raid today and last boss was hitting too much.Venge need tuning in first place, because i dont know how we gonna tank in heroic and nm mode \"hithard\" bosses.Sorry for my english."
				],
				"Raid",
				0.5574,
				"Raid",
				0,
				1
			],
			[
				[
					"27/09/2016 14:39Posted by MuchilalaComming from some1 with 0 achivment pointsComing from someone without EN achivement."
				],
				"Raid",
				0.0,
				"EN",
				1,
				1
			],
			[
				[
					"10/10/2016 14:03Posted by SunaurusIt's funny you say that while advocating a trinket which gives you ~1k stamina, which will be a wasted stat 100% of the time if you're not dying to ~100k overkills without the 1k stamina.",
					"Tank deaths are very rare (unless the raid is already wiping), and I guarantee you that among those tank deaths, 100k overkills are even more rare.",
					"(I can't remember a single time where I died to less than 1mil in overkill, which usually means that someone !",
					"@#$ed up a mechanic)In raids, the barrier from Rokmora is very underpowered compared to the effects from the better trinkets (such as chrono shard, bloodthirsty instinct and goblet of nightmarish ichor).",
					"Yes, a barrier can help you absorb a melee hit from a boss when !",
					"@#$ goes south, but %^-* doesn't go south so often that you can't handle it with Metamorphosis and Last Resort anyway (unless your whole raid is failing).",
					"I'm not saying those trinkets are COMPLETELY useless, but they're definitely worse than other options, because they mean that you're putting that overall extra pressure and responsibility on healers for the benefit of having a 600k (less than a boss melee) absorb from rokmora or a very weak proc 3 or 4 times during a fight from parjesh, both of which will VERY RARELY help you, if ever.I dunno; I just cleared heroic Xavius with two tanks for the first time tonight, and the extra stamina and the clutch heal at low health from Parjesh was very useful for keeping me from death and at high enough hp to survive the dispel with a high amount of stacks (when 6 stacks tick for 1 million a second pre mitigation, the extra stamina can definitely make a difference).",
					"Both the passive stamina and proc also further boost Metamorphosis (and as such the heal from Fueled By Pain).",
					"I never called it BiS for farming; I said that it can be very nice to have during progression raids.",
					"If you have it proccing at the wrong time, I'd say THAT is a sign of either you or healers failing, not the opposite.",
					"If you drop down below 35% in the first place, the heal can rarely be wasted, unless your healers were actually not healing you at all or you failed at some mechanic while not having aggro.",
					"Unlike a PPM trinket that can just go off at entirely the wrong time and actually end up being useless (e.g.",
					"Chrono Shard proccing when you're not actively tanking).",
					"I'm not sure why you even bring the Rokmora thing up; I said in the very first sentence of my paragraph about it that I was talking specifically about Mythic+, and in conjunction with Soul Barrier.",
					"Of course a trinket reducing damage by 70k/hit won't be good against raid bosses (bar something very specific).",
					"Lastly, the point of having an absorb shield on demand (Nightwell Essence) is not primarily to survive a random hit from a boss' melee - There are plenty of mechanics on the current raid bosses where you take a big enough hit to kill you (or do other nasty stuff) before mitigation, and every bit of further mitigation helps."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"How could I forget to mention the fel rush disconnect problem I and many others have been having and let alone class balancing they haven't fixed that and I wonder if they have even recognize that it's ruining the game for playersI've been disconnected like 30times overall in raid bosses, arena, m/m+ and whilst wqing"
				],
				"Raid",
				-0.6249,
				"raid",
				1,
				1
			],
			[
				[
					"8/10 - It all goes really well, mainly because it revolves around the ICC set, but the glaives and cloak go great with it.",
					"The tabard is very slightly clashy in my opinion, I think it'd probably look a lot better without a tabard at all.Great mog overall, though :)"
				],
				"Raid",
				0.7597,
				"ICC",
				1,
				1
			],
			[
				[
					"Id try bloodlet with wrists on some bosses in Nh, top of my mind Botanist to see if its worth it"
				],
				"Raid",
				0.7096,
				"Nh,",
				1,
				1
			],
			[
				[
					"17/08/2016 12:22Posted by ZehdYou can clear all of ToT up to Durumu with little to no issue as VengeanceLike he said, ToT easy (Council 4-5 trys) done as Vengeance.I can farm my last Raid-Dropmounts with DH so it's all fine :)Did not try SoO cause i already have Garrosh Kor'kron Juggernaut, but prob i will try it next time for the pets :D"
				],
				"Raid",
				0.8545,
				"ToT",
				1,
				1
			],
			[
				[
					"28/09/2016 12:28Posted by Flameztar28/09/2016 12:25Posted by Snapoffwhy chaos blades over fel barrage?",
					"everytime ive tested it fel barrage comes out ontop?",
					"Same question, my understanding is that Fel Barrage is the go to no?Well I just checked his logs and he was using choas blades, thats why i stated this.",
					"and for the difference between fel barage and chaos blades good question i checked some of the top logs on xavius hc and the the people with the best logs all use choas blades, I havn't tested fel barage myself I used choas blades myself aswell."
				],
				"Raid",
				0.0,
				"hc",
				1,
				1
			],
			[
				[
					"The icy veins guide is written by munkky - a lot of IV guides are wrong, however the one for veng.",
					"is spot on.> master and crit most importantIf you are gearing for dungeons, yes.",
					"I mainly gear for survivability (Versa > haste >=mastery > crit) but i tank myth EN as well.regarding your gems.If you are going for the dungeon prio, i would gem for it as well; that would make mastery your #1 prio and the one you should gem for as well imo.>does a crit gem count towards crit on your gear?The crit gem should affect your parry chance aswell, yes - but its not enough to make it a priority for survivability."
				],
				"Raid",
				0.0,
				"EN",
				1,
				1
			],
			[
				[
					"well blade dance is not chaos damage and those dummies have armor, the armor of a HC dungeon bossnow imagine all those SPREAD damages being reduced by armor"
				],
				"Raid",
				0.5894,
				"HC",
				0,
				1
			],
			[
				[
					"I gave up the time needed to get my  demons spikes back to 40% Dr and keep my 20% vers to make it all good again to go back and clear hc like a boss"
				],
				"Raid",
				0.7906,
				"hc",
				1,
				1
			],
			[
				[
					"02/10/2016 18:31Posted by TahamineTalent choice is same to mine (Most recommended atm) - Demon blades is probably better atm?",
					"But it's so boring to use...     - Probably best talent tree atm (Since felblade sucks).well i did some testing since last time and the talent build i mentioned above sucks at single target bosses its great only on the (evil tree)boss.for single target boss (almost evey boss in raid)now am going with fel rush /demon blade/fel blade/soul rending/nemesis/master of glaves and chaos strike.i recomend it."
				],
				"Raid",
				0.63175,
				"raid)now",
				1,
				1
			],
			[
				[
					"enough already , you didnt have ny proof and I didn't say they are nto viable I jsut  Point to OP that I agree with him we could be stronger so we are more equal to other tanks .betweeen here is some evidence : http://eu.battle.net/forums/en/wow/topic/17613132050"
				],
				"Raid",
				0.6249,
				"en/wow/topic/17613132050",
				1,
				1
			],
			[
				[
					"The mastery changes (and how squishy and hard to heal I was even before that with BIG damage skipes) has removed me from HC raid and moved me to NM raid (1 day per week 2 hours hurray...).I will keep playing the class because I enjoy it and the artifact power ***** but I have no idea what in the hell is Blizzard doing, Vengeance tanks were not top tier BY A LONG SHOT our only advantage was being very strong vs physical damage......\"AND IT'S GONE!!!!\"",
					"(as this is even stated in the DH description that we are strong vs phys dmg) and yet we are still the weakest tank vs magic damage.Honestly Blizzard is proving they don't have a clue about balance and that they released an expansion without even parsing dps in raids or damage mitigation I have never seen so many changes and very big buffs/nerfs in a 1st patch i this game."
				],
				"Raid",
				-0.5907,
				"HC",
				1,
				1
			],
			[
				[
					"In this post  a guy with the name Avidius posted this picture http://imgur.com/a/AG6qP .Then another guy said that this cant be real cuz of the weapons colours which could be considered true..BUT i found this in wowhead.http://eu.battle.net/wow/en/character/ragnaros/Waith/achievement#81:a10460This could be the proof that it actually needs to be farmed..No special tricks.Just endless farm.I hope it helpedEDIT 1:I'd like to add one more thing that is strange...The picture that was uploaded by the guy that I mentioned above was uploaded 2 days ago,whereas the achievement( Hidden Potential) that the player with the name Waith got was obtained 8 hours ago...It could be that he did it with another char..BUT if you take a look at his history he has done A LOT of thing to make it believable that he actually is playing with another char too...Idk:/ I'ts really confusingEDIT 2:It's not an alt...The icon of his weapon is the icon of the Hidden artifact..."
				],
				"Raid",
				0.5859,
				"en/character/ragnaros/Waith/achievement#81:a10460This",
				1,
				0
			],
			[
				[
					"i basicly have the same dps at 860 that i had at 850 and have no idea wtf is going on.dosent help that i have ended up with over 20% mastery simply because every single piece of gear is filled with it and looking at the item drops for next raid tier seems mastery on every item is gonna keep going.since mastery is complete trash for both DH specs it makes me wonder if blizzard is gonna do something about our mastery or let us scale into nothing"
				],
				"Raid",
				-0.5106,
				"raid",
				1,
				1
			],
			[
				[
					"I'd prefer to do Havoc, but I'm the type of player who likes to be prepared for any eventuality, and versatile players are more valuable to raiding guilds than players who have massive contributions to DPS, so I'll be ready to tank if needed; think of it this way...You prefer to DPS and your DPS is a huge help to your raid, but one of the normal tanks are on holiday; you're a good tank but you feel your DPS contribution is too good to lose so you don't want to tank.Here comes lil Timmy who volunteers to tank; he's decent, not as good as you, but he consistently volunteers to tank; suddenly, he becomes more important than you, because without him, you'd have to pug or forfeit the raid."
				],
				"Raid",
				0.9859,
				"raid,",
				1,
				1
			],
			[
				[
					"The simulation is quite fair.But if you can't get it i will explain it to you.On Ursoc, the most Patchwerck like encounter in EN, Demon hunters are NOT EVEN NEAR at the top of the dps.",
					"We do less ST dps than: Mages, Druids, Priests, Warriors, Rogues and Hunters.So stop posting htat log.",
					"That log takes into account every boss in the instance.",
					"In the eye boss thare are a lot of adds, same with the Spider, Cenarius and Xavious."
				],
				"Raid",
				0.0,
				"EN,",
				1,
				1
			],
			[
				[
					"i have a really dumb questionWhen was that nerf implemented?Did normal raid like 2 hrs ago and had 200k dps and was  5th and 1st was hunter with 220k dps"
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"To Celibyx:If you like slimm swords here are some you can look into:The Facelifter (Professor Putricide in ICC 10man)Talon of Azshara (Morogrim Tidewalk in SSC, my favorite, still trying to get that)Greatsword of Horrid Dreams (Murmur in Shadow Labyrinth)The Willbreaker (Keli'dan the Breaker in The Blood Furnace)Sorry for the off topic haha"
				],
				"Raid",
				0.7717,
				"ICC",
				1,
				1
			],
			[
				[
					"Ziminar please go back to get carried to mythic hfc with already useless gear and stop pissing off people here."
				],
				"Raid",
				-0.6597,
				"hfc",
				1,
				1
			],
			[
				[
					"10/01/2017 13:17Posted by Ритуалз10/01/2017 12:49Posted by MyriwenSame answer you do realize how much we are buffed aside ?Question to you, mister \"i'm not raiding even in mythic EN, but I'm making statements like a pro raider\": do you realize, how clunky your gameplay will be?",
					"And how much dps you will lose at ST?Ofc you don't.Indeed, too many players who have little to know experience with the more difficult content voice their opinion as if it is fact.",
					"Most people crying about demon hunters being broken probably just saw a DH burst a M+2 dungeon boss that dies in less than a minute and decided the class was broken."
				],
				"Raid",
				0.0,
				"EN,",
				1,
				1
			],
			[
				[
					"17/08/2016 20:22Posted by RaziddBut... Then you'll only use 1 ability, outside of all the semi-long cds... That's making it worse?",
					"Then instead of DB+DB+CS, you just go: CS, CS, CS, with a Throw Glaive every once in a while.",
					"That's even less complicated, if you ask me.Well, there is whole thread about Demon Blades, if you're interested, read about it there :DAlso, a guide explaining 110 Havochttp://eu.battle.net/forums/en/wow/topic/17613051842^_^"
				],
				"Raid",
				0.0,
				"en/wow/topic/17613051842^_^",
				1,
				1
			],
			[
				[
					"I find the bonus from the chest pretty good in raid.If i make a single mistake (that doesnt kill me ofc) i can easily get full health in few seconds with blur at full fury which ll not cause pain to my healers.Even on rough fight for healers, i don't hesitate to use blur to get myself full health in case of raid damage.This every minute.Idk, utility can be as good as dps for me"
				],
				"Raid",
				0.9254,
				"raid.If",
				1,
				1
			],
			[
				[
					"I am not, Theres a new nerf coming to our set bonus in NH and also to our Fury of the Illidari which is now being scaled down to 112 % from 140 % so we ARE getting another nerf.",
					"it's on mmo champion."
				],
				"Raid",
				0.5880000000000001,
				"NH",
				1,
				1
			],
			[
				[
					"the people who play more get more loot, has always been like that.",
					"you have barely done any legendary rewarding content: 0 mythic raid bosses killed, only 92 mythics done and your highest mythic done is lower than 15."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"If you buff demon blades proc chance to over %75 with legendary ring buff its becomes op you can stay with full fury in raid but after they nerf ring, they dont have to nerf procs of db to %65.",
					"Also with new build demon blades can reset too much felblade charge.",
					"Keep it at %75 and buff prepared its best way for balance.Prepared is not comeptitive its sux only give you 40 fury in 15 sec and you have to spam demon bite for gain 20 fury while wasting gcd."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"30/09/2016 04:52Posted by SecretlyacowI gave up the time needed to get my  demons spikes back to 40% Dr and keep my 20% vers to make it all good again to go back and clear hc like a bossyou forget about haste ;)"
				],
				"Raid",
				0.7906,
				"hc",
				1,
				1
			],
			[
				[
					"There have been literally like 6 bosses in all of WoW where raid composition highly mattered.For every other boss, you just bring the best dps.Now, the above only matters if you're racing for world first.For everyone else, it does not matter, at all.Yes, it sucks when you're progressing Lei Shen 25 HC and you wish your bear tank was a monk tank for the taunt speed boost.",
					"But is it going to be the breaking point of your raid?",
					"Probably not.Whenever I see blame thrown onto something as trivial as spec when raiding in world 600+ guilds, I laugh.",
					"You aren't even CLOSE to being min maxed, and you're assigning blame to a specific thing.",
					"So again - I ask, are you going for world first?",
					"No.",
					"Are you going for realm best titles in mythic dungeons (if they exist?)",
					"?",
					"No.",
					"Are you looking to min max to the highest order, for personal satisfaction?",
					"Almost certainly not.So, with that in mind, rogue vs DH does not matter.Pick which you enjoy more."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"30/09/2016 08:57Posted by Khazir30/09/2016 07:51Posted by Trajyah#Rip Demon Hunter 2016.There is prodably no chance to join any seriously hc group.With current single target dps.haha cant be  that bad, try play a Deathknight and u get something to QQ about for real :) You know nothing Jon Snow."
				],
				"Raid",
				0.5599,
				"hc",
				1,
				1
			],
			[
				[
					"Equip a hidden skin for raid progession, got my 1000 kills in 2 weeks.",
					"For some reason people dying counts toward this unlock."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"Hi Guys, My focus is mainly pvp with some casual raiding en M+.I can’t decide if I would go for my DK(Frost) or DH(Havoc)I don’t have much pvp exp since since I don’t play as hardcore as I used to do, and I wanna main 1 char only since I have less time to play then most ppl.Atm am maining a ww monk, but I feel that there are better choice then the monk and on top of that am bit bored off the monk."
				],
				"Raid",
				0.7351,
				"en",
				1,
				0
			],
			[
				[
					"Aha, that explains it then.",
					"Too bad, i'd saved a few extra tokens for them thinking they'd be available.",
					"Need to do the invasion event then or HFC or something :)Thanks"
				],
				"Raid",
				0.0,
				"HFC",
				1,
				1
			],
			[
				[
					"UPDATE: New Logs https://www.warcraftlogs.com/rankings/character/17549576/latest/Original Post--------------------------------------------------------------------------------------------------------------So currently trying to be a valuable raid member and aiming for 75th percentile.",
					"I feel like I'm missing out on perhaps a few ticks of bloodlet but other than that I cant seem to figure out from these logs what I need to improve and why.",
					"Logs say I should be doing 300k + but Im far below on all occasions.If anyone could shed some light on the situation id appreciate it."
				],
				"Raid",
				0.5463333333333334,
				"raid",
				1,
				1
			],
			[
				[
					"Well, Personally im having no issues (844 ilevel tank) getting into groups ;)i PUGed all the way from 790 ilevel (normals , 810 HC's , 820 Mythics)I do see alot of \"NO DH TANK\" lately , but  when i do just groups people say to me that most DH tanks are crap and they die instantly .i tried joining a heroic as dps with my current gear (Which is anything i get from mythic ..optimization comes after ilevel so ill get better loot from WQ :D)dear gods i did 500K+ on small aoe groups (2-5)1mil+ on big AOE groups (6+ mobs )and roughly 200k on single target (Like everyone else)(Please dont look at my current talents as i fooled around BG before logout :D)"
				],
				"Raid",
				-0.7136,
				"HC's",
				0,
				1
			],
			[
				[
					"I'm soooo glad I kept my Warblades of the Hakari from ZG classicThey sit on your back like the warglaives, not your hips, and look alot smaller, definite improvement!http://i.imgur.com/ZSb3Ft9.jpg"
				],
				"Raid",
				0.784,
				"ZG",
				1,
				1
			],
			[
				[
					"Hi guys i currently own 3 good trinkets860 ivl eye880 ilvl CoF with leech880 ilvl draught with socket Which trinkets should I use for nighthold normal and heroic ?",
					"And also mythic + Thanks for help"
				],
				"Raid",
				0.7193499999999999,
				"nighthold",
				1,
				1
			],
			[
				[
					"I think the whole row needs a change, demonic appetite is the only one i slightly like but the idea of orbs dropping that need to be picked up in a raid situation seems stupid beyond belief."
				],
				"Raid",
				-0.6119,
				"raid",
				1,
				1
			],
			[
				[
					"I did raid yesterday, here is what i think:Aoe nerfed as it should be, now the others are competing.So good thing with aoe, the bad thing about that is most ability we use on ST we use on aoe, so yea i noticed the nerf.",
					"with a perfect rotation (Momentum build) I felt like i was doing nothing tbh.",
					"Hope they will change a few things soon :) Not changing still love my DH, and they can nerf and nerf, will still be playing on him :)"
				],
				"Raid",
				0.6382666666666666,
				"raid",
				1,
				1
			],
			[
				[
					"Hm actually it might be my bad ...",
					"I was running this with Gnome Sequencer Enhanced and probably the addon is broken now."
				],
				"Raid",
				-0.5095000000000001,
				"Hm",
				0,
				0
			],
			[
				[
					"its good in myth+ its not everyone who only raid :)"
				],
				"Raid",
				0.7096,
				"raid",
				1,
				1
			],
			[
				[
					"29/09/2016 02:06Posted by Caim28/09/2016 14:27Posted by Raiev90% uptime of demon spikesIn what fantasy world is this the normal uptime of DS?",
					"ignoring the fact that most bosses on EN have downtime (either from tank switching, boss casting or other factors), i just looked at my own logs from Elerethe mythic, and my uptime was 36.29%.Demon spikes is an active mitigation, not some kind of iron curtain that is constantly covering you, hell, the only fight in EN where spikes would have an up time of even ~70% would be for the cenarius tank, even then, this almighty nerf of single digit percentages is of no consequence.with enough haste and Feed the Demon it's not even difficult to have that uptime.",
					"Sweetspot is around 25% haste for most bosses.things you can do to maximize the effect of Demon Spikes:- use your soul carver on CD- don't let soul fragments expire (especially those from soul carver)- don't use demon spikes while the boss is doing something else (casting/charging)Haste not only reduces cooldown but also increases Soul Fragment generation.Feed the Demon reduces a flat amount while haste reduces it by a percentage making them a very potent combination.Basically haste is stacking with itself so the more you have the stronger it actually gets (until cap)."
				],
				"Raid",
				0.0,
				"DS?",
				1,
				1
			],
			[
				[
					"Yesterday I had my first Legion Raid as Havoc DH with my guild.The problem is my single target DPS at single bosses is at 150k with a gearscore of 847.Any usefull tips how I can improve my single target DPS?Bosses like il'gynoth I had no problem top DPSing because of all the adds."
				],
				"Raid",
				-0.6486,
				"Raid",
				1,
				1
			],
			[
				[
					"01/09/2016 22:13Posted by BitternessWhy would a DPS spec want a Taunt?If you're after a Ranged pull then TG is exactly the tool you need.You do know that any plate dps spec has a taunt?You realise that a well timed taunt for any dps can save a tank on progression bosses and thus saving the raid and this could mean a kill?You realise a taunt on any melee does have tons of utility?Hunters always had distracting shot aswell, to take pressure off a tank for a couple seconds, so the healers could have some room before the tank would taunt the boss back.It's a perfectly reasonable question, I for instance like the fact that I do have a taunt as dps."
				],
				"Raid",
				0.8708,
				"raid",
				1,
				1
			],
			[
				[
					"I like everything, if not for 1 thing...pretty much being forced to use Prepared come lvl 110 to do optimal dps.",
					"So much mobility, and all it does is create a harshly opinionated attack-yoyo when vault is a very nice escape mechanic...and in my opinion should stay as."
				],
				"Raid",
				0.5866,
				"vault",
				1,
				1
			],
			[
				[
					"I find it even more annoying that Eye Beam is apparently the only spell in the game that can't be canceled by moving, requiring you to use a stopcasting macro or to press Escape if you want to cancel it to dodge raid mechanics."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"I felt the changes in the raid on wednesday but i think some people are over reacting if you want to be good at your class you need to manage your cooldowns properly and underatand whats beat for each situation .",
					"Lasr week i was clear 1st on the dps all night but this wednesday it was more of a challenge and i still ended up 2nd.",
					"Certain bosses i was 4th or 5th but still i have not really experimented with my talents properly yet.",
					"For example fel eruption was good last week but did not do that good on wednesday"
				],
				"Raid",
				0.605025,
				"raid",
				1,
				1
			],
			[
				[
					"09/09/2016 13:43Posted by GhazzyHm, probably.Was thinking since the focus in the first raid content and mythical + dungeons that AoE dmg is more favourable than single target focus.",
					"And if so, I would want to be fully optimized for that specific end.In mythical dungeons FB will be recharged via AoE packs but for raid content vs single target fights I'm wondering if it's going to be worth it...Prepared+Momentum is always better.",
					"Chaos Blades is better on single target."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"This is gonna be interesting 3 weeks of farming AP and preparing for raid just to get nerfed in the last second xD.And if is based on dungeons trash cleans where everyone and i mean literally everyone can pull big numbers for such briefly fights, im definitelly going to chop my !",
					"@#$% off after the nerf Kappa."
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"17/08/2016 12:22Posted by ZehdYou can clear all of ToT up to Durumu with little to no issue as VengeanceThe only 'difficult' boss is Council.",
					"You just need to pop everything (drums included) to burn down the frost guy before he stuns.Oh they have changed Jin'rokh so he no longer resets when he picks you up if your alone?"
				],
				"Raid",
				0.0,
				"ToT",
				1,
				1
			],
			[
				[
					"Dual Schythe FTW  =Dhttp://i.imgur.com/YcozN1D.jpghttp://i.imgur.com/pRQP4il.jpg I imagine it midrange with shadowy fel skills.",
					"(and ofc with some raid utility stuff ¬¬)+1 Good idea m8!EDITed: i just remember there is a similar class in Black Desert, the Sorceress :o!!",
					"!"
				],
				"Raid",
				0.0,
				"raid",
				1,
				1
			],
			[
				[
					"17/11/2016 06:20Posted by KharealHmmm ...",
					"I have got too used to demon blades.",
					"I hope blizz changes their minds about some of these changes.",
					"I'm not going to rage about it, but some of these annoy me.I was never one to go with prepared+momentum.",
					"I also played a bit with demonic apetite at start of EN.",
					"Eventually I setled with a demon blades build with nemesis.I'm not afraid to go back to demonic apetite.",
					"If the fragments spawn the same way they used to, they are easy picking.",
					"I really didnt need to go around picking them up.",
					"Most of the time I picked them as soon as they spawned anyway.Prepared have some problems I dont like.",
					"It is dangerous to do !",
					"@#$ with it in mythic raids.",
					"I'd rather concentrate on doing the stuff I should be doing instead of trying to ensure that I don't land on some %^-*.I'm not really trusting the idea yet that eye beam becomes a fury generator.",
					"I'll see how it works, if these changes come out as they are now.",
					"For example just how much fury does fel blades give on average, if its reset chance is taken into account.No changes to bloodlet or glaives?",
					"I wonder if the other talents on the tier get to bloodlet levels.Single target is already weak so I would still also pick chaos blades.",
					"That 8seconds of meta after eye beam doesn't sound all that interesting.",
					"Though coupled with blind fury, you will have tons of fury to use.",
					"Not to mention other talents.",
					"Maybe it will work...At any rate.",
					"I think these changes look at very least annoying, but I shall judge when stuff actually comes out.",
					":IUnlike you I really enjoy the Momentum Build, I love timing and dodging between the Rot and poisons while still trying to maximize my dps.",
					"I hate nemisis for the pure fact of how dull it is.",
					"This however is fine, because both specs have up and downs and different people like different things.Some of the changes seem fine, but they are FAR from being anything that should be implemented, Blizzard should send their developers on Sales courses so they can sell their reason to change something to something else to whoever is in charge of them, because right now.. it feels like they doing what they want without a drop of thought."
				],
				"Raid",
				0.0,
				"EN.",
				1,
				1
			],
			[
				[
					"The problem here is that this nerf hits us REALLY hard, even in raid.",
					"You need to keep in mind that when our damage got nerfed, our healing got nerfed aswell.",
					"Vengeance was already in the very last position in terms of raid progress, they're just killing it more because of a few people whining about mythic 0 damage on trash packs, like, what the hell blizzard ?",
					"We heal from Soul Cleave, got nerfed hard as hell, our secondary healing source ?",
					"Fire damage ( 15% or fire damage are turned into healing ), and, what a surprise, EVERY SINGLE FIRE DAMAGE DEALING SPELL gets a 10% if not more nerf, which results in a tank that's even more fragile than it used to be.",
					"I mean blizzard I don't get the point, you can't be blind to that extent, Vengeance DH really is the worst raiding tank, what's the message here ?",
					"\"!",
					"@#$ and reroll pal/prot/drood\" ?And @Shammoz, as I said earlier, when your self healing is based on the damage you can deal, the ability to deal those same damages is not only relevant, but mandatory.",
					"I understand your point here, the thing is, the point of those nerfs were to reduce slightly the tank damage output we had, and even though it think it's complete nonsense to nerf a spec that hard the raid opening day, especially based on some Mythic0 week 1 whining ( i mean, seriously ?",
					"), I could at least understand the idea beyond that, but come on blizz, you designed the class, you knew nerfing the dps would kill our survivability, you mean that high paid genius team working all together couldn't even think about compensating our loss in that way ?I love the Vengeance Kit, I think it's really fun, but I won't ever understand the point in nerfing a tank that is already listed as the worst by every single god damned player with some pve exp."
				],
				"Raid",
				-0.5930199999999999,
				"raid.",
				1,
				1
			],
			[
				[
					"I've recently got the trinket that procs damage on auto attacks and I think the opening proc might cancel eye beam too.",
					"I am noticing it in NH, whereas I didn't before that in mythic+ etc... kinda lame bug"
				],
				"Raid",
				0.0,
				"NH,",
				1,
				1
			],
			[
				[
					"Tanked HFC Heroic yesterday, went fine :)"
				],
				"Raid",
				0.8126,
				"HFC",
				1,
				1
			]
		],
		"Battleground": [
			[
				[
					"I disagree that Havoc is worse.",
					"Currently, they have insane leach arounf 150% and a Vengeance vs Havoc, the Havoc will always come out on top.Demon Hunters are everywhere in BG's and 2 of them together are completely wrecking everything.I will guarantee you that Havoc Havoc Havoc will top the 3's ladder in first season."
				],
				"Battleground",
				-0.9141,
				"BG's",
				1,
				1
			],
			[
				[
					"i like this class but !",
					"@#$%^-it most of the buthurt people in bg's are demon hunters i had this one guy cursing at the entire bg and say he payed a sub so thats why he should win pls for the love of god dont let this turn into the dk comunity"
				],
				"Battleground",
				0.5729,
				"",
				1,
				1
			],
			[
				[
					"Exactly,like i said,we top the damage meters simply because 90% of our damage is AoE.This gives people false perception about the demon hunters and their damage and the first thing that  pops up in their heads is \"demon hunters are op\" while in reality beside bursting down people,we do nothing useful(most of the time) in bgs.There are far more useful and stronger classes for pvp.Also having the most damage done does not mean anything.People that play to top the damage charts are in no position to whine.The purpose of PvP combat and especially battlegrounds is not being the top damage.Usually those people tend to lose more games and they are the ones that QQ about their teams and how they lose every single battleground because all they do is fight in the middle of Eye of the Storm and don't even bother with capping bases and etc."
				],
				"Battleground",
				-0.9692,
				"battleground",
				1,
				1
			],
			[
				[
					"+ Please I want feedback only from those who actualy play some Decent PVP, not retards spamming random bgs.",
					"I topped random BG dmg with 2 spells only used during the whole game.",
					"So I think that doesnt count as being good DH :D"
				],
				"Battleground",
				0.5161,
				"BG",
				1,
				1
			],
			[
				[
					"Yeah been playing in Bg all morning and had a blast.I can solo most people now i get how the whole mobility works but a lack of a self heal is really holding this class back, its also making me think how the hell do DH do quest content with out stopping to eat food after each pull, never mind trying to solo old content."
				],
				"Battleground",
				-0.882,
				"Bg",
				1,
				1
			],
			[
				[
					"Sometimes there is no mages in your team out of 10-15 players, and mage food best way to restore HP for classes like Demon Hunter out of combat.In bgs ppl have about 600k hp and food from traders gives only 170k hp in 20sec, and mage food restores 100% hp over 20seconds.There is NPC that gives mage food in Ashran but visiting Ashran each time you want to play Random bg is annoying, and ashran queues are long sometimes, not evry BG group have mage.So maybe you will add Mage npc that gives you food  in Sw/Org/Ironforge/UC"
				],
				"Battleground",
				0.6059,
				"bg",
				0,
				1
			],
			[
				[
					"Yeah I've tried it a lot and love it so far, can't wait ti try it out in RBGs and ranked arenas at Legion with new talents and abilitiesGood survivability, great mobility, decent damage, controls...",
					"It's all good :) Just have some problems with mages sometimes"
				],
				"Battleground",
				0.68865,
				"ranked",
				1,
				1
			],
			[
				[
					"Tried both specs in BG's and it really is just no fun, never had such a hard time in PVP we feel so useless.",
					"(For those that disagree, popping all your CD's + Artifact and bum rushing down one person every 3 minutes is not fun when that is the only time you'll get a kill.)"
				],
				"Battleground",
				-0.5033000000000001,
				"BG's",
				1,
				1
			],
			[
				[
					"yeah just tested pretty neat, need to test in a BG"
				],
				"Battleground",
				0.8126,
				"BG",
				1,
				1
			],
			[
				[
					"They should at least remove the cross faction talking in BG's.Just experiencing already shows why you can't have nice things like that in WoW.Had a guy constantly saying BS if he jumped me with 2-3 other people like a cool kid."
				],
				"Battleground",
				0.6083,
				"BG's.Just",
				0,
				1
			],
			[
				[
					"14/10/2016 13:46Posted by SaelyberPersonally I have found that using demon blades with felblade and felmastery really helped because it gives you some reliable fury generation outside of just the procs.",
					"I'm also of the opinion it's much better with contained fury ranked up because you don't overcap so hard which happens quite frequently at 100 fury.So you would give up your best source of damage for fury gen?...."
				],
				"Battleground",
				-0.61395,
				"ranked",
				0,
				1
			],
			[
				[
					"29/08/2016 16:55Posted by Propain29/08/2016 16:12Posted by VerathixFellow PVE players fear not.",
					"this was a nerf to the PVP template in BG and arena ONLY and has no impact on PVE in anyway shape or form.so you can all relax and go back to enjoying 90% of the games content with out a care in the world for the minority PVP players crying about lvl 100 changes less then 10 hours before the expansion launched for lvl 110 balance and tallents :DEvery thread...Yes, you are a PvE player, you are not affected, we get it.Now why don't you fck off to a cave or something and go kill some pixels?Hate to break it to you bub but you're only ever killing pixels in this game, no player is harmed by your killing his in game avatar :)I know, completely shatters the immersion right?",
					":<"
				],
				"Battleground",
				-0.6466666666666666,
				"G",
				0,
				1
			],
			[
				[
					"11/08/2016 22:36Posted by DeäthlogenIn my first BG I was top 2, and in my second one I was first on the leaderboards, and I didn't even play for a long time.i was top1 top2 damage done on DH but if some one doing TOP dmg or top killing blows in random bg it doesnt mean that class is good, On Balance Druid you can easily do top dmg/killing blows without healers, and DH is dependet on his team mates not just healers DH cant stun/slow down other classes (expect 5sec stun with 1min cd, rogue doing 6sec stun evry 20sec)and he need assistance from classes like monk and rogue to do it for him, otherwise DH would get kited."
				],
				"Battleground",
				0.8216,
				"BG",
				1,
				1
			],
			[
				[
					"Personally I have found that using demon blades with felblade and felmastery really helped because it gives you some reliable fury generation outside of just the procs.",
					"I'm also of the opinion it's much better with contained fury ranked up because you don't overcap so hard which happens quite frequently at 100 fury."
				],
				"Battleground",
				-0.6599999999999999,
				"ranked",
				0,
				1
			],
			[
				[
					"True and i totally Agree.. but IF there are no stealthers in rbg or arena which Will pull ahead fb or chaos cleave?"
				],
				"Battleground",
				-0.7876,
				"rbg",
				1,
				1
			],
			[
				[
					"To be fair we ain't really viable in bg because as everyone says we can be kited so easy we have 0 snare or slow so hard to stay on target and we can't break out of snares or slow lol but be different at 110"
				],
				"Battleground",
				0.5404,
				"bg",
				0,
				1
			],
			[
				[
					"Aye this annoyed me yesterday when spamming BGs, especially Silvershard mines with those rails, constantly getting stuck and unable to move.Then in 70% of times, Fel rush does no damage when rushing through people, only when actually hitting with a melee ability and engaging combat it does dmg...this really screws up experience."
				],
				"Battleground",
				-0.902,
				"Silvershard",
				1,
				1
			]
		],
		"other": [
			[
				[
					"Always choose your main attribute over anything else.Agility, Strength, intelligence.",
					"Always one of those 3, depending on your class.BUT, the gem prices are horrible atm, and you won't get to use those bracers for long, so I'd recommend gemming crit, to save money."
				],
				"other",
				0.5498,
				".",
				1,
				1
			],
			[
				[
					"I have noticed this a lot yesterday myself.Last week I was PUGing mythic+5/6, with out a worry and this week I keep getting declined from even a Mythic+2.No one wants to touch us with a 10 foot pole."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"You wont advance properly without a guild.When it comes to heroic raiding, Pugs are usually done by players who have already  completed the content with their guild... in other words you will need the achievement and gear to do it with a pug group."
				],
				"other",
				0.5574,
				".",
				1,
				1
			],
			[
				[
					"Guys i have found our hidden effect !",
					"Causes crying on the demon hunter forums."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"that has always been using Demon's bite and can generate with it 30% more DPS than with Demon Blades?I mean, I always liked Demon's bite more, never really understood, why people like to throw themselves at the mercy of RNG gods....For reference, my build is currently 2-3-2-3-2-3-3, or 2-3-3-3-2-1-3 depending on whether Bloodlet is better for encounter or not."
				],
				"other",
				0.8658,
				".",
				1,
				1
			],
			[
				[
					"Hey peeps, I'm looking for a leather tmog set that can be crafted for me.",
					"I tried a rogue only set today (thinking I could wear it) but of course I couldn't  and I've checked wowhead but I'm a little lost.",
					"Does anyone here have any advice for a crafted set at all.",
					"Many thanks"
				],
				"other",
				0.0,
				"s",
				1,
				1
			],
			[
				[
					"New build looks terrible, all those posts on the US forum with replies from Blizzard and this is their reaction?I know it's datamined and I know it's tentative but real talk, for all the complaints about the spec's single target and for the answer to be \"better just nerf the fun momentum rotation and buff the easier talents\" is beyond dumb.Yes it was annoying that our mobility and defensives provided DPS boosts, but that made the class fun and the risk and planning involved in that was good and provided a moderate skill cap.I went DPS because of the ridiculous Demon Spikes nerf, and now when asked for more single target DPS (I thought we were already fine but whatever), you drop some of our ability to maximise damage through using Blur for Fel Rush charges and buff Nemesis so you can just press one button and forget about it?Really hope you realise in the testing that this is bad, should be reverted and maybe provide changes to a class that actually needs them.P.S.",
					"Good work on that new legendary, looks super cool and will be the main focus of my desire from 7.1.5 onwards."
				],
				"other",
				0.82355,
				".",
				0,
				1
			],
			[
				[
					"1-14 for demons bite  (which btw is the best option to use now)1-8 for demon blades (which is nerfed to poop and cant compete with demon bite + felblade + demonic appitite combo)argue all you like i am correct :D"
				],
				"other",
				0.8941,
				"D",
				0,
				1
			],
			[
				[
					"Nice, Raiev..like the warden :P"
				],
				"other",
				0.7125,
				"P",
				1,
				1
			],
			[
				[
					"why blizzard why?????????",
					"?"
				],
				"other",
				0.0,
				"?",
				1,
				1
			],
			[
				[
					"stop bloody crying.",
					"quit the game, please you miserable gits"
				],
				"other",
				-0.51415,
				"s",
				0,
				1
			],
			[
				[
					"So when in the class hall on the lower level playing with upgrades on my artifact weapon and on more than one occasion I have had Doom Guard's Curse placed on me from the Twisting Nether bosses like Dal'grozz and Gelthrak.Must be a bug?",
					"Can't see why I should get the debuff when i'm not even in the fight.... gets annoying after a while."
				],
				"other",
				-0.57245,
				".",
				1,
				1
			],
			[
				[
					"Im not sure about the cap but crits value decreases after reaching 45% so somewhere around that."
				],
				"other",
				0.5885,
				".",
				1,
				1
			],
			[
				[
					"too put in real life perspective, i would have gotten myself fired with that little effort put in something"
				],
				"other",
				-0.5574,
				"g",
				1,
				1
			],
			[
				[
					"What you people fail to understand is \"mainly fel barrage\" is not \"ONLY FEL BARRAGE\""
				],
				"other",
				-0.5423,
				"\"",
				1,
				1
			],
			[
				[
					"ofc, lets not use spell that deal more damage and cost less fury than our primary spender even it deals extra more in meta *facepalm*"
				],
				"other",
				-0.7845,
				"*",
				1,
				1
			],
			[
				[
					"I've died few times during questing too... and almost everyone is complaining about warriors, they are getting another nerf soon"
				],
				"other",
				-0.6293,
				"n",
				1,
				1
			],
			[
				[
					"Would have loved it for a Goblin!Still cool though - 6/10"
				],
				"other",
				0.7574,
				"0",
				1,
				1
			],
			[
				[
					"iS the nerf live or not yet?",
					"any1 know?"
				],
				"other",
				0.0,
				"?",
				1,
				1
			],
			[
				[
					"@ Sylia 8/10 Looks cool, wasnt to keen on tattoos, but yours fit the look well.",
					"Maybe wepon colour is a bit off, but who cares when they look that badass?"
				],
				"other",
				0.59735,
				"?",
				1,
				1
			],
			[
				[
					"Blood Elf since, Night Elf can't be Horde :P"
				],
				"other",
				0.0,
				"P",
				1,
				1
			],
			[
				[
					"22/09/2016 07:45Posted by Morrekdarashi use, Fel rush twice (forth and back, hitting them twiceThis is a dps loss because by doing this, you don't optimise the Momentum buff uptime"
				],
				"other",
				-0.5727,
				"e",
				1,
				1
			],
			[
				[
					"well acrtually i dont like the talent build , tbh i just trying around now, momentium keep up abit hard for me to keep up, i prefer be on same Place well i dont like using reatreat and fly back like a bullet..i like felblade much better and maybe change to nemesis.",
					"i dunno actually :-( but must try to find a way how i want and ofc it must be working aswell not i get booted from Dungeons, me actually love my Demon Hunter more fun then my Druid (Feral)."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"Would be interesting to have a 3rd spec.I'd say a ranged spec would be good, we have chaos damage so why not make a spell set using that?Small cast time basic fel bolt to build painLong cast big hitter for dumping painDot to fill the gapsGive it the sigils for controlextend the range on interruptMaybe have the fragments split from you instead of the mob>consume for shieldsome kind of battle rez?Pretty much just a fel druid really reading it back, i mean they already use a scythe so it wouldn't break the caster feel, having a melee weapon equipped.Could even swap it out and use a moonglaive, like having the twin blades of azzinoth combined, tossing it around would look pretty cool.Then you could attach spells to ranged attacks instead of casting magic."
				],
				"other",
				-0.7394,
				".",
				1,
				1
			],
			[
				[
					"same here, feels so bad that my tank weapons got the highest ilvl due to the world quest relic drops being for that..."
				],
				"other",
				-0.8122,
				".",
				1,
				1
			],
			[
				[
					"Havoc makes questing go so quickly but I guarantee you will die due to the insane number of mobs that will jump you.",
					"Especially painful if you're on a PvP realm and other players are too dumb to consider their cleaves."
				],
				"other",
				-0.7988999999999999,
				".",
				1,
				1
			],
			[
				[
					"pretty nice :)8/10"
				],
				"other",
				0.7184,
				"0",
				1,
				1
			],
			[
				[
					"IN PVP:*What I love.",
					"Action feels fast pace.",
					"especially right now with the pre patch.",
					"It's kill or be killed.",
					"this makes me feel like every action made plays a factor in your victory or defeat*What I hate.",
					"The fact that many of our talents are only opened up past lvl 100.",
					"I understand why this was done, it just feels bad.IN PVE:*What I love.",
					"Mobility in boss fights is really good, fun and refreshing.",
					"*What I hate.",
					"The rotation with Demon Blades is just boring.",
					"you spam Chaos strike on almost every global cool down.",
					"If you do research you will see that, its a dps loss to do anything other then fel rush at the right time and Chaos Strike.",
					"Again talents past 100 will help with this but for now its abysmal.",
					"And Demon blades is the best talent currently unfortunately."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"29/08/2016 17:46Posted by RenziaGo VengeanceI think I actually will be lol =D"
				],
				"other",
				0.7804,
				"D",
				1,
				1
			],
			[
				[
					"Hy,great reply thank you very much."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"What the hell are you guys smoking?",
					"I see alot of DHs actually realizing that the stat post 7.1.5. was utterly retarded.",
					"Then we have the other DHs saying they were fine and the nerfs were unnecessary.You realize that you still are doing insane burst and damage, right?"
				],
				"other",
				-0.6390666666666667,
				"?",
				1,
				1
			],
			[
				[
					"i got the same problem.. its 100% a bug... i dont know whats wrong there.. but one in my guild does so much more dmg with that talent."
				],
				"other",
				0.668,
				".",
				0,
				1
			],
			[
				[
					"Sorry to be the one to tell you this but no Developers are reading this."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"3/10 for being creative.Mine's pretty standard but the gladiator's set is pretty !",
					"@#$ing amazing."
				],
				"other",
				0.67855,
				".",
				1,
				1
			],
			[
				[
					"There is maintenance from 3-6am.",
					"Said so earlier ingame."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"Does anyone know of a decent resource bar addon that I can customise so I can have a decent sized fury bar on my screen?",
					"My UI is very small and my terrible eyesight makes it very difficult to accurately track my fury levels... :("
				],
				"other",
				-0.7409,
				"(",
				1,
				1
			],
			[
				[
					"Actually, since all special item effects are lost in instanced PvP, nobody wants them for that purpose either.",
					"World PvP doesn't matter since it is rare and unbalanced."
				],
				"other",
				0.0,
				".",
				1,
				0
			],
			[
				[
					"I have always loved that tabard, looks solid!10/10I also loved the starting gear, so i just threw on a mask and here we go!"
				],
				"other",
				0.855,
				"!",
				1,
				1
			],
			[
				[
					"21/01/2017 10:34Posted by Amnotillidani rait strait 5/7Looking good, 8/10, I would find some cool headgear if I were you and skip the cloak, demon hunters look better without a cloak imo."
				],
				"other",
				0.7964,
				".",
				1,
				1
			],
			[
				[
					"I know all this, but why Blizz decided to give us both slow weaps?"
				],
				"other",
				0.0,
				"?",
				1,
				1
			],
			[
				[
					"There's nothing more to be said on this topic.",
					"Someone's already posted all the information about why Versatility is better than mastery.",
					"Bloodlet damage is usually number 2 after chaos strikes.",
					"It's better to go for Vers to include ALL damage over mastery which only increases a portion of it."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"I'm told that (at least Night Elf Male) Demon Hunters have access to real Black Hair, unlike the gray-blue'ish black that Night and Blood Elves otherwise have to deal with.Since I've neither pre-ordered, nor gotten into beta, has anyone been able to check it out?",
					"Is it only available to nelf male, or do belves and nelf females also get the option?"
				],
				"other",
				0.0,
				"?",
				1,
				1
			],
			[
				[
					"Aight, i've been missing out on this for way too long now!Can't seem to find the beacon/crystal in order to do it, and i've done all the quests in the classhall, i've been putting effort in to keeping up with all the quests from it and still can't seem to unlock it?Is this a bug or am i missing out on something, cause i can't seem to find anyone else having a problem with this when i google or search on forums, and making a ticket these Days is not like 10 years ago when you could actually make one (guess it got abused by some with every itsy bitsy problem)Thanks in advanceAmor"
				],
				"other",
				-0.8957,
				"r",
				1,
				1
			],
			[
				[
					"14/12/2016 19:58Posted by Abend14/12/2016 16:35Posted by AlibabaaliDo these calculations take Anguish into account?Yes, all relevant artifact traits are included.",
					"Those are Anguish, Inner Demons, Chaos Vision, Demon Rage and the two CS ones.Alright, thanks!"
				],
				"other",
				-0.71075,
				"!",
				0,
				1
			],
			[
				[
					"All that i received from gearing at various stats - understanding the real weight of stats.",
					"You don't need crit at all, versatility could easily beat it.",
					"In terms of surviveability you need enough haste for pain/soul generation, gcd, cd of spikes and aura.",
					"For me, comfortable numbers around 20-25%.",
					"Near 25% for mastery to prevent massive dmg and all other secondary bonuses at vers.Talents for mythical - 3-2-2-1-2-3-3For raids mostly - 2-1-1-(anything)-2-1-1"
				],
				"other",
				0.0,
				"1",
				1,
				1
			],
			[
				[
					"how about you add zipper to your rear end so you dont have to get stitches every time you pvp"
				],
				"other",
				0.0,
				"p",
				1,
				1
			],
			[
				[
					"Guys , i have just done some test on ptr.....And the demon build is totally crazy.Try blind fury/ demonic appetit / first blood / demon reborn / demonicYou use eye beam , when demonic proc ends , use meta .When meta ends , eye beam for more demon form .When no demon form , build max fury , spam cs strike , reduce cd of eye beam with soul shard that spawn , repeat.Demonic appettit is really cool , you don t have to go on the shard actually , just do a little strafe and the soul shard are automatically drag to you."
				],
				"other",
				-0.8803,
				".",
				0,
				1
			],
			[
				[
					"Nope, Blade Dance is just bad even with 4+ targets now, after the Balanced Blades nerf.We use it when we've nothing else to use.",
					"The damage it does is subpar compared to Fel Barrage, FotI and Eye Beam."
				],
				"other",
				-0.5181,
				".",
				1,
				1
			],
			[
				[
					"BGsOpen world pvpDoing withered quest - nightfallen.Random dungeonsYou name it.Just seems random when pressing fel rush and spamming other skills.Happens atleast 2-3times for me each time I play for a few hours."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"I've farmed it for about 17 hours, It literally doesn't want to know.."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"You only glide when you press jump while falling.",
					"You don't glide when you jump, unless you're pressing it 3 times.Bind it to a key to control it.you can also use it quickly after vengeful retreat for a short boost back into combat."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"I noticed just now that it also closes loot windows, if you loot a treasure chest on the broken isles, the loot is sent to your mailbox instead, since the box just disappears, a bit annoying, but it's annoying in general to have your loot windows closing when your sigils pop."
				],
				"other",
				-0.7615,
				".",
				1,
				1
			],
			[
				[
					"Blizzard answers your class critics once every three months if you are lucky.",
					"Except if you are playing mage ofc, then its once a week xD"
				],
				"other",
				0.0,
				"D",
				1,
				1
			],
			[
				[
					"Am i the only bothered by this ?Not being able to use Chaos strike after Fel rush throw glaive x2 feels underwhelming.Would be great if it generated fury rotation would feel smoother"
				],
				"other",
				-0.7269,
				"r",
				1,
				1
			],
			[
				[
					"13/01/2017 11:40Posted by Izidro13/01/2017 06:25Posted by NelthesJust curious since i am lvlng this character ... How much Is the difference un 7.1.5 between momentum build and nemesis or eyebeam?",
					"I mean in dps.DPS-wise 7.1.5 is insane, but playstyle is horrible, very very easy and doesn't feel rewarding and fun compared to pre 7.1.5Dude I think you totally forgat that, momentum specc was way too easier to play with.",
					"Did you consider it fun and skillful playstyle ?",
					"Momentum is/was a cheap playstyle besides who/what hinders you to play momentum ?",
					"Last time I checked the talent build Momentum was still there !"
				],
				"other",
				0.0,
				"!",
				1,
				1
			],
			[
				[
					"Almost every single our attack has a greeny animation.",
					"I hate that!",
					"Our class color is purple, so i want blizzard to give us opportunity to use purple abilities.",
					"Every other classeses have something iconic to their class color and we, demon hunters don't.",
					"1) Hunters, Green = camouflage, forest thematic, traps.2) Warlocks, Dark Purple = dark spells and etc.3) Priest, White = Praying to god, praying is always good, and white color is noble.4) Druid, Orange = Druid has tree form, tree form has peaches.5) Warrior, Brown = !",
					"@#$, like warriors always were.6) Monc, Green = Nature7) Mage, Blue = Ice!8) Shaman, Blue = Water9) Rogue, Yellow = Urine10) Death Knight, Red = BLOOD!Just look at this.",
					"Every class has etwas thematically fitting its color.",
					"So i want too.",
					"Give us opportunity to play with Purple color!",
					"!"
				],
				"other",
				0.0,
				"!",
				1,
				1
			],
			[
				[
					"55k/65k seems to be around what I'm averaging in my gear at the moment.",
					"I finished Archimonde on 76k yesterday, but that has a lot of adds."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"+1 For true black hair on Blood Elf Demon Hunters <3"
				],
				"other",
				0.6908,
				"3",
				1,
				1
			],
			[
				[
					"5/10"
				],
				"other",
				0.0,
				"0",
				1,
				1
			],
			[
				[
					"8/10 Sounds Good, sounds demonic and ends like my name :D.But also reminds me of Yrel."
				],
				"other",
				0.6597,
				".",
				1,
				1
			],
			[
				[
					"The problem is that eyebeem gives you auto crits so tanks the crit value but chaos strike makes crit easily your best stat.It's not so much about the auto-crit it's the way the spec just doesn't have internal consistency about what secondaries it wants you to value."
				],
				"other",
				0.7227,
				".",
				1,
				1
			],
			[
				[
					"Monks have had this same issue with roll and flying serpent kick since MoP so doubt they would or can do anything about it"
				],
				"other",
				-0.5009,
				"t",
				1,
				1
			],
			[
				[
					"Your name is Proskill, you should already know this.By the way your name is vomit inducing."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"The more crit you have, the less valuable haste becomesCrit>Agi>vers>mastery>hasteThis is due to more refunds from Chaos strike.",
					"And haste in general barely affects anything, its just a bad stat (EVEN if you run Demon blades)"
				],
				"other",
				0.0,
				")",
				1,
				1
			],
			[
				[
					"Justice!"
				],
				"other",
				0.5707,
				"!",
				1,
				1
			],
			[
				[
					"Don't know if its just the arsenal, but to me it looks like a mash up of various colours where nothing fits at all D: 1/10"
				],
				"other",
				0.7992,
				"0",
				0,
				1
			],
			[
				[
					"interesting idea, though just buffing felblade slightly is a more realistic aproach and might do nearly the same work since by taking it you already leave bloodlet out and there you have your less aoe oriented playstyle, the problem only being that felblade is too weak right nowRegards"
				],
				"other",
				0.0,
				"s",
				1,
				1
			],
			[
				[
					"I dont think if dhs ever design for pvp :) so yeah , if u want ply pvp srsly then reroll your class."
				],
				"other",
				0.7528,
				".",
				0,
				1
			],
			[
				[
					"QQ moar plox"
				],
				"other",
				-0.6037,
				"x",
				1,
				1
			],
			[
				[
					"Better hope its not the 5 worst Legendary then - considering the Legendary System would making getting a 6th near impossible :P"
				],
				"other",
				0.9048,
				"P",
				1,
				1
			],
			[
				[
					"25/08/2016 05:36Posted by ValacDefiancethinking of rift, though liked the game, 8/10Pretty solid for a Nelf, 7/10"
				],
				"other",
				0.5267,
				"0",
				1,
				1
			],
			[
				[
					"https://www.youtube.com/watch?v=4sSX9GqBYvM&feature=youtu.beTell me what you think, is the new hero class balanced for pvp ?",
					":)Probably nerf soon, i hope!",
					":)"
				],
				"other",
				0.5195333333333333,
				")",
				1,
				1
			],
			[
				[
					"Seems to have vanished!"
				],
				"other",
				0.0,
				"!",
				1,
				1
			],
			[
				[
					"Nope, ya dun goofed it m8."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"08/09/2016 16:05Posted by Avidiushttp://imgur.com/a/AG6qP proof that it dropGotta say, this is definitly the best proof so far, thanks!"
				],
				"other",
				0.8258,
				"!",
				1,
				1
			],
			[
				[
					"Really?",
					"you having trouble placing the damn glide ability on a bar and then bind that slot to a key??",
					"?"
				],
				"other",
				0.0,
				"?",
				1,
				1
			],
			[
				[
					"remove pain cost or remove cooldown from recharge for demon spikes please that would help vengeance demon hunter survive and not drop to fast in Health."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"Really good 10/10, i like it!"
				],
				"other",
				0.739,
				"!",
				1,
				1
			],
			[
				[
					"I want to see Felblade buffed (doing chaos dmg)."
				],
				"other",
				-0.5267,
				".",
				1,
				1
			],
			[
				[
					"In regards to stat weights, sim yourself.Your weights will change based on your crit, general gear and luck with legendaries.Anger of the half giants and the ursoc trinket make haste a much weaker stat compared to others for example."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"They did however say \"mainly\" which indicates they will do other changes too."
				],
				"other",
				0.0,
				".",
				1,
				1
			],
			[
				[
					"7/10"
				],
				"other",
				0.0,
				"0",
				1,
				1
			],
			[
				[
					"8\\10 NICE"
				],
				"other",
				0.5473,
				"E",
				1,
				1
			],
			[
				[
					"I don't know about you guys, but the 75% chance talent procs like once every 30s for me.More like 20% chances to proc."
				],
				"other",
				0.9313,
				".",
				1,
				1
			],
			[
				[
					"6/10 pretty nice mog"
				],
				"other",
				0.7184,
				"g",
				1,
				1
			],
			[
				[
					"Edit:might wanna try, sounds fun to play[Blind Fury] [Demon Blades][First Blood][Soul Rending] [Fel Eruption] [Unleashed Power] for dungeons [Demon Reborn} for other content[Last talent situational]"
				],
				"other",
				0.7269,
				"]",
				1,
				1
			],
			[
				[
					"Now you know what it feels like :-)"
				],
				"other",
				0.5859,
				")",
				1,
				1
			],
			[
				[
					"Alright, thanks, I'll check out those websites :)"
				],
				"other",
				0.7845,
				")",
				1,
				1
			],
			[
				[
					"I hate the metamorphosis bug...",
					"When you use eye beam on last seconds of metamorphosis the 8 secounds of talent metamorphosis will bug out and you will be screwed...",
					"Cause it shall give you 8 seconds of being demon more but nope...  Its bugged"
				],
				"other",
				0.0,
				"d",
				0,
				1
			],
			[
				[
					"7/10 I kinda like itI actually wanted to go for Fylfagos, until I realised it got the word \"fag\" in it.. Then again it would have fit cause I use the title..Fylgos the Fabulous"
				],
				"other",
				0.7968,
				"s",
				1,
				1
			],
			[
				[
					"creative combo - but well a bit to much damn for me :)"
				],
				"other",
				0.6187,
				")",
				1,
				1
			],
			[
				[
					"They just held DHs back until the final selloutYou know that point when the game is so destroyed and stale that only a major class can produce sales."
				],
				"other",
				-0.6269,
				".",
				1,
				1
			],
			[
				[
					"I AM PRO I KILL ALL!",
					"unless they know their class and then i.. cc... slowed.... disarmed... stunned... feared.... rooted... sleeped.... polymorpthed... silenced.. cycloned... snared... feared... disoriented...  Then im dead"
				],
				"other",
				-0.6831499999999999,
				"d",
				1,
				0
			],
			[
				[
					"momentum is really cool in pve but when it comes to arenas its not that really useful even its the reasonable option in that tree cause your sustain is really bad going nemesis is not wise for high burst cause wat you gonna do after nemesis blades and meta is over its better to just afk.",
					"So why momentum is not that great is cause you r melee you need to stay top on your target also you r slowed 90% of the time, when you fel rush to get that dmg increase you find yourself in awkard positions and when you try to go back to your target cause you r slowed you r wasting 2 to 3 secs of your momentum then you have only 1 ability window unless you have bl on yourself ofc so maybe if momentum stacks in time wise its better for both pvp and pve wat ı mean for example if you retreat then fel rush you get 8 secs of momentum instead refreshing the remaining secs on momentum.",
					"Even when you double fel rush then blur then double fel rush again 16 secs is not op also dont forget you r givin up on mobility and blur.",
					"I would like to hear your guys opinions too."
				],
				"other",
				0.0,
				".",
				1,
				0
			],
			[
				[
					"That is what is creating my doubts...the crafted gear is no where near gamebreaking at all...plus been a heroic/mythic raider on a long run been able to get my own p enchants and flasks becomes a more profit choice i guess...Still i would like to hear ur own opinions and thoughts about it..."
				],
				"other",
				0.6901,
				".",
				1,
				1
			],
			[
				[
					"Thanks for sharing, now make me some food and teleport back to your mage forums."
				],
				"other",
				0.6908,
				".",
				1,
				1
			],
			[
				[
					"gebt dem idioten keine aufmerksamkeit bitte....die leute suchen teilweise seid release von legion farmen bis zu 24h irgendwelche dämlichen gegner...das forum ist voll damit leute mit guten ideen und spannenden theorien geben sich sehr viel mühe und nun wo einer weiss wie es geht behält er es für sich...was assozialeres kann man einfach ned machen selbst die ganzen aegwynn kiddies sind da noch viel besser...also echt enttäuschende entscheidung"
				],
				"other",
				-0.5994,
				"g",
				1,
				1
			],
			[
				[
					"7/10 I'd say"
				],
				"other",
				0.0,
				"y",
				1,
				1
			],
			[
				[
					"Gz dude, If you make that guide we all are gonna love you so much :PAnd you can disable whispers, so you can play without nobody disturbing you!"
				],
				"other",
				0.8707,
				"!",
				1,
				1
			],
			[
				[
					"If bloodlet die, our sustain cleave aoe (which is pretty low) also die.2 of our big aoe are on 60 and 45 Cd's.",
					"And Blade dance is not even worth using anymore with the totally unjustified nerf on the trait (unless there are 4 more targets and you have nothing else to cast)"
				],
				"other",
				0.0,
				")",
				1,
				1
			]
		],
		"Dungeon": [
			[
				[
					"03/10/2016 10:55Posted by АаксAs for Ursoc he's definitely the most annoying boss for a tank in the entire dungeon.",
					"Thankfully, the fight is really short.What I may suggest to you is:1) Focus the other tank and move the focus frame somewhere near yours to easily track debuffs2) You can actually learn at which points in a fight he will make the voidzone, so you can be ready to jump out.",
					"Also if you are not tanking you can pre-emptively run out and taunt him out of the pool, because he seems to make a mess right after debuff application3) Forget your DPS.",
					"Try to calm down and concentrate solely on your cooldowns and tank swap.",
					"4) Don't try to conserve things like metamorphosis and fire brand, especially in the beginning of the fight, because they will be up again towards the end.Oh we downed him.",
					"Me and other tank worked out a system and routine that worked for us.",
					"As for concentrating on cooldowns.... >.> I was spam smashing those keys.",
					"But its a daunting prospect knowing that any incoming dmg at any moment means your dead, and not because your bad or totally wrong.",
					"I found that if im out by a second on using my cd's I was a gonner.Another DH tank that I follow and monitor on the 25th had a 75% perf for ank survivability.",
					"On the 28th he managed just 30% .",
					"On my first kill, despite always using cd's non stop I managed just 42%.I think that speaks volumes though if pre-nerf it was 75% and post nerf its dropped 45% down to 30% lol.",
					"Really puts the fight into context for us as DH tanks."
				],
				"Dungeon",
				0.0,
				"dungeon.",
				1,
				1
			],
			[
				[
					"I would go for Haste more after Crit, with BloodLet you can stack up the bleed effect quite well and fast.",
					"each extra glaive you throw resets the time on your dot and adds more damage into it.",
					"in a single fight other than Chaos Strike (because of my crit, a lot of refunded fury, some times a good 3/4 hits in a row) I find that Bloodlet is my next biggest damage dealer.even if your AOEing a pack of mobs you will find it a nice boost in your damage because your hitting anywhere between 3/5 mobs, they are all bleeding away even if your more AOE abilities are on CD.Saying that, Haste also reduces the CD of BladeDance/Death Sweep, so a bonus of AOE damage as well.In my rotation I try and get 2 Throw Glaives in after a Vengeful Retreat (boosted with Momentum buff) and 1 while I'm in close, this keeps ramping up the damage of Bloodlet, after 2 rotations of this your Bloodlet should be constantly doing its max amount of damage"
				],
				"Dungeon",
				0.0,
				"as",
				1,
				0
			],
			[
				[
					"Same here, started mythic on my alts with 810-812 ilvl.",
					"You need to be on point with your stuff not to oom your healer so as long as you are comfortable with that go for it.",
					"If anything the experience is awesome when the content is more challenging."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"Largely dependant on the fight....For ST: https://www.warcraftlogs.com/reports/98WRHZzpYB71Cbmn#fight=7&type=damage-donethat's 340k at 861ilvl."
				],
				"Dungeon",
				0.0,
				"ST:",
				1,
				1
			],
			[
				[
					"Funny how u spent 14 obliterum to upgrade the gear with wrong stats, u just rerolled DH out of rage, and felt like it was needed to come here and complain about it, with no idea whatsoever about the class.wow."
				],
				"Dungeon",
				-0.7184,
				"DH",
				1,
				0
			],
			[
				[
					"17/08/2016 00:05Posted by Felmortus16/08/2016 12:04Posted by KrayzieDH's are fantastic at 110 so I wonder what kind of mushrooms one has been smoking if they claim otherwise..Its awesome in PvE, but PvP is awful, the problems are the same as they are now.Tbh im im always topping killing blows and dmg in kinda any random BG , only problem are outlaw rogues due to lack of talents on our part so imo it's an L2P issue for you boys."
				],
				"Dungeon",
				-0.9231,
				"as",
				0,
				1
			],
			[
				[
					"14/10/2016 16:52Posted by DeltharionWe have to sacrifice all these things just to be able to remain as middle of the pack DPS and it is reallystarting to feel quite underwhelming.Sorry, but I think DH's need to sacrifice everything in order to gain dps.Also DH is in good place, you need to do much in order to do something.",
					"Not every class is smash 3 buttons, if you want it go play something else."
				],
				"Dungeon",
				0.6295999999999999,
				"as",
				1,
				1
			],
			[
				[
					"10/08/2016 13:05Posted by Isabellethea10/08/2016 10:23Posted by PiratepattFeels like i get kited by every ranged,in 1vs1 i eat DHs for breakfast as Outlaw rogue, can kite them as Outlaw, but who cares about 1vs1 its team game (i think its okay since demon hunters have stealth detection so rogues should have abils to survive vs them)and in bgs demon hunters just like rogues die fast vs big group of ranged like Moonkins and Warlocks,Only difference is that rogues got slow, stun, cc and we don't have any of that."
				],
				"Dungeon",
				0.7783,
				"as",
				0,
				0
			],
			[
				[
					"So I'm  thinking about getting my DH to 110 I've changed his spec from vengeance to havoc and have brought the glaives from the fel hammer (as I can't get my havoc artifact until 102) when I suddenly thought, as we DH start so late in to wow we've never had a chance to build up a back catalogue of weapons to tmog ourselves with.",
					"I know you can use swords etc but I do love the warglaives and I'm wondering if any more will be added in game so we can have more to T-mog from."
				],
				"Dungeon",
				0.0,
				"DH",
				1,
				0
			],
			[
				[
					"Luckily, I got the off-hand on my DH on my first kill and I've got the main hand on my rogue.I know I'm not the only one who feels that it'd be awesome if we could transmog our weapons to look like these bad boys.I've heard rumours that Blizzard are planning on allowing legendaries to be transmogged, but are these just rumours or are they genuinely going to do it?",
					":)"
				],
				"Dungeon",
				0.0,
				"DH",
				1,
				0
			],
			[
				[
					"15/11/2016 21:34Posted by Zekken15/11/2016 21:31Posted by Kazoonit feels like it's someone who never played demon hunter, that is in charge of the changes, and has no idea what he is doingIt's really strange but after seeing the previous proposed notes are you even surprised?T'would seem the feedback they're looking at is coming strictly from DH's who don't use momentum or bloodlet and want to play with an incredibly simple rotation.I mean, we can clearly see these aren't meant to be a nerf, just a \"you can play a different way if you want\" and quality of play change, but really this is for no one except DHs who sit on the bottom of the Skada or who only do world content (which is fine, play however you want), but I don't feel my choice in how I use Blur should be effected by someone else."
				],
				"Dungeon",
				0.9364,
				"DH's",
				1,
				1
			],
			[
				[
					"I dont really see why youre against buffing demons blade to 85%, this will make the ring less important for our fury regen.",
					"It seems to me that youre only looking at this from one perspective.Buffing DB to 85-90% makes the ring less powerfull and less mandatory to use (i.e opening up the other legendaries and making them more usefull, for instance in m+ head+wrists).Demons bites weakness does not lie within its fury generation or its damage, its that it takes you 1 gcd to use it meaning that you cant spend your fury during that time (on harder hitting abilities) while demons blade generates fury constantly.Even at 75% as it is now you get fury generation problems and it needs to be increased, not decreased."
				],
				"Dungeon",
				-0.73125,
				"as",
				0,
				0
			],
			[
				[
					"I'll say this, !",
					"@#$ anyone who tries to PvP as a Tank, I %^-*ing hate that !",
					"@#$ at least in World PvP ( WQs mostly ) Tanks deal INSANE DAMAGE and just cannot die.I also fought against a Vengeance DH in AV recently, two DKs couldn't kill him, self-healing killed the fun in Tanks and it also kills my fun in PvP."
				],
				"Dungeon",
				0.0,
				"",
				0,
				0
			],
			[
				[
					"momentum is designed about high uptime and using it when u have a high fury pool to maximise chaos strike dmg.you will get used to it in time if you use it.",
					"i personally use nemisis as in 7.1.5 momemtum will be a dead spec with the change to blur  (no more 2 felrush charges on use)."
				],
				"Dungeon",
				-0.80315,
				"s",
				0,
				0
			],
			[
				[
					"20/01/2017 00:20Posted by ZordragerThe amount of Ego in this thread is too damn high !This.As for the OP, try using fel barage and fel eruption in world pvp."
				],
				"Dungeon",
				0.0,
				"As",
				1,
				0
			],
			[
				[
					"(Sorry for the new topic, I felt it would go off topic in a lot of other threads.",
					"Now first off I just want to say, I only levelled to 106 in the Beta to get a feel, I didn't want to spoil any further, as for PvP I played like 60 Skirmishes straight.I consider myself only better than the average joe and this is based on my personal experiences.",
					")Currently I've been having a blast as I'm sure most of you have too, however I've come across a few annoying problems within my brief testing.I'm sorry but what is the point of having talent choices if an option of said choices is literally needed for your class to be viable in PvP?",
					"'Soul Rending' should be baked into the class, I mean we can already be CC'd and kited during 'Metamorphosis' to stop the healing process, which isn't a bad thing, I like the idea that you can't just pop 'Metamorphosis' and expect to face-roll everyone, because it does hit hard.. REALLY hard.At this point you may just be like \"Oh, here we go again, another QQ thread...\" and you're damn right, I'm sorry but...",
					"I'd never usually make a thread like this but I dare any of you that have Beta access to try an arena without 'Soul Rending', I'm sure the top rated players could pull something out of their backside but that is another matter.Taking 'Fel Eruption' over 'Nemesis' seems to be forced if you want a ranged stun but you lose out on a lot of damage that has a huge up-time, 'Master of the Glaive' is basically a must unless you're against just melee, in which case you're giving up a reduced cooldown and free cost on your only stun.Now of course right now we currently have those people saying.. \"But you have unrivalled mobility.\"",
					"True..",
					"I guess?",
					"double jump to get back onto the platform in Dalaran Arena?",
					"yes please, however the slight leap forward it provides isn't as much as you think and the glide seems to actually be more detrimental trying to use it in PvP and if you're slowed it is all useless.But you have to remember, other classes have movement abilities too (most of the time).Which yes, brings me onto when you're slowed, you'll be using that 'Vengeful Retreat' to flick yourself at your enemy, only for them to continue moving, forcing you to use 'Felblade'(if in range and/or you took the talent) and then they'll pull something like a class sprint, back-flip or whatever classes currently get after the update(not important) forcing you to use 'Fel Rush' now by this point you'd be wondering how have you not caught them yet?Well you see my dear friend, I did, I hit them a couple of times, only to be kited again and again.. and okay, seriously stop with the slows.Also just a side note, why did they nerf 'Eye Beam' into oblivion?",
					"we have very few abilities as is, don't make the few we do have useless..TL:DR You don't have a ton of control over talent choices if you wish to be viable in PvP.It makes it feel very stale and you'll be forced into a specific play style, while the class is still very enjoyable, PvP will probably get frustrating because unless you're left alone to hit a target and do that awesome damage, you're like a wet noodle vs a knife when focused.P.s.",
					"At least we'll be amazing for PvE.P.p.s.",
					"Want to annoy a warrior or other melee?",
					"'Nemesis' > 'Chaos Blades' > 'Rain from Above'."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"So when are DH getting nerfed since they're stupidly OP?"
				],
				"Dungeon",
				0.0,
				"DH",
				1,
				1
			],
			[
				[
					"Hello everyone, So the patch is now out in EU and i have been wondering about few things...What talents should i use for best Damage ?What stats should i prio ?",
					"before it was Crt>ver>haste>mastery now ?My Ilvl : 848Sorry if i made an unnecessary topic !Love to all you Demon Hunters out there !"
				],
				"Dungeon",
				0.6770499999999999,
				"an",
				1,
				0
			],
			[
				[
					"So to make all your whiners happy just bench the class altogether, so we can go play something else in peace.",
					"Or if you gonna torment us even more I humbly ask that BY THE END OF THIS MONTH you leave us with enough power to kill A mob or a Critter, or if you think we are OP for that too, make trees atkable so we can at least atk trees or bushes or rocks, with complementary WQ such as:Chop 50 logs of wood, or collect 100 leafs.",
					"Or theres an idea, you can make a quarry as a replacement for DH stronghold where all the remaining DHs can come together and collect pieces of ore for crafters.",
					"We wont sell it on AH cause that would be OP too, we will give it gladly to any engi or blacksmith that comes by.",
					"So we can use our skills to do some good."
				],
				"Dungeon",
				0.0,
				"as:Chop",
				1,
				0
			],
			[
				[
					"26/08/2016 18:21Posted by Omgkillme23/08/2016 14:44Posted by AxoneftosHello guys.",
					"So i decided to main a DH in Legion but i am having an argue with my guild.",
					"So the question is.Why bring a DH instead of a rogue for mythic progress?My guild's answer was \"they don't bring anything to the raid\" which is sadly true but what do you guys believe about this?Btw my question is very simple not sure what you are talking !",
					"@#$ about each other or why you say Dh can tank and rogue can't.",
					"If i wanted to know if rogues can replace a tank i would have ask that.",
					"So stay on the question or if you are not here to tell your opinion and you have no clue what are you talking about and you just want to write something just dodge this post.",
					"So here is the question again.",
					"Why Dh over a rogue?",
					"?For example rogue can soak a pool with his cheap death and clock of shadows etc Are you stupid?",
					"you ask a question but gets mad when people answers it for you."
				],
				"Dungeon",
				0.0,
				"DH",
				1,
				1
			],
			[
				[
					"Levelling a tank DH,enjoying every minute 2 lvls till 110, they#re called a heroic class for a reason"
				],
				"Dungeon",
				0.5574,
				"DH,enjoying",
				1,
				1
			],
			[
				[
					"Havoc... :)Reyalyn is nice as well 9/10"
				],
				"Dungeon",
				0.5994,
				"as",
				1,
				1
			],
			[
				[
					"18/09/2016 13:59Posted by SearvicWhy dk.",
					"are you that bad?",
					"l2pI'm actually playing a DH and thats why im asking."
				],
				"Dungeon",
				0.0,
				"dk.",
				1,
				0
			],
			[
				[
					"While a go there was a podcast with a same question to blizzard.",
					"(with Lore on twitch)Blizzard said that maybe there would come an artifact that makes it look like Warglaives of Azzinoth."
				],
				"Dungeon",
				0.0,
				"an",
				1,
				0
			],
			[
				[
					"Haven't done any actual content yet, but Vengeance playstyle is pretty fun.",
					"Feels like a mixture that takes the good stuff from Brewmasters and Prot Warriros/Paladings, and slaps it onto a demonically empowered tank.From what I can see, to tank effectively we'll have to time our Empower Wards / Demon Spikes well to mitigate most of the damage, and Fiery Brand is another fun damage mitigation spell.",
					"Makes up for the low armour value.",
					"...But this is speculation on my part, haven't actually done anything yet.The future talents are looking pretty fun as well, it seems I'll have fun tanking with her.",
					"Good compelling choices for different playstyles/purposes and no talent, on paper, seems to fall short of the other two.",
					"And over 9000!",
					"bonus points for the Spirit Bomb talent."
				],
				"Dungeon",
				0.5205571428571428,
				"as",
				1,
				1
			],
			[
				[
					"the problem is that the expansion was released and a bunch  of pvers/\"noobs who only play random bgs\" started crying because DHs were dealing millions of damage in the score of random BGs because their AoE was too good but they didnt check that in single damage target the DH is really bad, so blizzard nerfed the DH every 2 days.the arenas were released and in a situation where you dont need AoE damage because what you need is single target damage (aka arenas) the DH was totally useless because the nerfs.if blizzard were smart it would have waited until the arenas were released so it would find out that the DH werent OP in 3v3/2v2 pvpthe problem?",
					"blizzard isnt going to buff the DH until a few months later because it would be like saying \"oops we did it wrong\""
				],
				"Dungeon",
				-0.5660499999999999,
				"DH",
				1,
				0
			],
			[
				[
					"I pretty much like DH as it is now, I'm having lots of fun playing it.Also, I think that it would be great if Blizzard would push that it's balanced around having to use its mobility abilities (as Oakley stated - Fel Rush, Vengeful Retreat - Fel Mastery, Prepared, Bloodlet, Momentum ... dancing ) to get maximum out of the class.",
					"Difference between good and bad DH should be how one uses class mobility abilities (timing, effectiveness, environmental awareness).",
					"That would create dynamic and distinct playstyle."
				],
				"Dungeon",
				0.5435,
				"DH",
				1,
				0
			],
			[
				[
					"The bleed damage on druids is slightly higher than your crappy single target but your aoe is about 10 times better then ferals, you really have nothing to complain about right now compared to other classes.Start playing a druid and you will love demon hunters afterwards, i guarantee that as i have both."
				],
				"Dungeon",
				0.9276,
				"as",
				1,
				1
			],
			[
				[
					"DH HERO classBest joke 2016 from blizz....Atm trash class not even good ;sSad but true ;/"
				],
				"Dungeon",
				0.7402,
				"DH",
				0,
				0
			],
			[
				[
					"In a normal conversation you would spell it Artefact but in this case you are talking about a blizzard in game item and in the game, it is spelt Artifact.",
					"You are arguing with a creator of an item.",
					"Kinda like saying \"hey da Vinci, You spelt Mona Lisa wrong bro\"...Just saying."
				],
				"Dungeon",
				0.0,
				"an",
				1,
				0
			],
			[
				[
					"22/09/2016 09:53Posted by SlashoorI don't even feel like we do damage now, everything feels like finger burning hype on the keyboard atm to not talk about our pain generation?It's literally 10% dont be a drama queen.22/09/2016 10:43Posted by DamîanosAs a quite old player what i always knew from Classic days is that Tanks must do significant damage to sustain aggro without using Taunt all day and all night with the hope that between taunts an over buffed DPS or some crazy healing could cause a wipe .Now a tank must ensure their own survival and keep threat so they have huge threat modifiers that allows them to do other stuff rather than spam damage abilities."
				],
				"Dungeon",
				-0.9513,
				"old",
				1,
				1
			],
			[
				[
					"Just pointing this out as i see so many people are hopeful that things change at 110, but it doesnt.",
					"DH's can be kited indefinitely, its pretty ridiculous."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				0
			],
			[
				[
					"As you can see, the DH is the only character i have at 105, looking forward to get him to 110 soon, in a few days in fact.While i saw lots of rants when i came on the forums on how the Demon Hunter, me, am struggling a bit.As it seems, macros are important in arenas, something i will do with my friends.Is there any macro i should know?What are the best PVP talents for the DH?What is our optimal rotation ?",
					"Should we be using abilities such as Throw Glaive, etc ?And most importantly, its how i should build my artifact weapon ?Any kind of help would be really helpful :)Thank You."
				],
				"Dungeon",
				0.7959499999999999,
				"As",
				1,
				0
			],
			[
				[
					"I've got a slight concern with Fiery Brand, Burning Alive talent and Fiery Demise artifact trait.",
					"To make things clear:Fiery Brand - instant fire damage and 40% damage reduction to DH.Burning Alive - DoT added to Fiery Brand and spread every 2 sec.Fiery Demise - Fiery Brand increases fire damage DH deals to the target.Now back to the problem, the thing is, that Burning Alive talent, while it causes DoT and basic damage reduction to spread, it doesn't work with Fiery Demise trait.",
					"Talent itself says that \"your Fiery Brand deals Fire Damage and spreads to a nearby enemy\", shouldn't that also include the damage increase part, as Fiery Demise trait is an upgrade to Fiery Brand, as I understand it."
				],
				"Dungeon",
				-0.5580333333333334,
				"DH.Burning",
				0,
				0
			],
			[
				[
					"Has anyone ever come to the conclusion that we are an AoE class and Blizzard know this, want this and are pushing it.",
					"Not great for some parts of raiding but we bring a hell of a lot to Mythic + with our trash clear."
				],
				"Dungeon",
				0.0,
				"an",
				1,
				1
			],
			[
				[
					"I decided in WoD that I would switch my main from WW monk to something else (yes they are OP now, but back then you had to spec BM to even stand a chance in PvP), and I kind of liked the look of DH.What I like the most now after trying it out for a while is the controls and feeling of the attacks really.",
					"Double jump, Glide, Fel Rush, and just looking \"evil\"."
				],
				"Dungeon",
				0.0,
				"BM",
				1,
				0
			],
			[
				[
					"If your new to it, tank in normals first.",
					"The loot may not be great, but you can atleast learn both the basiscs of tanking and the basics of a specific dungeon/boss.I just went into Maw of Souls on Heroic blind (without doing it first or learning the mechanics) and it wasn't a pretty sight.3 bosses and on 2 of them we had a whipe.",
					"A difference is that I've been tanking Pandaria and Draenor dungeons/raids, so I've got experience with it.Also go look on Curse for tank addons, some give you a nice popup on what to do.",
					"Interupt, run away, face boss away, etc."
				],
				"Dungeon",
				0.0,
				"dungeon/boss.I",
				1,
				1
			],
			[
				[
					"i wouldnt call chest useless, when healers have a lot of stuff to do its really useful being almost immortal as long as you can hit the target, or simply being able of top off your hp with a minute cd + it allows you to do pull off some stupid things normally reserved only to tanks, like pulling half of suramar elites"
				],
				"Dungeon",
				0.7296,
				"as",
				1,
				0
			],
			[
				[
					"07/09/2016 11:36Posted by LavellaAll right, that's fair.",
					"I personally find Demon's Bite to be little more than hastening my inevitable carpal tunnel syndrome.This.",
					"Got rid of Demon's Bite as soon as I got Felblade.",
					"Never looked back.Demon Blades is great because it allows me to focus on the abilities that actually hit hard instead of mashing a button to generate Fury.Wich is not interesting gameplay in the slightest."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"10/09/2016 16:45Posted by ChipchubDh is mobile but easy kited .As a frost mage, im currently running ice ward( 2 frost novas) with water ele giving me 3 novas, 2 iceblocks, and i cannot cast versus a dh in world pvp, where i should have the advantage, DH CC is a stun, their interrupt is ranged, and they eat through my dense ice spec ice barrier in 2 seconds.",
					"PLEASE tell me how DH is not OP in pvp.Well either you or I is doing something wrong because I came up on a Frost mage and he just had my number I had no way to get to him before I was dead"
				],
				"Dungeon",
				0.0,
				"As",
				1,
				0
			],
			[
				[
					"Apparently Wowhead had datamined a DH specific felbat, but since then blizz have decided not to implement it yet for unknown reasons, personally I would think that since DK's have a 'class specific' flying mount, surely we should have one as well?"
				],
				"Dungeon",
				0.7579,
				"DH",
				1,
				1
			],
			[
				[
					"That is old news, blizzards community management is the worst I have ever seen in a game.",
					"There is a wall between the devs and the players and it is not how it should be."
				],
				"Dungeon",
				0.0,
				"old",
				1,
				0
			],
			[
				[
					"11/01/2017 21:16Posted by DeeceëMany people, me included, played DH for the fun, chaotic, mobile playstyle, where all your offensive abilities were your defensive ones as well.",
					"After these changes DH is just another \"stand in the same spot and press buttons that light up\" class.",
					"ruining the reason i played the class, if i wanted that i could have played any of the other classes.",
					"best single target rotation is just pressing 2 buttons after buffs.",
					"if we didnt get ANY communication during PTR, could we get any reason now ?On the contrary, DH is more fun now because it requires skill and more buttons atm rather than auto-play besides were you considering hitting to the target by fel rushing as a skill and playing with 3-4 buttons only ?",
					"if that was fun for you, well that auto play and its gg welcome to the world of anti auto-play with more options with skill based.."
				],
				"Dungeon",
				0.5036666666666667,
				"DH",
				0,
				0
			],
			[
				[
					"11/08/2016 00:26Posted by EternicaI'm not seeing any freezing when Fel Rushing whilst running and I've been playing DH all day.It mostly happens in Instances, like BG's, Arena, Dungeons."
				],
				"Dungeon",
				0.5568,
				"DH",
				1,
				1
			],
			[
				[
					"I thought this thread will be about she-males playing DH..."
				],
				"Dungeon",
				0.0,
				"DH...",
				1,
				1
			],
			[
				[
					"Yes, Icy Veins is definitely still relevant.",
					"The changes didn't affect Demon Hunters all as much as the bad players are spouting.The issue with new classes each expansion is the majority of their players are bad at the game to start off with.Toward the later end of the expansion when we can get alot of Mastery and Haste, DHs will be top again using the Demon Blades build but for now use the momentum build.",
					"I regularly pull 250-300k DPS on boss fights with 851 gear."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"This post is a troll post, don't bother responding to it just downvote it and report it as such."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"20/11/2016 22:12Posted by KhronixExcept it's not fast attacks, it's spamming a filler and making it so you're global locked it's not fast.DB after the change feels far better to play with than !",
					"@#$ty demons bite.Well, with Prepared and with Demon's Bite I feel like my Fury generation is easier to manage, It's not random, even though admittedly 75% is a really high % which makes It rather consistent.",
					"And true, It's also satisfying to have It Proc over and over again so that you can do lots of Chaos Strikes in a Momentum Window, but as someone who is considering Re-Rolling to DH because Unholy has too many Procs and RNG, I would prefer the Prepared Talent, honestly."
				],
				"Dungeon",
				0.5994666666666667,
				"",
				1,
				1
			],
			[
				[
					"Ive heard Mark of the hidden satyr also may cancel it, cant confirm or deny as its not used anymore in high raiding enviourement"
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"I agree, the most depressing (if i may use this here) thing while reading the patchnotes was to see our single target dmg take a big hit.",
					"While we needed the aoe nerf, the single target felt quite alright in line with many other classes and speccs.",
					"Since the announcement yesterday, i figured i might as well start preparing for the moment when it hits us, and started playing arround with Felblade and a little of Demon Reborn and or Unleashed Power, depending on the scenario i was playing in, (Dungeon or Raid).From what i experienced it's not easy adapting to a new playstyle this close to mythic progression releasing, BUT of course not impossible to master.",
					"The Problem still being that our single target won't be in line with other classes after taking such a hit.",
					"Felblade for example does alright but doesn't really compare to our bloodlet glaive toss from right now.I think that's the main problem, lack of alternatives.",
					"Even with the overtuned bloodlet glaive toss, we were good but not too good single target, and since our aoe needed nerfing, i think it's fair to say that if glaive toss and bloodlet are going to be nerfed the real single target alternatives really need a little buff.",
					"Let's say we keep the changes like they are planned, aoe will come down, single target too, if we at least had competitive alternatives that purely work single target, such as Felblade, I at least would be much more comfortable looking forward to raiding some single target bosses.Another thing that popped to mind just now, it feels odd that taking demon blades is not that far from being competitive compared to prepared which takes alot of gameplay away from the player.",
					"I would be really sad if the go to choice would turn out to be letting auto attacks regulate your rotation.",
					"Demon Hunters were alot of fun until now, and i hope that together blizz and us can work this out.Great post OP, and keep up the spirit :)"
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"Not clued up on havoc, but check out Icy Veins Havoc.",
					"They'll give you a run through of all your talents and spells and stuff.",
					"Even at 847 ilvl, taking the wrong secondary stats can leave you doing the DPS of an ilvl 830.Also, you probably are...",
					"But spamm your keys when you're attacking.",
					"Don't wait for the Global Cooldown to end or for your button to become available, just keep pre-preemptively mashing that 2 button (or whatever) to get the cast off as soon as it's available.",
					"Milliseconds add up."
				],
				"Dungeon",
				0.0,
				"an",
				1,
				1
			],
			[
				[
					"I am actually genuinely curious, demon hunters are definitely edgy, but i am not sure if death knights are as well, since death knights can't help it, it's in their blood... demon hunters... on the other hand..."
				],
				"Dungeon",
				0.8503,
				"as",
				1,
				0
			],
			[
				[
					"16/09/2016 01:10Posted by Richarddhbloodlet is being replaced with the 106 talent  HavocTalents (1) Fel Eruption   Impales the target for (1050% of Attack power) Chaos damage and stuns them for 2 sec.",
					"Inflicts an additional 100% damage against targets permanently immune to stuns.Now requires Level 102, down from 106Tier 3 Talent, in place of  Bloodlet,  Gluttonyhttp://www.wowhead.com/news=255940/patch-7-1-ptr-now-live-build-22578-mounts-karazhan-bosses-ptr-patch-notes-music-This is datamining lol, its not even close to a valid form of confirmation on any changes.Many are speculating this is some sort of typo, and as i said, datamining means literally nothing at this point.Until it's on the PTR, this  is pretty much not happening.Not to mention if it did, Blizzard would be screwing up a big deal."
				],
				"Dungeon",
				0.0,
				"an",
				1,
				0
			],
			[
				[
					"22/08/2016 16:51Posted by GilromI only wish for one thing for DH now: To be able to use my wings as flying mount in areas where flying is allowed.I think the majority would.",
					":)But the Devs have said no to that.",
					"They things wings out all the time doesn't look good and doesn't fit the 'class fantasy'./rolleyes"
				],
				"Dungeon",
				0.0,
				"DH",
				1,
				0
			],
			[
				[
					"Despite lack of self-healing at level 100, people are underrating the DH's ability to avoid damage.Blizzard structured ability unlocks poorly for all classes, but DH feel it harder because they unlock abilities post 100."
				],
				"Dungeon",
				0.0,
				"DH's",
				1,
				0
			],
			[
				[
					"13/09/2016 17:12Posted by VilishrasGJ, but please dont drop all the info at once, just small clues a day would be perfect :)Oh god no, i can't handle that kind of teasing!"
				],
				"Dungeon",
				0.8581,
				"Oh",
				0,
				0
			],
			[
				[
					"04/11/2016 13:04Posted by SarthennisDH doesn't suck, in general, it depends on the person playing the character.Sure, there are other classes doing better overall, but you have to also realise these other classes have been around for years, collecting synergy with other classes in comps and over time gaining a lot of experience and tips.only the people behind the character can suck, not the class itself.Unfortunately, the majority of DH player base seem to not be doing very well.",
					"This would indicated something is lacking from our class, but don't expect it to change in the short term.",
					"Deal with what you have and make the best of it.If we dont say anything, nothing will happend"
				],
				"Dungeon",
				0.5182333333333333,
				"DH",
				1,
				0
			],
			[
				[
					"In PvP mage cc and damage has to be nerfedIn PvE mage damage has to be nerfedI've been waiting it since tBC but seems this game would die first than mages got into same line with other classes.DH is a brand new class and Blizzad put it into trash in just 1 month."
				],
				"Dungeon",
				-0.8608,
				"DH",
				1,
				0
			],
			[
				[
					"How about we start separating topics and not including everything in the same pot.This is a PVP related discussion, so put it in your effin thread title.",
					"I don't care about PVP, and I personally hope there will be no nerf to our damage just because some PVP related issues.",
					"I'm sick and tired of these endless PVP threads that imply it is a general direction for how the class should be.On topic: I entered a world PVP zone yesterday and some bored ( I assume ) Alliance ( my faction nonetheless ) casters tried to kill me, they did not met with success.",
					"This is as should be, since I am a tank."
				],
				"Dungeon",
				-0.520525,
				"as",
				1,
				0
			],
			[
				[
					"Since it's not possible to return to Mardum, is there really no way to get the items that you missed?",
					"I missed the 28-slot bag and the Inquisitor's Menacing Eye, which are probably the most useful items you can get in the zone.Sure, I could just buy Hexweave Bags, and there are other items that basically do the same thing the Menacing Eye does, but still... As a completionist, this is bugging the hell out of me since these are unique items."
				],
				"Dungeon",
				-0.6778,
				"As",
				1,
				1
			],
			[
				[
					"ok.so i have a very quick question..i know what i have to do to get the hidden artifact.but what i want to ask is if i must finish the dh campaign in order to be able to loot it.thank you in advance :)"
				],
				"Dungeon",
				0.5106,
				"ok.so",
				1,
				1
			],
			[
				[
					"Ok thanks a lot."
				],
				"Dungeon",
				0.6249,
				"Ok",
				1,
				0
			],
			[
				[
					"09/09/2016 07:10Posted by ElutheoneWhile I do like the momentum play-style most of the time I already forsee quite some troublesome times with some encounters that require very careful positioning.I fear this as well.There should really be a decent alternative to the Fel Mastery/Prepared/Momentum combo.I don't think Blizzard really thought this spec through."
				],
				"Dungeon",
				-0.5646,
				"as",
				1,
				0
			],
			[
				[
					"I would like to apologize for this 10 y/o behavior of a lesser warlock, i my self find DH deserve to have meta not warlocks, because warlocks DEMAND AND CONTROL demons they should have never fall/interact with the dark magic of demons blood, lore wise DH interacts woth demon bloods (main reason to cause the person to become meta), we warlocks comand them, the greatest warlock Gul'dan never drank the blood of a demon.All things aside i play both warlock and dh i quite frankly find them fun to play but im leaning to dh (play style not dps wise).",
					":)"
				],
				"Dungeon",
				0.63905,
				"DH",
				1,
				0
			],
			[
				[
					"Ive been testing and found a relatively strong build which is fun to play.",
					"[Blind Fury] with fel mastery changes this is a good option[Demon Blades] if you have high crit this is great with resetting felblade cd[Felblade] fantastic due to fel mastery changed this is a fury builder for us plus its a big dash like fel rush[Soul Rending] easy choice[Fel Eruption] This hits like a truck, 1.2 million crits[Demon reborn] works well with blind fury and demonic as you will eye beam before you metamorphosis[Demonic] Combined with blind fury is awesome"
				],
				"Dungeon",
				0.8210999999999999,
				"",
				1,
				0
			],
			[
				[
					"This is really annoying last time i got a worl quest with Havoc relic was 2 weeks ago and so far i got 2-3 world quest with DPS relic and while i am writing this i have 3 tank relic quests on my map and i already have 850 relic for my tank weapon.",
					"I never tanked in this game and i only used vengeance once for an hour while i was farming some high hitting mobs yet all world quest with artifact relics are tank ones.Edit: One of the 3 is attuned both weapons this is the only way i get my other relics for dps weapon."
				],
				"Dungeon",
				-0.7343999999999999,
				"an",
				1,
				1
			],
			[
				[
					"You must be new to this community, everyone does it.",
					"Have you even seen trade chat?But, on topic as you're asking for advice.I got this ring myself, the proc it gives with the 70% movement speed buff after CC'ing an enemy can be both your best friend and worst enemy.Let me explain what I mean.The ring is your best friend if you somehow get yourself into a corner of some sort, all from close to dying, to ganked by the enemy faction, you could (as you're running Havoc) throw Chaos Nova down and AOE stun whatever's hurting you.",
					"Thats when the ring procs and gives you the 70% extra movement for running away.The ring is your worst enemy in raids/dungeons.",
					"Being a raider myself Ive ran into problems becuase of the ring.Since we're both Havoc DH's we both can agree on that our DPS is based on mobility and movement, compared to Warriors who dont need this to throw their heavy dps out.In my own experience by the ring it threw me into problems at trash on the way to bosses in EN, accidently running into something becuase (in the moment) you easy forget that the ring has this specific proc.Also note, this is the WORST Legendary out of EVERYONE, sharing bottom place with Prydas (the neck).Lets be thankful its 1500+ of our best stat, Crit.PS; Too make up for my rude statement, rolling Prepared instead of Demon Blades can higher your DPS output, as it requires less mechanical use of Fel Rush."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"funny thing is, my usual DH tank is currently pushing 140k dps single target, and pulling something near 300-500k AoE, so honestly i dont know what you are complaining about.Hint : Haste is !",
					"@#$ for you at the moment later down the tier when you have 40% mastery(or more) 40% crit and most importantly at least 15% vers you can focus on reducing a CD to 10secs,(not that its needed imho)"
				],
				"Dungeon",
				0.5601,
				"DH",
				1,
				1
			],
			[
				[
					"Keep in mind the DH we are seeing currently are so far from complete.",
					"We still have like several tiers of talents to choose from, including Fel Blade and Fel Eruption and such things, making the rotation more meaty.I for one do like the synergy og demon blades.I personally find it refreshing to have a melee class, where the skill cap isn't nessesarily about being GCD capped, but utilizing the other tools you have, like your movement abilities, to improve your damage.Def.",
					"think Demon Blades should be kept in it's current form, making it viable and competable with the other choices, giving people a much broader choice of talents and playstyle to choose from."
				],
				"Dungeon",
				0.5206333333333334,
				"DH",
				1,
				0
			],
			[
				[
					"Got the same problem today, no mop bosses drops loot for me on my DH.",
					"It says in hotfixes it should be fixed now, but I killed Galleon 5 mins ago and still nothing."
				],
				"Dungeon",
				-0.7020500000000001,
				"DH.",
				1,
				0
			],
			[
				[
					"Tanks should do threat, not damage.Tanks doing threat through damage was the dumbest thing they ever  came up with.",
					"It's the main reason DK was so utterly, retardedly broken at the start of Wrath."
				],
				"Dungeon",
				-0.7433000000000001,
				"DK",
				1,
				1
			],
			[
				[
					"yo guys ı wanted to adress some  things about dh and learn wat you guys thinkso first thing is fel rush when you rooted if you use fel rush it still uses it but doesnt move so is it a bug or not, because ı think when you use fel rush when rooted fel rush shouldnt be used similar to wariors charge so if you spam it you dont move but you still have its cdsecond thing is sometimes when ı use fel rush it suddenly stops moving ı need to press forward key again to move it did you guys experienced something like that?and the third thing it is not a bug but ı want to learn your guys opinion about it.",
					"Do you guys think metamorphis supposed to be in global cooldown?",
					"ı feel like it slows down the dhs fast pace gameplay."
				],
				"Dungeon",
				0.0,
				"dh",
				1,
				0
			],
			[
				[
					"Hello all so im going with a DH tank spec as my main for legion liking alot of the gameplay but i have alot of doubts as far as professions atm.I would like to take enchanting but in doubt as the second profession...maybe LW or alch?what are ur thoughts and opinions...And sorry bad writing as english is not my main language"
				],
				"Dungeon",
				-0.7992,
				"DH",
				0,
				0
			],
			[
				[
					"11/08/2016 14:00Posted by GilromBeing mediocre does have its advantages I agree.",
					"For instance, we won't get nerfed nearly as much as DKs were.This is a nice advantage, I remember playing DK back in the days, and every month there was a new nerf T_T"
				],
				"Dungeon",
				0.6466000000000001,
				"as",
				1,
				0
			],
			[
				[
					"This happened to me once, and I've been playing DH since its release...",
					"It's not a very common issue believe it or not, positioning and awareness are part of the class, practice makes perfect my good friend :)"
				],
				"Dungeon",
				0.5588,
				"DH",
				1,
				0
			],
			[
				[
					"Hi Just want opinions on the state of DH tanks runing Mythic + runs!Ive heard they are very good thats all basicly!Cheers"
				],
				"Dungeon",
				0.6221,
				"DH",
				1,
				1
			],
			[
				[
					"It's terrifyingly fun.",
					"I did the first couple of levels as Havoc because I figured I'd be DPSing a lot at endgame, but dear lord I felt fragile.",
					"Mobile as anything, but fragile, especially since I've been spoiled with all the self-healing that DPS specs don't have any more.",
					"I'm sure that with perfect play one can faceroll half a dozen guys at once on Havoc, but as a less than perfect player I am grateful for my spikes, self-heals and general refusal to die."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"Kinda agree,I felt really ok in open pvp and pve as vengeance, but in BG i just got melt.",
					"Also i Am r36 honor so i've unlocked almost every pvp talent.For arena and bg, i just go back as havoc, sure I die just as fast but i Can dish three times the damage i did as vengeance before dying.But as Havoc ppl are really exegerating, i melt everything but Frost mage/Huntard/demonist.",
					"If you lose every match up you encounter, you are doing it wrong"
				],
				"Dungeon",
				0.0,
				"ok",
				1,
				0
			],
			[
				[
					"You guys should actually try raiding with this... how can you justify bringing a DH to a raid who does 30-40 % less ST than other classes in equal gear?",
					"I can understand the need to nerf our AoE, but our ST?",
					"and we haven't been given an alternative by this nerf, since felblade and first blood are equally crap.",
					"And Demon reborn / Unleash fury are extremely weak as it is.",
					"so basicly it doesn't matter what we do, we're forced to go for Master of the Glaive in that tier, and thus we might aswell keep Bloodlet to make it somewhat useful.",
					"They should add something to the other tier 6 talents, to make a viable alternate spec."
				],
				"Dungeon",
				0.0,
				"DH",
				1,
				1
			],
			[
				[
					"Hi Liradormi.",
					"My honest advice?",
					"don't give up.",
					"Especially because of a few unforgiving, mentally-immature players who kicked you.",
					"Easiest way I can describe how you can do decent damage, without typing toooo many paragraphs of every detail, is something like this... Fel Rush is your friend.",
					"I see you're using Fel Mastery talent, great.",
					"You want to use that pretty much all the time (but position it right so you don't aggro other mobs or fall off platforms, etc) especially after using Vengeful Retreat (go for the 2nd talent \"Prepared\" so that you generate Fury after using Vengeful retreat in the area of an enemy mob/boss, then Fel Rush back to it.)",
					"Try and keep your Bloodlet DoT up with your Throw Glaives.Obviously Demon's Bite to generate Fury and then Chaos Strike like crazy, mainly on single targets, unless your artifact weapon has unlocked the 'Inner Demon' trait which will have a chance to cause some nice, free AOE damage when you Chaos Strike.",
					"But you want to be using Chaos Strike more than anything on bosses/single target adds.",
					"And a Blade Dance on that AOE pack of mobs, along with Eye Beam (even on bosses.)",
					"The artifact trait which leaves a short DoT from Eye Beam, helps.",
					"Fury of the Illidari is a really strong AOE when combined (procs/cds before using it, ofc) with CDs like Chaos Blades and a Trinket (agility increasing procs, etc.)",
					"You don't even need to bother using Momentum, you could just use Fel Eruption and with enough crit/agility & damage-increasing CDs like Chaos Blades etc, your Fel Eruption can crit 2mill+ on bosses, easily.",
					"It helps in dungeons since the fights don't last that long, even in mythics.",
					"Momentum is more of a raid talent in my opinion.",
					"I was testing it out in mythics last night, it's overrated.",
					"It would be nice in a long raid encounter though.The best use of Metamorphis, is to use it with Chaos Blades and trinket procs.",
					"Bloodlust/Heroism is amazing with it, too.",
					"I'm not including potions because I don't use them, unless I was doing hard raid content.",
					"That's.. pretty much it?",
					"I guess.",
					"Sorry if this looks sloppy and stuff, I'm kinda rushing.... but don't give up!",
					"it's really easy and fun, just keep at it."
				],
				"Dungeon",
				0.0,
				"an",
				1,
				0
			],
			[
				[
					"It had to happen buddy, they did the same with us DK's being the first hero class and all they made us all powerful promoted the new expansion promoted our different gameplay mechanics then about a month later smacked us down to be a normal character, and let's be honest being over powered is cool but then we do use it to our advantage,  the amount of times I was world questing only to have a dh come along with there super  speed and strength wipe out the whole mob leaving me there wondering what the hell just happened.",
					"So on terms of gameplay mechanics it was just far to much in the dh favor, this makes it more balanced and in a sense gives us normals a chance."
				],
				"Dungeon",
				0.7493,
				"DK's",
				1,
				0
			],
			[
				[
					"I had guildies craft me the bracers with mats I'd gathered (as skinner/miner), and just did the oblit forge quest, which rewarded one obliterum.",
					"Bit of a hassle, but since the reward for doing it was what I needed, and I unlocked the forge thingie, /shrug"
				],
				"Dungeon",
				0.6083000000000001,
				"as",
				1,
				0
			],
			[
				[
					"only as gap closer/\"move away from others\" or through a group of mobs when you have nothing else to use.on boss fights you might as will pour cement on your feet."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"29/08/2016 21:38Posted by Zardu29/08/2016 21:33Posted by Sliske...Titling your bloody thread \"PLEASE FIX THE CLASS BEFORE IT IS TOO LATE\" isn't doomsaying or anything.And its NERF N.E.R.FAnd since you clearly do not pvp or follow pvp at all, it was a stat template nerf, these will be changed VERY regularly.",
					"The entire reason they exist is because of how freely they allow devs to balance regardless of pve.So yes, of course they will nerf them in pre patch and keep it for 110, because we did too much dmg in pre patch and still do in pvp.DH damage is insane.It is to late, how many DH do you see, this is pre patch, legion launches in a few hours and the DH seems to be the least played class and is the newest... why because we suck badlyAlso Battlegrounds are pvp... or am i missing that its player v playerAnd most people who beta the class have all said it doesnt get any better at 110 unless you have a healer up your !@#$1.",
					"Most players are terrible2.",
					"This is a team game3.",
					"1v1s do not matter"
				],
				"Dungeon",
				0.0,
				"DH",
				1,
				0
			],
			[
				[
					"To be fair, I haven't tried using meta, I've only used demon spikes and I don't bother using Fiery Brand as it only goes to one target.",
					"I was thinking about moving my talents around.",
					"You should really really really use Metamorphosis often in Mythic, I even macroed it with Healing Potion to be an upgraded \"oh sh**!\"",
					"button.Completed 3 Mythic Dungeon today and used at least 13-14 Metamorphosis, only twice on a boss the rest on trash, never died before the rest of the party.Get the Soul Rending instead of Feed the Demon, 50% Leech can heal you a lot, and remember that Last Resort does not share Meta cd and it can proc during meta to refresh its duration.Anyway as other suggest, try to CC as possible, don't pull tons of mob."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				1
			],
			[
				[
					"Just for passive bonuses one can enjoy without having to do any farming I just recently switched to Engi/Alchemy.",
					"Prior to that i had enchanting to DE all the gear, but with Chaos Crystals being worth ~100g now I think it has lost its edge over the other options.Engi with the dalaran AH and fun utility (pair rocket boots with meta and fel rush with goblin glider since the blur fel rush cd nerf) and new Rechargeable Reaves Battery giving repairs for everyone in higher mythic+ and 2 hour flasks from Alchemy are unmatched for me.",
					"That said, i dont have a need for gold income but the flask uptime surely prevents me from spending more, im stable at a measly 200k gold and wouldnt need any more for anything."
				],
				"Dungeon",
				0.5854666666666667,
				"AH",
				1,
				0
			],
			[
				[
					"Oooo shows off those lovely muscles ((giss a flex))I like the minimalistic... as the saying goes... less is more :))))"
				],
				"Dungeon",
				0.743,
				"as",
				1,
				0
			],
			[
				[
					"TL:DR Sometimes picking up a soul refreshes the duration of old stacks, sometimes it doesn't.Painbringer: Reduces all damage you take by 3% for 4 seconds.",
					"5 stacks max.Back at launch I tested this on a dummy, and after a few tries with it, it was apparent how it worked.",
					"The buffs could stack, and although the timer on the buff showed the duration resetting, the older stacks would fall off.",
					"Think of each stack as its own independent buff.Here is a diagram of how it worked: http://i.imgur.com/K5hAtam.jpgRecently I saw a forum topic discussing how Painbringer worked, and a few people were saying it worked differently; picking up another soul would reset the duration of every stack.Here is a diagram of how they said it worked: http://i.imgur.com/xOfXyrR.jpgHaving not read anything in the patch notes since launch, I believed they were wrong because I had tested it myself, but decided to test it again anyway just in case.The results are: Painbringer is bugged.",
					"~80% of the time the duration of previous stacks reset, 20% they didn't.",
					"Sometimes it even did an odd mix where I would pick up 5 souls in 1 second increments, and the buff would go up to 5 stacks, then fall down to 3 (instead of staying at 5 or dropping down to 1).I am unsure of how the stacks are meant to behave, but I'm certain they aren't meant to work inconsistently.",
					"The bug can result in a tank taking up to 12% less (or more, whichever way you look at it) incoming damage."
				],
				"Dungeon",
				0.0,
				"old",
				1,
				0
			],
			[
				[
					"Seems like it makes sense, since it's only valid in PVP instances and not world PvP.However, it used to only be greyed out and still keep its place on your bar.If it's completely removing each time, i'd report it as a bug.",
					"Indeed, sounds annoying.",
					"I won't find out till i lvl up this evening and try it out."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				0
			],
			[
				[
					"i start playing as Demonhunter  20 day ago and it was amazing but now after that noob nerf its really bad i think blizzard does not no what they are doing the class hitted hard and harder now no one want to take DH for raid or maytic + dungeon blizzard must fix that again omg what have you done he is doing 50% less damage this is #$%#@."
				],
				"Dungeon",
				-0.6169,
				"as",
				1,
				1
			],
			[
				[
					"today i log 3 times on my dh diffrent times for a 2-3h i spended searching for a rean 3s NO ONE WANTED ME i am 1700 2s 1850 3x with 1998 exp this sesson AND NO ONE WANT ME IN 3v3 help bllizard?help wow comunity?"
				],
				"Dungeon",
				0.0,
				"dh",
				1,
				0
			],
			[
				[
					"Blades should not be a DPS loss.",
					"Maybe you were not used to timing Fury spending during Momentum windows and were too used to spending time building Fury with Bite?Maybe not but I couldn't make it work as I already said I'd get like maybe 2 or 3 abilities off and then have to sit there for like 2 or 3 seconds till I get more fury which results in me doing less attacks and therefore loosing dps.it's not that I don't know how to use abilities within the momentum window it's that I can't use abilities, because fury generates to the slowly under demon blades so I have no fury to spend, under demon blades I only seem to get fury like every 2 or 3 seconds or there about and that is way way way to slow.The only way I can see demon blades working effectively is to have massive amount of haste so you swing faster and therefore generate fury as fast as you spend it.although to be honest I just don't seem to perform well in general while I can aoe for between 200 and 300k, single target against bosses I only seem to get around 150 to 200k sometimes lower if the mechanics of the fight require a lot of running around but apparently I should be able to do more than that even with a relatively low gear score of 834.",
					"I know that part of that is due to not having as much uptime on momentum as I could have as well as forgetting to use glaives to keep the bleed ticking but performance issues are a subject for another topic.Although personally I'd prefer having momentum attached to something other then fel rush and vengeful retreat, to be fair I like the idea but in practice if you don't execute it to perfection then you get punished hard."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				0
			],
			[
				[
					"Hi Guys!I really feel you with the nerfs coming up to DH's.By any means I really don't understand what Blizz is doing to this beautiful Class.BUT:We have to take it, like it is.Unfortunate we can't change anything atm.Let the peasents that played DH only for the Numbers reroll to their loladins or Huntards or whatever.Let us stand together as a community, get back to the Round Table and do the Math again and PROVE those unworthy Raidleaders that we still KICK !",
					"@#!Guys were $%^-in Demon Hunters.We're Illidans trusted Warriors.Even if they take our Glaives, WE SACRIFICE ANYTHING!Now PROVE IT!Be an Illidari and bring death to our Enemies!"
				],
				"Dungeon",
				0.0,
				"DH's.By",
				1,
				0
			],
			[
				[
					"I don't have any first hand experience at 110 but looking at the talents and artifact etc, I'd say no not really.",
					"Demon Hunters seem to be a priority system class if you select certain talents you can have some good moves with big cooldowns outside of that the rotation won't really change from build fury with demons bite spend on chaos strike / blade dance and use fel rush off cooldown.But hey at least we have more buttons than BM hunters (despite that I still enjoyed BM before I started playing DH)"
				],
				"Dungeon",
				0.5022500000000001,
				"BM",
				1,
				1
			],
			[
				[
					"Sure, its like the DK's intro, you done it and you leave."
				],
				"Dungeon",
				0.5574,
				"DK's",
				0,
				1
			],
			[
				[
					"Can a DH kill a WW Monk?Never seen a fight between these two in Arena,anyone can share an info>?"
				],
				"Dungeon",
				-0.755,
				"DH",
				1,
				0
			],
			[
				[
					"Play the DH to most of its potential, and enjoy it- will get the damage number you enjoy in the end :)"
				],
				"Dungeon",
				0.836,
				"DH",
				1,
				1
			],
			[
				[
					"As a Warlock, I use Elixir of Detect Demon just for fun sometimes.And it looks like in Legion there would be 830 gear with tracking ability http://www.wowhead.com/spell=47524/sense-demons#used-by-itemAnd back to DH - maybe they've thought that Spectral Sight would be enough, but anyway, it's kinda strange that map tracking ability is present for Hunters..."
				],
				"Dungeon",
				0.6946,
				"As",
				1,
				0
			],
			[
				[
					"Hi guys,I would liketo main DH in Legion.",
					"I play with some friends who main lock and druid (resto/feral).Anyone of you played Lock&Dh 3s in beta and can tell if the comp is viable?",
					"I know there are some strong melee cleaves with DH but we usualy avoid brainless healer training comps ;)Also it would be cool to create a list of good arena comps for DH.",
					"Please share your experience :)"
				],
				"Dungeon",
				0.5934999999999999,
				"DH",
				1,
				0
			],
			[
				[
					"You know that on Creation there are some hair styles that do not show, unless you visit a barber afterwards.It may be possible that there are more options at the barbers... cannot make sure as I also wanted to go there because I could not choose the hair style (amongst other things) I wanted... PS: choosing the scaly body features/skin colors gives different face options than the other skin colors..."
				],
				"Dungeon",
				0.0,
				"as",
				1,
				0
			]
		]
	}
}