{"Death Knight": [["[Guide]Death Knight 101 (Updated for 7.03)", "22/05/2014 11:27", "Hakuteiken", "This if for all the really new Death Knights; my guide on the class overall. In this guide I'll be covering our resource system, what abilities you have, how they work and what they do. I'll also throw in some suggestions on gameplay that should make things somewhat easier for you.It's worth nothing that Death Knights, at lower levels, are ridiculously powerful which is a state of affairs I found to be really dull when leveling my latest Death Knight; it's not much fun when you're immortal and killing things with 2-3 attacks, but anyway, here goes.First thing's first; Resources-We have two different resources; Runes and Runic Power.We have a total of 6 runes which can be used for any attack that costs Runes; Obliterate, Howling Blast, Festering Strike, Marrowrend etc.-Runic Power is generated from used runes and the amount of runic power generated is based on the rune cost abilities, for example, Howling Blast cost 1 rune, and therefore will generate only 10 runic power, Marrowrend costs 2 runes and will generate 20 runic power.Pretty straight forward on paper. Now we get to how they interact with each other.Runes begin a regeneration cycle of no more than 10 seconds when used; Haste will decrease this time but not by much.If all 6 runes are used in succession, the first 3 runes to be used will begin their recharge, while the remaining 3 will not. The second set of 3 runes will begin their recharge only when the first set is completely recharged.There are certain talents and built in passive abilities to speed this process up; these talents and abilities differ from spec to spec.Blood - Soulgorge; consumes Blood Plague from everything in 30 yards to increase rune recharge.-Blood Tap; restores 1 rune per use, limited to 2 charges.Unlike Frost or Unholy, there is no passive ability that will assist the rune recharge time.Frost - Runic Empowerment; passive, has 1% chance per runic power spent to activate on Frost Strike. After some time testing, I've found it's about 50% chance (5 in 10 Frost Strikes).-Murderous Efficiency; using the Killing Machine effect has a 50% chance to to restore 1 rune.-Horn of Winter; restores 2 runes and generates 10 runic power.-Hungering Rune Weapon; Horn of Winter restores 2 runes and generates 10 runic power while Hungering Rune Weapon restores 1 rune and 5 runic power instantly and then restores runes and runic power every 1.5 seconds for 12 seconds.Unholy - Runic Corruption, passive, has 1.25% chance per runic power spent to activate, granting 100% rune regeneration for a short time. Requires Death Coil. After testing I've found that this works out that +/- 1 in 3 Death Coils will activate Runic Corruption.Abilities - How They WorkEach ability a Death Knight has has a rune or runic power cost. The following are abilities that cost only 1 rune and will generate 10 runic power per use.-Blood Spec:Heart Strike, Death's Caress, Rune Tap, Death and Decay (if talented)Note: Heart Strike generates 15 runic power.-Frost Runes; Howling Blast, Frostscythe (if specced),Remorseless Winter,-Unholy Runes; Scourge Strike (Clawing Shadows, talent), Death and Decay, Epidemic (talent), Outbreak, Chains of Ice, Defile(talent)The following cost two runes and will generate 20 runic power when used.-Blood Spec: Marrowrend-Frost Spec: Obliterate-Unholy: Festering StrikeUnholy retains Army of the Dead at a cost of 3 runes which generates 30 runic power.Runic Power - will activate Runic Empowerment or Runic Corruption via the use of Frost Strike or Death Coil respectively.-Death Coil; usable Unholy spec. It's a ranged attack with 30 yard range and costs 35 runic power. This will also restore 10 energy to your ghoul per Death Coil fired.-Frost Strike; exclusive to Frost spec, single target melee attack.Death Coil and Frost Strike are often best used when you're at, or approaching, 100 runic power, but are ideally used when spaced out across your \"rotation\" which brings me neatly to the next part of the guide.Abilities - What to use and WhenThis will require in-depth guides of their own but there are certain universal abilities you can make use of.-Anti-Magic Shell - use to soak high incoming magic damage; it generates runic power.-Icebound Fortitude - use when you're taking high damage or are about to, or to break and become immune to stuns.-Death Grip - when you need to close the distance to your target or interrupt a crucial cast. The adds on Kilrogg Deadeye is a good example of the uses of Death Grip-Wraith Walk - useful for closing distances and clearing root or slow effects.I'll be preparing basic guides for Blood, Frost and Unholy specs, but those aren't coming before Legion release.For now, as I said, this was meant to cover the very basics of the class for people who haven't played Death Knight before."], ["[Guide]Death Knight 101 (Updated for 7.03)", "22/05/2014 13:38", "Emilboc", "verry nice work! i hope u make a good guide for 2h frost dk, maybe a youtube guide, with stats , enchants, glyph s , best comps for 2v2, 3v3.. for PVP Great job!!!!!"], ["[Guide]Death Knight 101 (Updated for 7.03)", "22/05/2014 23:15", "Hakuteiken", "22/05/2014 14:38Posted by Emilbocmaybe a youtube guideI wish! Sadly my PC isn't hi-tech enough for me to have good FPS while recording.I've been more or less out of the PvP scene but I'll see what I can do; will take some time though :D"], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 05:28", "Néró", "Please never use CLC for your ability maximisation, ever.  Not only will it often make bad decisions for you, it allows you no room to grow so even as a beginner's tool it's degenerative at best.  There's really only one way to master a spec: Spend days in front of a training dummy.  If you are new, spend an hour reading, then several more practicing; there's no shortcut.I didn't see a mention of the of AMZ and how it interacts with our abilities and our stat weights.  AMS soaking is literally the most important skill in the development of a DK player, giving about an equal boost to Frost and Unholy.  I would have liked to see it highlighted in the guide and specifically how it devalues our haste rating, and why if you simply refuse to use it (there are some out there), you're actually supposed to reforge and gem into haste up to one of the GCD breakpoints.  Maybe leave out the /cancelaura macro for newbies though, they can browse the EJ thread for that later.Addons deserve a mention too I suppose.  A good runic power tracker, decent visible rune trackers and DKDiseases, which is an absolute requirement for Unholy and to an extent Frost for the icon that monitors Soul Reaper.Maybe also give a brief shoutout to Festerblight if a new player comes back here to see where they should advance to when they have the basics down.  Even though Tricks was nerfed and we no longer have Fether, FB still has its place on certain bosses."], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 08:17", "Hakuteiken", "Thanks Socratex for your suggestions. I've made a note of them; I was pretty close to the character limit on the OP as it was so those will be guides for another day. 23/05/2014 06:28Posted by SocratexPlease never use CLC for your ability maximisation, ever.I recommended it for beginners until they're more familiar with how their spec works. That's how I did it, and it worked out well for me.Your point about AMS soaking is a good one but delving into stat weights and scaling and GCD breakpoints might seem highly complicated and intimidating to the person starting a DK for the first time. Just keeping it simple; guides for another day, though honestly, I don't worry myself too much with that sort of thing in my own game play. It's enough to know the stat priority and how to optimize reforges and gemming.23/05/2014 06:28Posted by SocratexAddons deserve a mention too I suppose. A good runic power tracker, decent visible rune trackers and DKDiseases, which is an absolute requirement for Unholy and to an extent Frost for the icon that monitors Soul Reaper.Okay, so you said not to use CLC DK but you want addons for stuff that you can do yourself if you keep your eyes open? Sorry, it doesn't make much sense. CLC DK will track all of the above for you and suggest an ability to use based on available runes, runic power, buffs and procs. It's a pretty good addon and it only gives suggestions; it's not meant to replace a person's own initiative."], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 15:05", "Kyuubi", "Fantastic work really. I go on dk forum regularly waiting for your posts about dks. They are extremely helpful but one day I see you making a whole guide topic. I jumped from joy when I saw it.Expecting to see Unholy guide though. I really hate frost sorry. Also if you decide to make a youtube channel. I will be your first sub :) Cheers ^^EDIT: Sticky requested!"], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 15:49", "Takralus", "Lovely guide, thanks Hakuteiken!"], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 16:02", "Néró", "Well, with addons and and UI in general, you always walk the fine line between tracking useful information in an intuitive way that lets you make intelligent decisions, and setting up a pseudo-auto pilot.  Afflic locks fall into the latter IMO, and end up just staring at their bars the whole fight.Tracking your blood tap charges, your runes, runic power, your available buffs, the strength of your diseases as Unholy ect, allows you to have all the info you need to hand, with the decision down to you of what to press.  CLC technically just provides suggestions of useful abilities, but I imagine if I was new, I'd just the suggestions as the gospel 'correct' answer.  I suppose using the Soul Reaper icon from DKDiseases as Frost is the closest thing to a CLC addon, but really, who when the boss reaches 35% is going to open their character sheet, make a split second mental note of their AP and Wep damage and quickly work out (((Weapon min damage + weapon max damage)/2) *1.3 + (2.4 *(X/ 14)))*1.15*1.04*0.68 + (60000 +1.2X)*1.15*1.05 < (499 + 0.8487X) * 1.10*1.05*1.15 *Mastery value to know if they should use SR?  We have to use the tracker for this because it's broke on Blizz's end.Also, if you can get all the info you need to play a DK to a decent standard from that abysmal standard UI, you're a damn better player than me.  Especially the rune tracker that hasn't been updated even after the 6 rune system finished."], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 16:12", "Hakuteiken", "23/05/2014 17:02Posted by SocratexI'd just the suggestions as the gospel 'correct' answer.Fair point but I should point out that the newer versions of CLC DK allows you to add or remove abilities within the \"rotation\". I can have it add Empower Rune Weapon for me if I want to, Outbreak, Death and Decay. I can even set it to Festerblight rotation for me if I want.23/05/2014 17:02Posted by SocratexAlso, if you can get all the info you need to play a DK to a decent standard from that abysmal standard UI, you're a damn better player than me.Haha! When I'm not tanking on in arena or RBGs I have myself set as focus which helps me track my buffs; also I use ExtraCD which tracks the cool down of my trinkets and legendary cloak allowing me to align my cool downs for when everything is up. I used to do that by following my buffs on the focus frame but ExtraCD makes it so much easier and streamlined; don't have all the other buffs clogging up my view. Other than that I have no UI modifications.23/05/2014 16:05Posted by EronekoExpecting to see Unholy guide though.Already working on it :P23/05/2014 16:49Posted by TakralusLovely guide, thanks Hakuteiken!Many thanks :) I have achieved greatness!"], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 17:31", "Néró", "I guess we have very different ideas of what easy and streamlined are.  Having to look in opposite corners of a monitor for info that I need to hand all the time (BT charges, runes), is so backwards to me.This is what I use:  http://i.imgur.com/FBpCEKq.jpg?1For all the other buffs, well I can't think of more important info to be tracking to really max out your playstyle...  What separates an OK player from a really good player comes down to buff tracking alone imo.  How on earth do you time PoF and ideal ERW? GEV MAI UR SECRETZ!  I'd not track the metagem or legendary procs ofc; they're so passive and proc so often they're not part of any meaningful decision making process, and I don't track it on any of my chars.And for the customisation of CLC, I still worry that new players would only play with the custom settings after some time when the damage is done and the bad habits are set...  I just had a play with it now and it recommended PS over HB on Garrosh with the P1 adds, just because my main target (the Wolfrider), had no Blood Plague.  It was also recommending pestilence for some strange reason.  I still think it has no place for DKs and should be avoided like the plague (pun totally intended!)."], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 18:28", "Hakuteiken", "23/05/2014 18:31Posted by SocratexHow on earth do you time PoF and ideal ERW?I hit Pillar of Frost when one or both my trinkets proc and really just do DPS as normal from that point on and if I'm running low on both runes and runic power with some time on Pillar of Frost and trinket procs I'll use Empower Rune Weapon to maximize my DPS.Here's what my interface looks like. http://i.imgur.com/YnMqMSs.jpgBehind the character screen is my target frame. Focus frame shows my buffs and debuffs, I can track my runes and runic power with the player frame there and I also made a script to increase the size of the runebar. /run RuneFrame:SetScale(1.0) ;RuneFrame:SetPoint (\"CENTER\", -168, -38)Be careful with the values for positioning there."], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 18:59", "Néró", "As unholy with nothing to track the power of your diseases and when to reapply strong DoTs?  Kiss goodbye to 30-40K DPS.Download DKDoTs or DKDiseases and you'll see a strong increase for PvE, possible also PvP if you take the Glyph against a FC or something.  You'd be surprised of the best times to reapply; it's not just when trinks proc.Have to agree with ERW as DW frost.  For 2H and Unholy, substantially more DPS to blow everything, spam away resources and pop ERW near the start so you can use it 3 times rather than 2 over a fight (I forget the % increase, Mendenbarr mentioned something about having a spreadsheet on it in Acherus a while back).  This is why TMW and WA2 are important addons, because they can give you an advance time countdown (which pops if you tell it to) for when PoF and similar CDs are coming up, so you can do a resource dumb just as Raise Ghoul and PoF are about to be available to line them up with a nice ERW.EDIT: Can you post a pic in combat?"], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 19:02", "Hakuteiken", "23/05/2014 19:59Posted by SocratexAs unholy with nothing to track the power of your diseases and when to reapply strong DoTs? Kiss goodbye to 30-40K DPS.I just reapply dots with Outbreak when trinkets proc. Plague Leech is a great help there because you can purge your dots and then reapply the stronger ones."], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 19:24", "Néró", "That's just not how Unholy's optimised.  Disease gaming is a major factor in our damage and you need tools to help you decide when to reapply and when NOT to PL.  Like I said,23/05/2014 19:59Posted by SocratexYou'd be surprised of the best times to reapply; it's not just when trinks proc.I'm not understanding how less disease information is boosting your DPS."], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/05/2014 23:40", "Hakuteiken", "I'm doing an in-depth look at the intricacies of Unholy for the guide I'm working on so I'll have to get back to you on this.The guides I make regarding each spec are, for the most part, based on how I play the spec. This is going to sound really arrogant and cocky, but putting PvP aside I've never met a Death Knight who could out-perform me as Tank or DPS in raids where our gear level was even so clearly I'm doing something right."], ["[Guide]Death Knight 101 (Updated for 7.03)", "24/05/2014 01:29", "Néró", "It does; beating mid level players 20 ilvls over you is trivial.Benchmark yourself against people like this instead:http://www.twitch.tv/arvbl"], ["[Guide]Death Knight 101 (Updated for 7.03)", "24/05/2014 09:02", "Hakuteiken", "I noticed a lot of new posts; people starting Death Knights for the first time an not knowing the first thing about them, how anything works or what anything does. The purpose of this OP was to provide the answers to the questions they ask as a way of helping them figure the class out.The OP certainly wasn't intended to showcase how great I am and so benchmarking myself against anyone is completely pointless. I don't play the class to the be the best, I don't make guides to pretend that I am the best, I don't play in such a way as to beat everyone on DPS or go out of my way to outperform people.I play the class because I enjoy it. It has been my favorite class for a very long time, and I wanted to share the knowledge I've picked up over the years, and so the guides reflect my way of playing. My way may not be the best way, or the right way and it certainly isn't THE way to play the class, but for beginners it's a start and that was the whole point of the post.I wish that someone had done something like this when I started this Death Knight, but as it is I had to learn the class 100% on my own which involved hours beating on dummies learning what abilities did what, how they affected runes and runic power; basically spending hours learning what I've posted here. It got much more painful when I ventured into PvP because no-one I knew knew anything about Death Knights in PvP and I couldn't find any decent guides. In a nutshell, I've been where newbie Death Knights are when they start and it's not a great feeling; this post was to help them out, not to compare myself to anyone else.I have made notes of the points you raised Socratex and will be addressing them in my spec specific guides."], ["[Guide]Death Knight 101 (Updated for 7.03)", "24/05/2014 17:43", "Néró", "There's no need to be defensive Hekuteiken.  You made the argument that you pull better DPS than any other similarly geared DK when I mentioned not tracking DoT power reduces DPS. Just know that if you're finding success as Unholy you're doing so in spite of your UI choices, not because of them.I really do think that any new player at 90 is no more than 30 minutes of practice away from learning how their DoTs work and how to track them.  Don't get me wrong I appreciate the goal to help but not highlighting the importance of DoT tracking is doing more harm than good for people just picking up the class.  It's not like they're learning snapshotting on a new boosted char or anything."], ["[Guide]Death Knight 101 (Updated for 7.03)", "25/05/2014 13:59", "Hakuteiken", "24/05/2014 18:43Posted by SocratexDon't get me wrong I appreciate the goal to help but not highlighting the importance of DoT tracking is doing more harm than good for people just picking up the class.Fair point, but DoT tracking or any form of DPS advice was not relevant to this guide. This was to cover the very basics; what the resources are, how they work, what abilities the class has, and how they affect the resources. It wasn't meant to go into actual game play."], ["[Guide]Death Knight 101 (Updated for 7.03)", "25/05/2014 21:45", "Rylaicrystal", "Thank you for this guide Hakuteiken, It was nice to read. I also wish if I read a guide like this when I started playing a Death Knight my self. I think it's a great starting point for a lot of new Death Knight. Keep up the good work :D"], ["[Guide]Death Knight 101 (Updated for 7.03)", "10/10/2014 22:13", "Hakuteiken", "I'll be updating this guide for WoD when I can."], ["[Guide]Death Knight 101 (Updated for 7.03)", "14/10/2014 21:18", "Hakuteiken", "Will be updating this for WoD thought in the PTR I haven't seen any major changes that are worth noting here. Update to follow :D"], ["[Guide]Death Knight 101 (Updated for 7.03)", "30/11/2014 12:25", "Hakuteiken", "For my Unholy guide which I've updated for patch 6.0.3 head over to this URL.http://eu.battle.net/wow/en/forum/topic/10831563820"], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/03/2015 15:41", "Belszazar", "Nice work. I just back to wow and wanna play my DK. Nice for refresh my mind, thanks. GOOD JOB"], ["[Guide]Death Knight 101 (Updated for 7.03)", "14/06/2015 22:29", "Hollowed", "Hakuteiken, can I have your btag please?"], ["[Guide]Death Knight 101 (Updated for 7.03)", "17/07/2015 10:39", "Hakuteiken", "Just wanted to post something quickly.This guide is still current. It covers the fundamentals on how Death Knights work which doesn't not change from spec to spec. I have posted other guides out there which didn't get stickies but still.The guide is up to date as of patch 6.2 and I will be updating it as the class \"evolves\"."], ["[Guide]Death Knight 101 (Updated for 7.03)", "19/07/2015 12:16", "Nicole", "This is really great! Brilliant job :)"], ["[Guide]Death Knight 101 (Updated for 7.03)", "20/07/2015 11:45", "Hakuteiken", "Thanks Nicole :D"], ["[Guide]Death Knight 101 (Updated for 7.03)", "29/08/2015 03:33", "Havoç", "watching Preach's old MoP tanking guide for this spec, I find it funny he says he enjoys the fact that it feels like this meaty dps goodness, yet now, in his \"I'm switching to tank\" video, he had this to say in his mid way look at tanking classes:https://www.youtube.com/watch?v=mIShYx4zHMYthe video above starts with the DK so just look at it, but it seems he has changed his mind about his feelings as to how the DK should play. he doesn't like that it feels like a dps that has aggro. he says it doesn't feel like a tank, unlike a warrior or a Paladin and even monk.he goes more in depth in this next video here: https://www.youtube.com/watch?v=v9tLd-DqiAEwhere he says why he picked the warrior. he was very close to picking the DK, it was his nr. 2 choice. but the reason he says he DIDN'T pick the blood DK is because he doesn't feel like a tank, which is completely the opposite of what he said in the MoP video, he said he loved the dps style of it.I however feel as he does, I like to feel like a tank and the DK doesn't do that for me. You might think the monk is the same way but its not. If I wanted the real classic style feeling, I'd go with warrior, which is joint nr. 1 for me along with this monk. I enjoy both quite a lot. So unless Legion changes gameplay considerably for the DK, Paladin and guardian, I'm gonna pick either the warrior or the monk as my main. I know the Demonhunter will be a tank too and I will try that as well, but unless demonhunter gameplay is super fun, I will be a monk or a warrior (unless, like I said the other 3 classes get overhauls). I'm currently in the process of giving all my characters decent gear for the start of the next expansion, don't wanna start out in ilvl 570 greens when you can get 650-675 gear for free now.so how about you, the DK community, do you guys feel like tanks or do you feel like a dps that has aggro (like the class was originally was designed as)??"], ["[Guide]Death Knight 101 (Updated for 7.03)", "11/09/2015 11:05", "Hakuteiken", "29/08/2015 04:33Posted by Havoçso how about you, the DK community, do you guys feel like tanks or do you feel like a dps that has aggro (like the class was originally was designed as)??When I play Blood I do feel like a tank. I've off tanked with Warriors and Paladins and I feel like I'm tankier; things that do immense damage to them barely seems to phase me and I feel super tanky because of I'm not nearly as difficult to heal."], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/07/2016 00:31", "Hakuteiken", "Updated for Legion pre-patch."], ["[Guide]Death Knight 101 (Updated for 7.03)", "23/08/2016 21:09", "Komenasai", "Looks pretty solid, certainly covers the basics to get one started."], ["[Guide]Death Knight 101 (Updated for 7.03)", "15/09/2016 01:09", "Deathmorning", "hello, as a level 60 peasant at the moment, im having trouble, you know how DK's have low mobility? (apart from maybe wraithwalk) how do i even mobility? like how do i survive and chase people as they seem to just kite and run away.....cant keep up with them"], ["[Guide]Death Knight 101 (Updated for 7.03)", "17/09/2016 17:17", "Larloch", "I can't seem to find the topic again. But i saw one, where blizzard said they wouldnt do class balance with the next patch (but if anyone can find it, please link to it. It might be because im on the eu, and can't seem to get to the over version of the forum). They are waiting for the data from the UPCOMMING raids etc. Nice to see that the underperforming classes are getting screwed over. Now they are in the situation that they might not get invited or get kicked, due to not being able to keep up with the other classes. Guess its our fault for picking a class we want to play, instead of one of the OP classes there is!!!"], ["Making a Guide?", "21/03/2014 16:01", "Takralus", "Here in the class forums, players often put together awesome guides to help the rest of the community. However, due to the high number of sticky request we receive each day, these guides sometimes fall off the front page before we can sticky them. If you have just posted a guide or if you’d like to nominate a guide here on the European forums to be stickied, please send an email to the Community team, including a link to the guide you'd like stickied, at: CMTeamEU-WoW@Blizzard.com Alternatively, guide writers can help us spot their threads by putting [Guide] in the title :)"], ["Frost and the reverse synergy", "29/11/2016 08:12", "Hehr", "Is there any other class that has reverse synergy between artifact traits and talents?Just look at Frozen Soul (gold dragon artifact trait) and Gathering Storm (tier 6 Frost talent)!One activates when Remorseless Winter ENDS and the other EXTENDS Remorseless Winter.It's not like the damage of Frozen Soul is enough to put me in the dilemma of having to chose between it and the talent.The reverse synergy bothers me. I'm OK with no synergy, but not OK with this.At least make Frozen Soul activate on a different trigger (5th tick, 2nd tick, 9th tick like the normal Remorseless Winter)"], ["Frost and the reverse synergy", "29/11/2016 09:52", "Drayiicha", "It's absolutely fine.Remorseless Winter is best used when you get the full use from it, as stated in guides. This doesn't change when you have the artifact trait, or rather, it's even more important to ensure it lasts the full duration. Why would you ever use Remorseless Winter when it isn't going to be effective for its entire duration?Similarly with Gathering Storm, you only choose this talent to counter ongoing AoE - if there isn't a situation for it, you don't pick it. Its a situational talent, which again, is fine."], ["Frost and the reverse synergy", "29/11/2016 10:41", "Hehr", "if you use both .... most of the enemies would have died until the Artifact trait activates.If they don't ... you're doing soemething wrong"], ["Frost and the reverse synergy", "29/11/2016 15:13", "Seretin", "It's just straight up a bad talent. Why would you ever chose Gathering Storm over Frostscythe? Gathering Storm is only good in insanely long AoE situations, which you usually don´t have, or atleast can´t guarantee to have. It also has no \"negative synergy\" with your artifact trait, because a longer remorseless winter gives you the opportunity to hit more targets (chain pulls in M+) which therefore increases the damage from Frozen Soul. Not hitting anything with frozen soul can happen, no matter if you have chosen gathering storm or not."], ["Frost and the reverse synergy", "29/11/2016 22:14", "Hehr", "29/11/2016 15:13Posted by SeretinIt's just straight up a bad talent. Why would you ever chose Gathering Storm over Frostscythe? Gathering Storm is only good in insanely long AoE situations, which you usually don´t have, or atleast can´t guarantee to have. It also has no \"negative synergy\" with your artifact trait, because a longer remorseless winter gives you the opportunity to hit more targets (chain pulls in M+) which therefore increases the damage from Frozen Soul. Not hitting anything with frozen soul can happen, no matter if you have chosen gathering storm or not.No!There is no scenario (if the tank and frost have the smallest trace working neurons) where more time will help increase the maximum number of targets hit with Remorseless Winter that will be hit with Frozen Soul.The effectiveness of Frozen Soul decreases as the duration of Remorseless Winter increases.The point of my post is not affected by player choice of using or not Gathering Storm (I use Attenuation). The point is that there is a talent choice where for one skill to reach maximum efficiency the other one must not and that is a problem."], ["Frost and the reverse synergy", "30/11/2016 07:17", "Rained", "You never realistically extend Remorseless Winter for long enough to be off cooldown before it drops. As such, you're not losing any Frozen Soul ticks.If you're complaining because you're doing open world content and mobs die before your Remorseless Winter ends, then why does it matter? Just let it drop off if you really want your Frozen Soul tick, since mobs will be dead anyway so there's no need to extend Remorseless Winter further.Honestly I thought this thread was going to be about Frozen Pulse when I read the title, because that's a legitimate concern due to how it conflicts with Empower Rune Weapon, Runic Empowerment AND Obliteration"], ["Frost and the reverse synergy", "30/11/2016 13:25", "Ikestius", "There isn't any reverse synergy. \"/cancelaura Frozen Soul\" works perfectly with this trait which allows you to release burst much earlier (and even instantly after using Remorseless Winter, not forcing you to end Remorseless Winter earlier). With this talent you will be seen only benefits. Most DK's doesn't know that this macro even exist, but this helps a lot on short AoE fights."], ["Bring back 2H-Frost DK... in an cosmetic way", "07/11/2016 19:59", "Aríon", "Hello fellow DKsIm frustrated. Since Legion beginning. Not only because DK was on bottom of the meters etc, NO. It's the fact that if someone wants to play frost... He have to take this non DK matching dual wield style... Just WHY? I saw last weeks ago a topic about \"Bring back 2H FDK\". Tbh i dont want the physical playstyle back from 2H FDK. It wasnt better in any way then the dw magic dmg playstyle. Maybe only against casters it was a bit effektive.Anyways. My thoughts about to bring back 2H-FDK was to give them a cosmetic way. I just cant play and take the specc serious with this DW style. Its just annoying... Pls if any def from blizz read this *cough* Bring it on the table. Give the option to mogg those 2 1hands into a 2H and some kinda frostmourne look alike artifact appearences. So everybody can chose how he likes it."], ["Bring back 2H-Frost DK... in an cosmetic way", "07/11/2016 20:39", "Ornstein", "+1An artifact skin.Preferably with a meaningful quest line.Rebuild frostmourne maybe."], ["Bring back 2H-Frost DK... in an cosmetic way", "07/11/2016 20:47", "Rooachîe", "Just make the Stage 2 Sword 2handed. oh gawd i would die for it"], ["Bring back 2H-Frost DK... in an cosmetic way", "07/11/2016 20:55", "Groggrogge", "Yes please blizzard, I hate the DW style on dk. It just dosent fit"], ["Bring back 2H-Frost DK... in an cosmetic way", "07/11/2016 21:19", "Antenora", "It can't be done.Animations etc.2H is gone just let it die already.If you have a !@#$% for 2H DK Gameplay then Blood and Unholy both exist."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 02:49", "Aríon", "Just say why it shouldn't be able? Blizz took the 2H style without asking. We just speak about a cosmetic way to make it into 2H or dw as ppl want.Animations arent hard. Take the 2H strike animation from UH or Blood (both the same) and its done.Ain't understand why ppl are against something like that and dislike. It doesnt hurt anyone and just give ppl their own choice which style they want to take. As it stands there: c o s m e t i cnothing more."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 04:43", "Berlag", "07/11/2016 21:19Posted by AntenoraIt can't be done.Animations etc.[/quote]BS. Can be done easily. All animations are in the game. Basicly it's just a \"if then else\" statement in the code. If weapon 2H then show animation id #whateverthef*ckitis\".For some strange reason people always try to protect Blizzard like every change is rocket science when it's not.btw and while we are on it, f*cking give us the option to hide them ugly Crystalline Sword. Oh and before you come up with \"not possible\"... Fire Mages can hide their balls. It's that easy."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 09:52", "Drayiicha", "It's gone, my friends. Got to let it go."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 11:43", "Dequé", "Don't let them in, don't let them see,Be the death knight you always have to be.AMS, Don't feel, Don't let them knowWell now they know...08/11/2016 09:52Posted by Drayiichalet it go08/11/2016 09:52Posted by Drayiichalet it goCan't hold 2H anymore.08/11/2016 09:52Posted by Drayiichalet it go08/11/2016 09:52Posted by Drayiichalet it goWraith Walk away and slam the door...."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 11:50", "Bloodweiser", "Agreed, if Paladins can have the Ashbringer we should be allowed to have Frostmourne.Simples."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 12:22", "Xyrosa", "I want this aswell. 2H skin but keep damage calculation like in DW.As for the tooltips of talents or artifact, when switched to 2H, instead of +10% damage to offhand, make it like +3% damage of total, something like that.No damage changes just tooltip changes."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 12:30", "Aríon", "08/11/2016 11:50Posted by BloodweiserAgreed, if Paladins can have the Ashbringer we should be allowed to have Frostmourne.Simples.Wouldn't go that far. Frostmourne is one of the most unique Swords on history. In the way of lore i heared it cant be reforged even when it aint got his power as it had ones.But ok... cuz of the ingame technic...Ashbringer was unique too. Only 1 ashbringer existed... now it exists 2-3 million timesBUT as i said a simular one would fit too. One that close looks like Frostmourne. Or something like the style. JUST not again a unstylish sword thats big from the start into the \"spire\"... Aint get why Blizz keep up doin unrealistic (in an unrealistic game ofc) ugly swords."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 12:32", "Aríon", "08/11/2016 12:22Posted by XyrosaI want this aswell. 2H skin but keep damage calculation like in DW.As for the tooltips of talents or artifact, when switched to 2H, instead of +10% damage to offhand, make it like +3% damage of total, something like that.No damage changes just tooltip changes.Dude, as i tried to explain. Its just cosmetic 2H then. Nothing changes. u still got both rune enchants and u still do the same like dw. u just got a 2h instead of 2 1hands. ... or keep 2 1hand up as everyone want to have it."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 12:53", "Necrofenix", "they dont want to, simple as that. they can come up with all sort of excuses to not do it and in the end wont.\"let it go, let it go\""], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 13:03", "Aríon", "cumminty > blizzbyside all spam holinka for his worse job u can spam blizz for positive things like this. it hurts noone. could be up even with 7.1.5 or lately 7.2 if its get heared.i know it seems like blizz ignores most of all forums but i dont think so. dont burie the hope. just try to get it on the table and we will see :)"], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 13:04", "Uruk", "Uruk Frosthoof approves."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 13:21", "Drayiicha", "It's simply not happening. Don't know what else to say. I'm neither for nor against it personally, but anyone holding out any kind of hope should accept that they will not be getting this and move on; to another class if they want to wield a 2 hander so badly - it isn't coming back to Frost."], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 13:29", "Aríon", "08/11/2016 13:21Posted by DrayiichaIt's simply not happening. Don't know what else to say. I'm neither for nor against it personally, but anyone holding out any kind of hope should accept that they will not be getting this and move on; to another class if they want to wield a 2 hander so badly - it isn't coming back to Frost.Damn, hope u aren't so negativ 24/7 personally. If blizz got members like u then my hope is gone ofc... :/"], ["Bring back 2H-Frost DK... in an cosmetic way", "08/11/2016 13:34", "Bloodweiser", "08/11/2016 12:30Posted by Aríon08/11/2016 11:50Posted by BloodweiserAgreed, if Paladins can have the Ashbringer we should be allowed to have Frostmourne.Simples.Wouldn't go that far. Frostmourne is one of the most unique Swords on history. In the way of lore i heared it cant be reforged even when it aint got his power as it had ones.But ok... cuz of the ingame technic...Ashbringer was unique too. Only 1 ashbringer existed... now it exists 2-3 million timesBUT as i said a simular one would fit too. One that close looks like Frostmourne. Or something like the style. JUST not again a unstylish sword thats big from the start into the \"spire\"... Aint get why Blizz keep up doin unrealistic (in an unrealistic game ofc) ugly swords.They could have gotten rid of dual wielding though, which I've never been a fan of as frost tbh.Then we could have just reforged Frostmourne and everyone (me) would be happier."], ["Bring back 2H-Frost DK... in an cosmetic way", "09/11/2016 12:58", "Boneflayer", "There's nothing worse than Frost Death Knight crybabies. DId you spend a moment thinking about how that will interract? As a Dual-Wielder you attack much faster, and most of your abilities hit differently with Main Hand and Offhand. For example Obliterate/Frost Strike deals 200k from MH attack and 140k from OHand attack.On top of that, how will you make the animations for auto-attack work when dual-wielding is using 2.60 weapon speed, and they are 2. You're going to swing your Sword every 1 second for an auto-attack?Sorry, but if you want a 2h spec you should switch over to Unholy."], ["Bring back 2H-Frost DK... in an cosmetic way", "09/11/2016 16:35", "Aríon", "dude. wtf...2 things that counter your post:1. main off hand dmg explained in a way that makes sense if 2h appearence was taken:- main hand dmg would be the swordweapon dmg and the off hand dmg would be a echo of the mainhand dmg.so that problem would be solved just if u think about it or blizz would change a little bit the tooltip if u need to have it2. frost dk is all about speed anyways so its ok if u strike with 2h fasten in a looking way then others or make it likei said in 1. JUST in an autoattack way. but still isnt really a big problemagain dont keep on holding back wishes from the comm that noone hurts and are positive for all. overall if its just cosmetic so u dont get chained on a look that someone decided for u even if it dont fits the class.AND stop the damn argument go uh or blood etc.. IF i want to play frost just with a 2h instead of dw style then i JUST want to play it with 2h style. same goes for monks who want staffs or polearms or fire mages who want staffs or upside frost mages that want to wear 1 hand and shieldhand."], ["Bring back 2H-Frost DK... in an cosmetic way", "09/11/2016 17:34", "Brootan", "+1Or atleast let the DK have them on the back while they are tucked away. Hate it how they stick out like to spikes out of your !@# atm."], ["Bring back 2H-Frost DK... in an cosmetic way", "09/11/2016 20:08", "Metallus", "Or maybe have back shadowmourne.To be honest, I liked the axe more :/, it felt more \"hacky\" and brutal."], ["Bring back 2H-Frost DK... in an cosmetic way", "10/11/2016 10:53", "Bloodweiser", "09/11/2016 12:58Posted by BoneflayerThere's nothing worse than Frost Death Knight crybabies. DId you spend a moment thinking about how that will interract? As a Dual-Wielder you attack much faster, and most of your abilities hit differently with Main Hand and Offhand. For example Obliterate/Frost Strike deals 200k from MH attack and 140k from OHand attack.On top of that, how will you make the animations for auto-attack work when dual-wielding is using 2.60 weapon speed, and they are 2. You're going to swing your Sword every 1 second for an auto-attack?Sorry, but if you want a 2h spec you should switch over to Unholy.You realise Frost was once a 2H only spec and up until the end of Draenor was playable with both 2H and dual wielding, right?And has anyone ever thought how it makes no sense for Frost to have so much speed with their attacks as well? I mean frost == frozen == slow in my mind."], ["Bring back 2H-Frost DK... in an cosmetic way", "10/11/2016 12:44", "Drayiicha", "No, not going to happen.It's dead, stop flogging it."], ["Bring back 2H-Frost DK... in an cosmetic way", "10/11/2016 12:51", "Necrofenix", "10/11/2016 10:53Posted by BloodweiserAnd has anyone ever thought how it makes no sense for Frost to have so much speed with their attacks as well? I mean frost == frozen == slow in my mind.actualy the original \"lore\" in wrath is that DKs leech the heat from their surroundings/victims to increase ur attack speed. this is even showed in the original icy talons talent which gave u haste when u put frost fever on anything.\"you leech heat from victims of your frost fever, so that when their melee attack speed is reduced, yours increases by 20% for the next 20sec.\"there is no heat or cold, only energy or lack off.they have keept this as passive haste and now in the new icy talons talent."], ["Bring back 2H-Frost DK... in an cosmetic way", "10/11/2016 23:59", "Cyrisela", "10/11/2016 10:53Posted by Bloodweiser09/11/2016 12:58Posted by BoneflayerThere's nothing worse than Frost Death Knight crybabies. DId you spend a moment thinking about how that will interract? As a Dual-Wielder you attack much faster, and most of your abilities hit differently with Main Hand and Offhand. For example Obliterate/Frost Strike deals 200k from MH attack and 140k from OHand attack.On top of that, how will you make the animations for auto-attack work when dual-wielding is using 2.60 weapon speed, and they are 2. You're going to swing your Sword every 1 second for an auto-attack?Sorry, but if you want a 2h spec you should switch over to Unholy.You realise Frost was once a 2H only spec and up until the end of Draenor was playable with both 2H and dual wielding, right?And has anyone ever thought how it makes no sense for Frost to have so much speed with their attacks as well? I mean frost == frozen == slow in my mind. for frost i think more of frozen/icy winds of northrend. In wod 2h frost could be played but for most part of expansion it was worse then dw by quite alot. Personaly i prefer dw for frost, but wouldnt be against 2h as cosmetic for frost if UH gets dw cosmetic."], ["Bring back 2H-Frost DK... in an cosmetic way", "11/11/2016 08:02", "Exeetor", "WTB artifact \"Use Skill\" named Shadow of FrostmourneCombining both swords into a ghostly 2 handed \"soul version\" of frostmourne with the effect:The Shadow of Frostmourne steals the souls of the victim with icy Cold Death adding extra Frost Damage to all your attacks.This attacks makes the weapon a 2 handed during the duration.Would suit the frost theme so well. And it would make Oblit. scale better with mastery aswell. AND it would be sooo cool to have some sort of Connection to frostmourne aswell!"], ["Bring back 2H-Frost DK... in an cosmetic way", "11/11/2016 11:10", "Exemplis", "08/11/2016 04:43Posted by Berlag07/11/2016 21:19Posted by AntenoraIt can't be done.Animations etc.BS. Can be done easily. All animations are in the game. Basicly it's just a \"if then else\" statement in the code. If weapon 2H then show animation id #whateverthef*ckitis\".For some strange reason people always try to protect Blizzard like every change is rocket science when it's not.btw and while we are on it, f*cking give us the option to hide them ugly Crystalline Sword. Oh and before you come up with \"not possible\"... Fire Mages can hide their balls. It's that easy.[/quote]Like the man said, 2H FROST IS DEAD. Has been since legion launched and since they announced in wod, get over it and play blood or UH, shhh"], ["Bring back 2H-Frost DK... in an cosmetic way", "11/11/2016 12:19", "Valdreth", "Removing 2-Handed frost and not giving them Frostmourne... well let's just say that it was a missed opportunity that I still can't quite fathom on Blizzard's part. Their original argument as to why Frostmourne couldn't be in the hands of players was that it was \"too powerful and important in the lore\" to make sense.Skip ahead to Legion in which every class and spec is wielding powerful and important weapons. Retribution paladins even wield the sword that destroyed Frostmourne in the first place.To me personally, it's also a matter of class fantasy. Yes, that thing Blizzard threw around as a buzzword since Gamescom last year. A frost DK is in terms of visual style somethin akin to Arthas or Baron Rivendare - a heavily armored knight with a massive runeblade. Being given two embarrasingly small blades to wave around just made me feel like a rogue in armour whenever I played my DK in Legion. Yes, past tense. I quit my DK because of this design decision. It might sound amazingly superficial - and it might indeed be true - but the look and feel of my frost DK was completely changed for the worse in Legion. I don't much care for tanking so Blood was out of the question, and it's much the same with pet classes/specs, so Unholy was also off the table.Whew. That turned into a bit of a rant. I guess I'd like to see 2-Handed frost being given back to us and, hell, why not give us a quest to re-reforge the Blades of the Fallen \"Meh\" into their original Frostmourne form?"], ["Bring back 2H-Frost DK... in an cosmetic way", "11/11/2016 17:34", "Wraith", "I am all for this. I have never been a fan of dual wielding.Two handers all the way!So yes, please, give us two handed back, even if it is just cosmetic."], ["Bring back 2H-Frost DK... in an cosmetic way", "11/11/2016 19:00", "Jesi", "08/11/2016 12:30Posted by Aríon08/11/2016 11:50Posted by BloodweiserAgreed, if Paladins can have the Ashbringer we should be allowed to have Frostmourne.Simples.Wouldn't go that far. Frostmourne is one of the most unique Swords on history. In the way of lore i heared it cant be reforged even when it aint got his power as it had ones.But ok... cuz of the ingame technic...Ashbringer was unique too. Only 1 ashbringer existed... now it exists 2-3 million timesBUT as i said a simular one would fit too. One that close looks like Frostmourne. Or something like the style. JUST not again a unstylish sword thats big from the start into the \"spire\"... Aint get why Blizz keep up doin unrealistic (in an unrealistic game ofc) ugly swords.1. summon Chromie2. travel in time3. kick Tyrion in the face at the top of ICC4. steal Frostmourne5. return to your time6 stab Chromie with Frostmourne ( cmon! please? )"], ["Bring back 2H-Frost DK... in an cosmetic way", "12/11/2016 03:21", "Aríon", "11/11/2016 19:00Posted by Jesi08/11/2016 12:30Posted by Aríon...Wouldn't go that far. Frostmourne is one of the most unique Swords on history. In the way of lore i heared it cant be reforged even when it aint got his power as it had ones.But ok... cuz of the ingame technic...Ashbringer was unique too. Only 1 ashbringer existed... now it exists 2-3 million timesBUT as i said a simular one would fit too. One that close looks like Frostmourne. Or something like the style. JUST not again a unstylish sword thats big from the start into the \"spire\"... Aint get why Blizz keep up doin unrealistic (in an unrealistic game ofc) ugly swords.1. summon Chromie2. travel in time3. kick Tyrion in the face at the top of ICC4. steal Frostmourne5. return to your time6 stab Chromie with Frostmourne ( cmon! please? )Tbh, that would be a up to date explaination and sounds like blizz. But i thought more about if it really goes to frostmourne like \"echo of frostmourne\" its the sword itself, but nomore that overpowered like it was once. still one of the most powerful weapon but nomore the... lets say classcarrier. Still just a thought. I wouldnt say no to it. just btw blades of the fallen king are currently created by pieces of frostmourne. It wouldnt be that unrealistic to reforge it in the current way"], ["Bring back 2H-Frost DK... in an cosmetic way", "13/11/2016 08:30", "Hvorgandr", "I want to get a 2H weapon which barely looks like a Scythe derivated from the Frostmourne itself. And let me tell you why Frost Death Knights should have a scythe instead of 2 punt swords:1. First of all, Scythe impersonates and represents the death, desolation, and cold frigid crypts six feet under the ground. This scythe reaps the fallen foes with its frost existence, and scatters the bonds of enemies lives. 2. Frost DK's are both magister and a fighter. In this cold combination, it requires a both magistrate derivated staff with a cutting edge. Blue, gray, black themed colours mixed with skulls, sharp edges and fine curves, socketed onto a great horrifying hilt. 3. This weapon could allow us to obtain dual runeforges or having a single runeforge which can be obligatoryly Razorice and such traits that would not make us feel the absence of Fallen Crusader. 4. Even, there is an instant artifact skill called \"FROSTSCYTHE\" Unlike current one, this one has greater radius and instantly applies 5 stacks of razorice to enemies who were hit by this Frostscythe. 60 seconds of cooldown with a decent or appropriate damage. 5. Especially, howling blast's skill animation could be better with that scythe. Player holds its scythe towards the enemy and casts Howling Blast. As I said, Frost DK is a combination of Outlaw Rogue and Frost Mage with colder appearance. At least, from shards of Frostmourne, this Scythe called Soulreaper would not be the waste of Frostmourne's broken shards.  About autoattack, main stat should be haste with a better multiply. This weapon even has basic stats which is mastery and haste. Traits should contain such things that increases attack speed and better runic attenuation from FDK talents. The things I said is not difficult, it is just simply requires Blizz's effort. #MakeFDKsGreatAgainPS: you can be salty about scythe because afflis and balances use it, so what then. Why not for FDK?"], ["Bring back 2H-Frost DK... in an cosmetic way", "27/11/2016 04:06", "Aríon", "lè push up"], ["Bring back 2H-Frost DK... in an cosmetic way", "29/11/2016 10:13", "Drayiicha", "Let it goLet it goooo"], ["Bring back 2H-Frost DK... in an cosmetic way", "29/11/2016 10:58", "Uruk", "I won't let it go, that's why I play 2x2H frost."], ["Bring back 2H-Frost DK... in an cosmetic way", "29/11/2016 14:20", "Hakuteiken", "07/11/2016 19:59Posted by AríonTbh i dont want the physical playstyle back from 2H FDK.You mean the play style DW currently enjoys?07/11/2016 19:59Posted by AríonI just cant play and take the specc serious with this DW style.It's still the 2H play style from antiquity.08/11/2016 09:52Posted by Drayiichalet it go.https://www.youtube.com/watch?v=L0MK7qz13bUYes I should feel bad for that; #sorry #notsorry08/11/2016 11:50Posted by BloodweiserAgreed, if Paladins can have the Ashbringer we should be allowed to have Frostmourne.I made peace with not getting Frostmourne, but honestly I'd have preferred 2H Frost with Frostmourne than what we have now.That's not to say there's anything wrong with what's current; it's just not my preference."], ["Bring back 2H-Frost DK... in an cosmetic way", "29/11/2016 14:35", "Jeysbane", "08/11/2016 09:52Posted by Drayiichalet it go.https://www.youtube.com/watch?v=L0MK7qz13bUYes I should feel bad for that; #sorry #notsorry.https://www.youtube.com/watch?v=6fZwJFjiA0A dis"], ["Bring back 2H-Frost DK... in an cosmetic way", "29/11/2016 19:48", "Corgi", "if we look at the orginal Frostmourne u will quickly, see why blizzard simply were opposed to the idea of it being reforged as a whole.The Sword is what originally drove Arthus towards the Crown of the Lich King, it was the first part of the curse he had taken.So, if we as players, took this same blade, with the same curse, it'd have the exact same effect, which would change our lore, from becoming a Deathlord to a Physical Lich King, which thus would mean we'd have to kill Bodvar for the Crown, that this Sword would will us towards.Which once we took the crown Taint us.thus Becoming the Games Raid boss, rather then a Playable Class.the Ashbringer, is wielded by a HighLord, and Remains good, with 0 curse or technical Difficulties where story is involved, Paladins can hold the Ashbringer because In Tirions death, it'd be perfectly normal to hand this weapon to the New Highlord which is the Players.there are HUGE Flaws in the idea of a Frost deathknight wielding the Physical Frostmourne, in its Shattered Shards the Curse isn't upon the blades, thus allowing us to use them freely.13/11/2016 08:30Posted by HvorgandrI want to get a 2H weapon which barely looks like a Scythe derivated from the Frostmourne itself. And let me tell you why Frost Death Knights should have a scythe instead of 2 punt swords:1. First of all, Scythe impersonates and represents the death, desolation, and cold frigid crypts six feet under the ground. This scythe reaps the fallen foes with its frost existence, and scatters the bonds of enemies lives. 2. Frost DK's are both magister and a fighter. In this cold combination, it requires a both magistrate derivated staff with a cutting edge. Blue, gray, black themed colours mixed with skulls, sharp edges and fine curves, socketed onto a great horrifying hilt. 3. This weapon could allow us to obtain dual runeforges or having a single runeforge which can be obligatoryly Razorice and such traits that would not make us feel the absence of Fallen Crusader. 4. Even, there is an instant artifact skill called \"FROSTSCYTHE\" Unlike current one, this one has greater radius and instantly applies 5 stacks of razorice to enemies who were hit by this Frostscythe. 60 seconds of cooldown with a decent or appropriate damage. 5. Especially, howling blast's skill animation could be better with that scythe. Player holds its scythe towards the enemy and casts Howling Blast. As I said, Frost DK is a combination of Outlaw Rogue and Frost Mage with colder appearance. At least, from shards of Frostmourne, this Scythe called Soulreaper would not be the waste of Frostmourne's broken shards.  About autoattack, main stat should be haste with a better multiply. This weapon even has basic stats which is mastery and haste. Traits should contain such things that increases attack speed and better runic attenuation from FDK talents. The things I said is not difficult, it is just simply requires Blizz's effort. #MakeFDKsGreatAgainPS: you can be salty about scythe because afflis and balances use it, so what then. Why not for FDK?Right lets now look at why a Frost DK Shouldn't have a Scythe, Its actually a Farming tool, it is Impractical for Melee Combat on EVERY LEVEL AND PHYSICALITY, its a STICK Swinging at it from Certain Angles would cause it to instantly be Snapped, also, if u look to the Illidari, they Use the Scythe of Souls which has Nothing to do with \"cold\".No, the Relation to that idea is the Grim Reaper wields a Scythe, and being in death is Cold, which is said as \"the touch of Death is Cold\" Where actually the grim reaper in concept simply leads those who are Ready into Death, at no place does he actually COLLECT trheir souls in the scythe.to this Day 2handed for Either Specc of DK have supplied two Runeforging, if we made it as a 2handed class, the Proc rate would just have been increased.Frostscythe Merges ur blades together into a Frozen Scythe in animation, its a very unique Animation and in all honesty supplies everything in its Name, it looks amazing, and Implements the Idea of a Scythe in the Best way, Using ur blades as Hilts of Frost.Scythes Look stupid No matter how they look in Melee Combat, Casting howling blast with ur Scythe pointed at the Enemy would Look ridiculous, Lich Kings Animation With his blade Pointed Forward Looks 100x Better.FROST DK IS BUILT ON 1HANDED CONCEPT.Lich King, WIELDS ONE HANDED, he is the PURE Concept of a Frost Death Knight, just because he wields nothing in the offhand doesn't auto make the Weapon a 2handed, by its SIZE and how its WIELDED the Weapon is a 1handed weapon.the concept of wielding a 2handed, is Understandable, people have their Preferences, however concept of wielding a Scythe on the bases of a Representation of the Grim reaper, is Terrible.this is WoW, not Real Representation, and at no point is the Scythe represented by Coldness.Look at the Scythes.Scythe of Souls - Fel Powered.Scythe of Elune - Balanced Powered.. Lunar... Goddess..not even the COLDEST WEapon of Existance the Frostmourne was a Scythe.Frostmourne Represents Coldness and Death like no other by what it stands for, its a 1handed Sword, much like the Weapons we have, the Reason its based on Shards of frostmourne is Because blizzard had to make a Decision.we could wield a 1handed looking weapon with 1handed Animations based on the Lich king with the stats and Damage of a 2handed Weapon put upon it, which would make problems where attack speed etc etc would make a Major balancing Problem.or they some how made a Secondary weapon for it.I personally, would have liked the Idea very close to the Shamans concept, that wielding the Frostmourne allowed us to Craft a Weapon from the Ice Around us.or Even betterWielded Frostmourne as a 1handed Weapon and when we go into Combat, Using certain abilities such as Remorseless Winter made us Split the Frostmourne into 2 and Use them In concession for the Fast paced Battle.no matter how u look a tthis.Much like a ENhancement Shaman, the 2handed Concept existed for the Death Knight, however it was Never blizzards orginal intention, Arthus was a Frost DK and he did not wield a 2handed weapon.. we're built on that concept.they finally removed it completely just like 2handed Enhancement, do I believe it will ever return? no I don't. I think once our class is unlocked from artifacts next expansion, they'll make attacks 1handed only Disabling 2handed for good.2handed was Never the beginning concept, like enhancement Shamans we'll have to accept that.Unholy - 2handedFrost - Dual Wield..Offers Difference, variety and both players Concepts.. while defining the Speccs by the not only Abilities but their Individual Apperances. is that a bad thing? no. is it to everyones Preference?.. no, imho they should have learned from enhancement Shaman.. and Kept this option Definitive, Preventing one of the variables from ever existing.. thus Never causing these problems."], ["Bring back 2H-Frost DK... in an cosmetic way", "29/11/2016 21:13", "Arthemida", "I will be happy if Frost DK gets skin in main hand 2handed Frostmourne and off hand Skull of Sindragosa as shield.But it never go to happen. F*** you Blizz T-T"], ["Bring back 2H-Frost DK... in an cosmetic way", "30/11/2016 04:46", "Rotflap", "We should be able to make the swords become one whenever we want. Literally just a spell like Worgen > Human. Ours would be Blades of the Fallen Prince > Frostmourne.Also when you use Sindragosa you should point your sword forward like Arthas does on Heroes of the Storm.That would be absolutely amazing and it could be implemented in like 10 minutes. (Not the new textures though).I'd settle for hungering rune weapon to just show frostmourne to be honest. Like that paladin ability that showed your weapon as Ashbringer glowing."], ["Bring back 2H-Frost DK... in an cosmetic way", "30/11/2016 15:09", "Fûrâ", "My only request is let me equip my !@#$ing offhand Azzinoth on my Blood Spec comon bring back the dw on everyspec ..... i dont care about having a 2H artifact but when i slack in dalaran i just want to equip them with my blood spec"], ["Bring back 2H-Frost DK... in an cosmetic way", "30/11/2016 23:15", "Xiess", "I was so gonna main frost dk 2h, but they took it away from us! I started finaly grindin freshy retri couse if i wana dualwield i play rogue ffs.... i wana 2h damager!Dks should be 2h only, since rogues are dw only, why this idea got skipped? I tried unholy spec, did not like that at all, i love that howling blast too much....."], ["Bring back 2H-Frost DK... in an cosmetic way", "30/11/2016 23:43", "Beoulf", "I still use Slayer of the Lifeless 10x better than the artifact appearance"], ["Bring back 2H-Frost DK... in an cosmetic way", "01/12/2016 06:35", "Shiinx", "If the mechanics stay the same i dont see why we cant have something similar to Shalamayne when Varian used it. Figure out a lore explaination and everybody's happy."], ["Bring back 2H-Frost DK... in an cosmetic way", "01/12/2016 09:43", "Arxelas", "07/11/2016 19:59Posted by AríonHello fellow DKsIm frustrated. Since Legion beginning. Not only because DK was on bottom of the meters etc, NO. It's the fact that if someone wants to play frost... He have to take this non DK matching dual wield style... Just WHY? I saw last weeks ago a topic about \"Bring back 2H FDK\". Tbh i dont want the physical playstyle back from 2H FDK. It wasnt better in any way then the dw magic dmg playstyle. Maybe only against casters it was a bit effektive.Anyways. My thoughts about to bring back 2H-FDK was to give them a cosmetic way. I just cant play and take the specc serious with this DW style. Its just annoying... Pls if any def from blizz read this *cough* Bring it on the table. Give the option to mogg those 2 1hands into a 2H and some kinda frostmourne look alike artifact appearences. So everybody can chose how he likes it.+1 Absolutely right my friend. Here another DK frustrated just because of the DW appearance. Sometimes I feel like I am a Frost Rogue...07/11/2016 20:39Posted by Ornstein+1An artifact skin.Preferably with a meaningful quest line.Rebuild frostmourne maybe.+1  I agree with you, but I am afraid that would change the curse of the Twin Blades storyline... Much easier if Blizz just let us transmog 2H on DW"], ["Bring back 2H-Frost DK... in an cosmetic way", "01/12/2016 14:00", "Komenasai", "29/11/2016 19:48Posted by CorgiThe Sword is what originally drove Arthus towards the Crown of the Lich King, it was the first part of the curse he had taken.So, if we as players, took this same blade, with the same curse, it'd have the exact same effect, which would change our lore, from becoming a Deathlord to a Physical Lich King, which thus would mean we'd have to kill Bodvar for the Crown, that this Sword would will us towardsJust for me, that sounds like another reason for doing it, same as the shadow priest dagger whispers you, another flavor element. However I am biased, I have a replica frostmourne hanging on the wall, and a history of downloading frostmourne mods for other games, so fair to say I would love a frostmourne ingame. Though personally think warlock green fire quest would be the better route to go, ie not tied to a single spec/artifact.In terms of dw mechanics, off the top of my head what is currently the offhand strike is added as a frost component to the main strike for obliterate/auto/death strike. For frostscythe/frost strike call the offhand hit a echo of damage caused by the wounds or the icy attack rupturing the wound.As for runeforges, runeforging a 1h weapon covers the whole blade, 2h weapon only covers 1 side. Ie 2h weapons can take 2 runeforges.Animations I would imagine are simple enough to change.Or just both 1h and 2h moggable frostmournes."], ["Bring back 2H-Frost DK... in an cosmetic way", "01/12/2016 14:07", "Gorhuk", "I like it with 1h DW, it feels fast."], ["Bring back 2H-Frost DK... in an cosmetic way", "01/12/2016 16:46", "Tuulan", "They literally don't have to do anything mechanic-wise (I bet most of us wouldnt care for the tooltips as well) for this to look great - you can just replace the two weapons + dual wield animations with a 2h model and a 2h animation and have the 2h move with the main-hand pace.Just enable two-handed weapons in the mog screen, this is  literally the only thing that we care about and it would probably take like 5 mins of a single dev switching some numbers.We don't want the dual wield removed, we just want an extra mogging option that makes sense lore-wise (a death knight becomes such when he abandons light and is bound by his death pact to his rune blade, at least that was your lore in warcraft 3 blizzard, remember when that was a thing?), fkn warlocks can mog their demons, come on...."], ["Blood dk Versatility and Mastery", "28/11/2016 21:21", "Hugedeal", "So which one is better for a Blood DK, is versatility better for our survival compared to mastery, because it looks like we need a lot of versatility to be efective can anyone giving some insight in this please, thanks."], ["Blood dk Versatility and Mastery", "28/11/2016 22:31", "Vymeza", "Mastery is our worst stat. Haste increases our survivability the most in so far as it aids player input by increasing rune regeneration and reducing GCD time. Second to this is Versatility and critical strike. Versa does what it says on the tin. Crit gives us parry but has big DR so stacking it becomes quite poor after a while for survival. It also increases our damage which has a swathe of benefits such as HS healing and blood plague leech and umbilicus eternus. Furthermore it increases skeletal shattering proc chance which is cool.Hope that helps. If you want more information I recommend researching these forums some more, there are longer more detailed answers somewhere.Edit: super jelly of your VH trinket. I wish the weekly cache would bless me with it."], ["Blood dk Versatility and Mastery", "29/11/2016 08:41", "Necrofenix", "aim for 30% haste and 20% parry (crit)"], ["Blood dk Versatility and Mastery", "29/11/2016 20:10", "Hugedeal", "ok thanks very much it did help! I haven't been to lucky with the versatility or haste drops but i guess ill aim for it !"]]}